
//&Вместо("УсловияОплатыТекстом")
//Функция КАНАТ_УсловияОплатыТекстом(ИсточникУсловийОплаты)
//	
//	ДанныеУсловий = Новый Структура;
//	ДанныеУсловий.Вставить("ФормаОплаты", Перечисления.ФормыОплаты.ПустаяСсылка());
//	ДанныеУсловий.Вставить("ЭтапыОплаты", Новый ТаблицаЗначений);
//	
//	Если ТипЗнч(ИсточникУсловийОплаты) = Тип("СправочникСсылка.СоглашенияСКлиентами") Тогда
//		
//		ПолучитьДанныеУсловийОплатыПоСоглашению(ИсточникУсловийОплаты, ДанныеУсловий);
//		
//	ИначеЕсли ТипЗнч(ИсточникУсловийОплаты) = Тип("СправочникСсылка.ГрафикиОплаты") Тогда
//		
//		ПолучитьДанныеУсловийОплатыПоГрафикуОплаты(ИсточникУсловийОплаты, ДанныеУсловий);
//		
//	КонецЕсли;
//	
//	МассивСтрок = Новый Массив;
//	Если ЗначениеЗаполнено(ДанныеУсловий.ФормаОплаты) Тогда
//		МассивСтрок.Добавить(СтрШаблон(НСтр("ru = 'Форма оплаты: %1.';
//											|en = 'Payment method: %1.'"), Строка(ДанныеУсловий.ФормаОплаты)));
//		МассивСтрок.Добавить(Символы.ПС);
//	КонецЕсли;
//	
//	Если ДанныеУсловий.ЭтапыОплаты.Количество() > 0 Тогда
//		МассивСтрок.Добавить(НСтр("ru = 'Этапы оплаты:';
//									|en = 'Payment steps:'"));
//	КонецЕсли;
//	
//	МассивПостоплата = Новый Массив;
//	ПредоплатаПроцент = 0;
//	//·++·Гурьев·21.08.23·#2.9·Изменения текста для условий оплаты
//	Для Каждого ЭтапОплаты Из ДанныеУсловий.ЭтапыОплаты Цикл
//		//МассивСтрок.Добавить(Символы.ПС);
//		//МассивСтрок.Добавить(СтрШаблон(НСтр("ru = '%1, отсрочка (дн.) - %2, процент платежа - %3 %%';
//		//									|en = '%1, delay (days) - %2, payment percentage - %3 %%'"),
//		//                               ЭтапОплаты.ВариантОплаты,
//		//                               ЭтапОплаты.Сдвиг,
//		//                               ЭтапОплаты.ПроцентПлатежа));
//		Если ЭтапОплаты.ВариантОтсчета = Перечисления.ВариантыОтсчетаДатыПлатежа.ОтДатыОтгрузки Тогда
//			
//			Структура = Новый Структура;
//			Структура.Вставить("Процент", ЭтапОплаты.ПроцентПлатежа);
//			Структура.Вставить("Сдвиг", ЭтапОплаты.Сдвиг);
//			
//			МассивПостоплата.Добавить(Структура);
//			
//			//МассивСтрок.Добавить(СтрШаблон("Постоплата - %1 %%, в течение %2 (дн.) после уведомления о готовности", ЭтапОплаты.ПроцентПлатежа, ЭтапОплаты.Сдвиг));
//			
//		Иначе
//			
//			ПредоплатаПроцент = ПредоплатаПроцент + ЭтапОплаты.ПроцентПлатежа;
//			
//			//МассивСтрок.Добавить(СтрШаблон("Предоплата - %1 %%", ЭтапОплаты.ПроцентПлатежа));
//			
//		КонецЕсли;
//		
//		//МассивСтрок.Добавить(".");
//	КонецЦикла;
//	
//	Если ПредоплатаПроцент > 0 Тогда
//		
//		МассивСтрок.Добавить(Символы.ПС);
//		МассивСтрок.Добавить(СтрШаблон("Предоплата - %1 %%", ПредоплатаПроцент));
//		МассивСтрок.Добавить(".")
//		
//	КонецЕсли;
//	
//	Для Каждого Постоплата Из МассивПостоплата Цикл
//		
//		МассивСтрок.Добавить(Символы.ПС);
//		МассивСтрок.Добавить(СтрШаблон("Постоплата - %1 %%, в течение %2 (дн.) после уведомления о готовности", Постоплата.Процент, Постоплата.Сдвиг));
//		МассивСтрок.Добавить(".")
//		
//	КонецЦикла;
//	//·--·Гурьев
//	Возврат СтрСоединить(МассивСтрок);
//	
//КонецФункции

//&Вместо("ПолучитьДанныеУсловийОплатыПоГрафикуОплаты")
//Процедура КАНАТ_ПолучитьДанныеУсловийОплатыПоГрафикуОплаты(График, ДанныеУсловий)
//	Запрос = Новый Запрос;
//	Запрос.Текст = "
//	|ВЫБРАТЬ
//	|	ГрафикиОплаты.ФормаОплаты КАК ФормаОплаты
//	|ИЗ
//	|	Справочник.ГрафикиОплаты КАК ГрафикиОплаты
//	|ГДЕ
//	|	ГрафикиОплаты.Ссылка = &График
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ГрафикиОплатыЭтапы.ВариантОплаты  КАК ВариантОплаты,
//	|	ГрафикиОплатыЭтапы.Сдвиг          КАК Сдвиг,
//	|	ГрафикиОплатыЭтапы.ПроцентПлатежа КАК ПроцентПлатежа,
//	|	ГрафикиОплатыЭтапы.ВариантОтсчета КАК ВариантОтсчета
//	|ИЗ
//	|	Справочник.ГрафикиОплаты.Этапы КАК ГрафикиОплатыЭтапы
//	|ГДЕ
//	|	ГрафикиОплатыЭтапы.Ссылка = &График
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	ГрафикиОплатыЭтапы.НомерСтроки";
//	
//	Запрос.УстановитьПараметр("График", График);
//	
//	Результат = Запрос.ВыполнитьПакет();
//		
//	ВыборкаШапка       = Результат[0].Выбрать();
//	ТаблицаЭтапыОплаты = Результат[1].Выгрузить();
//	
//	Если ВыборкаШапка.Следующий() Тогда
//		
//		ДанныеУсловий.ФормаОплаты = ВыборкаШапка.ФормаОплаты;
//		
//	КонецЕсли;
//	
//	ДанныеУсловий.ЭтапыОплаты = ТаблицаЭтапыОплаты;
//КонецПроцедуры

//&Вместо("ПолучитьДанныеУсловийОплатыПоСоглашению")
//Процедура КАНАТ_ПолучитьДанныеУсловийОплатыПоСоглашению(Соглашение, ДанныеУсловий)
//	ИспользоватьГрафикиОплаты = ПолучитьФункциональнуюОпцию("ИспользоватьГрафикиОплаты");
//	
//	Запрос = Новый Запрос;
//	Запрос.УстановитьПараметр("Соглашение", Соглашение);
//	
//	Если ИспользоватьГрафикиОплаты Тогда
//		
//		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
//		|	СоглашенияСКлиентами.ГрафикОплаты КАК Ссылка
//		|ПОМЕСТИТЬ ТребуемыйГрафикОплаты
//		|ИЗ
//		|	Справочник.СоглашенияСКлиентами КАК СоглашенияСКлиентами
//		|ГДЕ
//		|	СоглашенияСКлиентами.Ссылка = &Соглашение
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////1
//		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
//		|	ГрафикиОплаты.ФормаОплаты КАК ФормаОплаты
//		|ИЗ
//		|	Справочник.ГрафикиОплаты КАК ГрафикиОплаты
//		|ГДЕ
//		|	ГрафикиОплаты.Ссылка В
//		|			(ВЫБРАТЬ
//		|				ТребуемыйГрафикОплаты.Ссылка
//		|			ИЗ
//		|				ТребуемыйГрафикОплаты КАК ТребуемыйГрафикОплаты)
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////2
//		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
//		|	ГрафикиОплатыЭтапы.ВариантОплаты  КАК ВариантОплаты,
//		|	ГрафикиОплатыЭтапы.Сдвиг          КАК Сдвиг,
//		|	ГрафикиОплатыЭтапы.ПроцентПлатежа КАК ПроцентПлатежа,
//		|	ГрафикиОплатыЭтапы.ВариантОтсчета КАК ВариантОтсчета
//		|ИЗ
//		|	Справочник.ГрафикиОплаты.Этапы КАК ГрафикиОплатыЭтапы
//		|ГДЕ
//		|	ГрафикиОплатыЭтапы.Ссылка В
//		|			(ВЫБРАТЬ
//		|				ТребуемыйГрафикОплаты.Ссылка
//		|			ИЗ
//		|				ТребуемыйГрафикОплаты КАК ТребуемыйГрафикОплаты)";
//		
//		Результат = Запрос.ВыполнитьПакет();
//		
//		ВыборкаШапка       = Результат[1].Выбрать();
//		ТаблицаЭтапыОплаты = Результат[2].Выгрузить();
//		
//	Иначе
//		
//		Запрос.Текст = "
//		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
//		|	СоглашенияСКлиентами.ФормаОплаты КАК ФормаОплаты
//		|ИЗ
//		|	Справочник.СоглашенияСКлиентами КАК СоглашенияСКлиентами
//		|ГДЕ
//		|	СоглашенияСКлиентами.Ссылка = &Соглашение
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////1
//		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
//		|	СоглашенияСКлиентамиЭтапыГрафикаОплаты.ВариантОплаты КАК ВариантОплаты,
//		|	СоглашенияСКлиентамиЭтапыГрафикаОплаты.Сдвиг КАК Сдвиг,
//		|	СоглашенияСКлиентамиЭтапыГрафикаОплаты.ПроцентПлатежа КАК ПроцентПлатежа,
//		|	СоглашенияСКлиентамиЭтапыГрафикаОплаты.ВариантОтсчета КАК ВариантОтсчета
//		|ИЗ
//		|	Справочник.СоглашенияСКлиентами.ЭтапыГрафикаОплаты КАК СоглашенияСКлиентамиЭтапыГрафикаОплаты
//		|ГДЕ
//		|	СоглашенияСКлиентамиЭтапыГрафикаОплаты.Ссылка = &Соглашение";
//		
//		Результат = Запрос.ВыполнитьПакет();
//		
//		ВыборкаШапка       = Результат[0].Выбрать();
//		ТаблицаЭтапыОплаты = Результат[1].Выгрузить();
//		
//	КонецЕсли;
//	
//	Если ВыборкаШапка.Следующий() Тогда
//		
//		ДанныеУсловий.ФормаОплаты = ВыборкаШапка.ФормаОплаты;
//		
//	КонецЕсли;
//	
//	ДанныеУсловий.ЭтапыОплаты = ТаблицаЭтапыОплаты;
//КонецПроцедуры

&ИзменениеИКонтроль("УсловияОплатыТекстом")
Функция КАНАТ_УсловияОплатыТекстом(ИсточникУсловийОплаты)

	ДанныеУсловий = Новый Структура;
	ДанныеУсловий.Вставить("ФормаОплаты", Перечисления.ФормыОплаты.ПустаяСсылка());
	ДанныеУсловий.Вставить("ЭтапыОплаты", Новый ТаблицаЗначений);

	Если ТипЗнч(ИсточникУсловийОплаты) = Тип("СправочникСсылка.СоглашенияСКлиентами") Тогда

		ПолучитьДанныеУсловийОплатыПоСоглашению(ИсточникУсловийОплаты, ДанныеУсловий);

	ИначеЕсли ТипЗнч(ИсточникУсловийОплаты) = Тип("СправочникСсылка.ГрафикиОплаты") Тогда

		ПолучитьДанныеУсловийОплатыПоГрафикуОплаты(ИсточникУсловийОплаты, ДанныеУсловий);

	КонецЕсли;

	МассивСтрок = Новый Массив;
	Если ЗначениеЗаполнено(ДанныеУсловий.ФормаОплаты) Тогда
		МассивСтрок.Добавить(СтрШаблон(НСтр("ru = 'Форма оплаты: %1.';
		|en = 'Payment method: %1.'"), Строка(ДанныеУсловий.ФормаОплаты)));
		МассивСтрок.Добавить(Символы.ПС);
	КонецЕсли;

	Если ДанныеУсловий.ЭтапыОплаты.Количество() > 0 Тогда
		МассивСтрок.Добавить(НСтр("ru = 'Этапы оплаты:';
		|en = 'Payment milestones:'"));
	КонецЕсли;
	#Вставка
	МассивПостоплата = Новый Массив;
	ПредоплатаПроцент = 0;
	#КонецВставки
	Для Каждого ЭтапОплаты Из ДанныеУсловий.ЭтапыОплаты Цикл
		#Удаление
		МассивСтрок.Добавить(Символы.ПС);
		МассивСтрок.Добавить(СтрШаблон(НСтр("ru = '%1, отсрочка (дн.) - %2, процент платежа - %3 %%';
		|en = '%1, delay (days) - %2, payment percentage - %3 %%'"),
		ЭтапОплаты.ВариантОплаты,
		ЭтапОплаты.Сдвиг,
		ЭтапОплаты.ПроцентПлатежа));
		МассивСтрок.Добавить(".");
		#КонецУдаления
		#Вставка
		Если ЭтапОплаты.ВариантОтсчета = Перечисления.ВариантыОтсчетаДатыПлатежа.ОтДатыОтгрузки Тогда
			
			Структура = Новый Структура;
			Структура.Вставить("Процент", ЭтапОплаты.ПроцентПлатежа);
			Структура.Вставить("Сдвиг", ЭтапОплаты.Сдвиг);
			
			МассивПостоплата.Добавить(Структура);
			
			//МассивСтрок.Добавить(СтрШаблон("Постоплата - %1 %%, в течение %2 (дн.) после уведомления о готовности", ЭтапОплаты.ПроцентПлатежа, ЭтапОплаты.Сдвиг));
			
		Иначе
			
			ПредоплатаПроцент = ПредоплатаПроцент + ЭтапОплаты.ПроцентПлатежа;
			
			//МассивСтрок.Добавить(СтрШаблон("Предоплата - %1 %%", ЭтапОплаты.ПроцентПлатежа));
			
		КонецЕсли;
		
		//МассивСтрок.Добавить(".");
	КонецЦикла;
	
	Если ПредоплатаПроцент > 0 Тогда
		
		МассивСтрок.Добавить(Символы.ПС);
		МассивСтрок.Добавить(СтрШаблон("Предоплата - %1 %%", ПредоплатаПроцент));
		МассивСтрок.Добавить(".")
		
	КонецЕсли;
	
	Для Каждого Постоплата Из МассивПостоплата Цикл
		
		МассивСтрок.Добавить(Символы.ПС);
		МассивСтрок.Добавить(СтрШаблон("Постоплата - %1 %%, в течение %2 (дн.) после уведомления о готовности", Постоплата.Процент, Постоплата.Сдвиг));
		МассивСтрок.Добавить(".")
		#КонецВставки
	КонецЦикла;

	Возврат СтрСоединить(МассивСтрок);

КонецФункции

&ИзменениеИКонтроль("ПолучитьДанныеУсловийОплатыПоГрафикуОплаты")
Процедура КАНАТ_ПолучитьДанныеУсловийОплатыПоГрафикуОплаты(График, ДанныеУсловий)

	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ГрафикиОплаты.ФормаОплаты КАК ФормаОплаты
	|ИЗ
	|	Справочник.ГрафикиОплаты КАК ГрафикиОплаты
	|ГДЕ
	|	ГрафикиОплаты.Ссылка = &График
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГрафикиОплатыЭтапы.ВариантОплаты  КАК ВариантОплаты,
	|	ГрафикиОплатыЭтапы.Сдвиг          КАК Сдвиг,
	|	ГрафикиОплатыЭтапы.ПроцентПлатежа КАК ПроцентПлатежа 
	#Вставка
	|	,
	|	ГрафикиОплатыЭтапы.ВариантОтсчета КАК ВариантОтсчета
	#КонецВставки
	|ИЗ
	|	Справочник.ГрафикиОплаты.Этапы КАК ГрафикиОплатыЭтапы
	|ГДЕ
	|	ГрафикиОплатыЭтапы.Ссылка = &График
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГрафикиОплатыЭтапы.НомерСтроки";

	Запрос.УстановитьПараметр("График", График);

	Результат = Запрос.ВыполнитьПакет();

	ВыборкаШапка       = Результат[0].Выбрать();
	ТаблицаЭтапыОплаты = Результат[1].Выгрузить();

	Если ВыборкаШапка.Следующий() Тогда

		ДанныеУсловий.ФормаОплаты = ВыборкаШапка.ФормаОплаты;

	КонецЕсли;

	ДанныеУсловий.ЭтапыОплаты = ТаблицаЭтапыОплаты;

КонецПроцедуры

&ИзменениеИКонтроль("ПолучитьДанныеУсловийОплатыПоСоглашению")
Процедура КАНАТ_ПолучитьДанныеУсловийОплатыПоСоглашению(Соглашение, ДанныеУсловий)

	ИспользоватьГрафикиОплаты = ПолучитьФункциональнуюОпцию("ИспользоватьГрафикиОплаты");

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Соглашение", Соглашение);

	Если ИспользоватьГрафикиОплаты Тогда

		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СоглашенияСКлиентами.ГрафикОплаты КАК Ссылка
		|ПОМЕСТИТЬ ТребуемыйГрафикОплаты
		|ИЗ
		|	Справочник.СоглашенияСКлиентами КАК СоглашенияСКлиентами
		|ГДЕ
		|	СоглашенияСКлиентами.Ссылка = &Соглашение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////1
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ГрафикиОплаты.ФормаОплаты КАК ФормаОплаты
		|ИЗ
		|	Справочник.ГрафикиОплаты КАК ГрафикиОплаты
		|ГДЕ
		|	ГрафикиОплаты.Ссылка В
		|			(ВЫБРАТЬ
		|				ТребуемыйГрафикОплаты.Ссылка
		|			ИЗ
		|				ТребуемыйГрафикОплаты КАК ТребуемыйГрафикОплаты)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////2
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ГрафикиОплатыЭтапы.ВариантОплаты  КАК ВариантОплаты,
		|	ГрафикиОплатыЭтапы.Сдвиг          КАК Сдвиг,
		|	ГрафикиОплатыЭтапы.ПроцентПлатежа КАК ПроцентПлатежа 
		#Вставка
		|	,
		|	СоглашенияСКлиентамиЭтапыГрафикаОплаты.ВариантОтсчета КАК ВариантОтсчета
		#КонецВставки
		|ИЗ
		|	Справочник.ГрафикиОплаты.Этапы КАК ГрафикиОплатыЭтапы
		|ГДЕ
		|	ГрафикиОплатыЭтапы.Ссылка В
		|			(ВЫБРАТЬ
		|				ТребуемыйГрафикОплаты.Ссылка
		|			ИЗ
		|				ТребуемыйГрафикОплаты КАК ТребуемыйГрафикОплаты)";

		Результат = Запрос.ВыполнитьПакет();

		ВыборкаШапка       = Результат[1].Выбрать();
		ТаблицаЭтапыОплаты = Результат[2].Выгрузить();

	Иначе

		Запрос.Текст = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СоглашенияСКлиентами.ФормаОплаты КАК ФормаОплаты
		|ИЗ
		|	Справочник.СоглашенияСКлиентами КАК СоглашенияСКлиентами
		|ГДЕ
		|	СоглашенияСКлиентами.Ссылка = &Соглашение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////1
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СоглашенияСКлиентамиЭтапыГрафикаОплаты.ВариантОплаты КАК ВариантОплаты,
		|	СоглашенияСКлиентамиЭтапыГрафикаОплаты.Сдвиг КАК Сдвиг,
		|	СоглашенияСКлиентамиЭтапыГрафикаОплаты.ПроцентПлатежа КАК ПроцентПлатежа
		#Вставка
		|	,
		|	СоглашенияСКлиентамиЭтапыГрафикаОплаты.ВариантОтсчета КАК ВариантОтсчета
		#КонецВставки
		|ИЗ
		|	Справочник.СоглашенияСКлиентами.ЭтапыГрафикаОплаты КАК СоглашенияСКлиентамиЭтапыГрафикаОплаты
		|ГДЕ
		|	СоглашенияСКлиентамиЭтапыГрафикаОплаты.Ссылка = &Соглашение";

		Результат = Запрос.ВыполнитьПакет();

		ВыборкаШапка       = Результат[0].Выбрать();
		ТаблицаЭтапыОплаты = Результат[1].Выгрузить();

	КонецЕсли;

	Если ВыборкаШапка.Следующий() Тогда

		ДанныеУсловий.ФормаОплаты = ВыборкаШапка.ФормаОплаты;

	КонецЕсли;

	ДанныеУсловий.ЭтапыОплаты = ТаблицаЭтапыОплаты;

КонецПроцедуры
