
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Объект.Родитель.Пустая() Тогда
		УбратьНезаполненныеПараметры();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УбратьНезаполненныеПараметры()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КАНАТ_НастройкиПечатиПрайсЛиста.Параметр1 КАК Параметр1,
		|	КАНАТ_НастройкиПечатиПрайсЛиста.Параметр2 КАК Параметр2,
		|	КАНАТ_НастройкиПечатиПрайсЛиста.Параметр3 КАК Параметр3,
		|	КАНАТ_НастройкиПечатиПрайсЛиста.Параметр4 КАК Параметр4,
		|	КАНАТ_НастройкиПечатиПрайсЛиста.Параметр5 КАК Параметр5,
		|	КАНАТ_НастройкиПечатиПрайсЛиста.Параметр6 КАК Параметр6,
		|	КАНАТ_НастройкиПечатиПрайсЛиста.Параметр7 КАК Параметр7,
		|	КАНАТ_НастройкиПечатиПрайсЛиста.Параметр8 КАК Параметр8,
		|	КАНАТ_НастройкиПечатиПрайсЛиста.Параметр9 КАК Параметр9,
		|	КАНАТ_НастройкиПечатиПрайсЛиста.Параметр10 КАК Параметр10
		|ИЗ
		|	Справочник.КАНАТ_НастройкиПечатиПрайсЛиста КАК КАНАТ_НастройкиПечатиПрайсЛиста
		|ГДЕ
		|	КАНАТ_НастройкиПечатиПрайсЛиста.Ссылка = &Ссылка";
	
	Запрос.Параметры.Вставить("Ссылка", Объект.Родитель);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Для Счетчик = 1 По 10 Цикл
			
			ИмяПараметра = "Параметр" + Строка(Счетчик);
			
			Если Не ПустаяСтрока(Выборка[ИмяПараметра]) Тогда 
				
				Элементы[ИмяПараметра].Заголовок = Выборка[ИмяПараметра];
				
			Иначе
				
				Элементы[ИмяПараметра].Видимость = Ложь;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры;