// <+БИТ> Руденков_Е.И. 23.07.2024  
// ЧТЗ ШК-1 Канат Процесс штрихкодирования
&ИзменениеИКонтроль("НачатьОбмен")
Процедура КАНАТ_НачатьОбмен()

	#Если МобильныйКлиент Тогда

		Если Не ИдетОбмен() Тогда
            #Удаление
			Если ОсновнойСерверДоступен() = Истина Тогда
			#КонецУдаления
			#Вставка
			Если ОсновнойСерверДоступен() = Истина И Ложь Тогда
			#КонецВставки	
				
				ПараметрыПриложения.Вставить("СтандартныеПодсистемы.ОбъектыУТКАУП.ИдентификаторФоновогоЗадания", ОбменМобильныеАвтономныйСервер.ВыполнитьОбменДаннымиВФоне());
				Оповестить("НачалсяОбмен");
				ПодключитьОбработчикОжидания("НаблюдениеЗаСинхронизацией", 2);

			Иначе
               	#Удаление
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = НСтр("ru = 'Обмен невозможен. Недоступен основной сервер.';
				|en = 'Exchange is not possible. The main server is unavailable.'", "ru");
				Сообщение.Сообщить();
				#КонецУдаления
			КонецЕсли;

		КонецЕсли;

	#КонецЕсли

КонецПроцедуры // <-БИТ> Руденков_Е.И. 23.07.2024
