
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("НазваниеОтчета", "ОтчетПетлиСтраховочныеАрамидные");
	ПараметрыФормы.Вставить("Синоним", "Отчет по петлям страховочным термостойким арамидным");
	ОткрытьФорму("Обработка.КАНАТ_ОтчетыРезультатИспытаний.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
