// <+БИТ> Руденков_Е.И. 23.07.2024  
// ЧТЗ ШК-1 Канат Процесс штрихкодирования
&ИзменениеИКонтроль("НачатьОбмен")
Функция КАНАТ_НачатьОбмен(КодУзла, НаименованиеМобильногоКомпьютера, НомерОтправленного, НомерПринятого)

	Если НЕ ПравоДоступа("Чтение", Метаданные.ПланыОбмена.Мобильные) Тогда

		ВызватьИсключение(НСтр("ru = 'У пользователя нет прав на синхронизацию данных с мобильным приложением';
		|en = 'User does not have access rights to synchronize data with the mobile application'"));

	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);

	УзелОбмена = ПланыОбмена.Мобильные.ЭтотУзел().ПолучитьОбъект();
	Если НЕ ЗначениеЗаполнено(УзелОбмена.Код) Тогда

		УзелОбмена.Код = "001";
		УзелОбмена.Наименование = НСтр("ru = 'Центральный';
		|en = 'Central'");
		УзелОбмена.Записать();

	КонецЕсли;

	УзелОбмена = ПланыОбмена.Мобильные.НайтиПоКоду(КодУзла); 
	Если УзелОбмена.Пустая() Тогда

		НовыйУзел = ПланыОбмена.Мобильные.СоздатьУзел();

		НачатьТранзакцию();

		Попытка

			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Константа.КодНовогоУзлаПланаОбмена");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			Блокировка.Заблокировать();

			КодНовогоУзла = Константы.КодНовогоУзлаПланаОбмена.Получить();
			Если КодНовогоУзла = 0 Тогда 
				КодНовогоУзла = 2;
			КонецЕсли;	
			Константы.КодНовогоУзлаПланаОбмена.Установить(КодНовогоУзла + 1);

			ЗафиксироватьТранзакцию();

		Исключение
			ОтменитьТранзакцию();
		КонецПопытки;

		Если СтрДлина(КодНовогоУзла) < 3 Тогда
			НовыйУзел.Код = Формат(КодНовогоУзла, "ЧЦ=3; ЧВН=");
		Иначе
			НовыйУзел.Код = КодНовогоУзла;
		КонецЕсли;
		НовыйУзел.Наименование = НаименованиеМобильногоКомпьютера;
		НовыйУзел.НомерОтправленного = НомерОтправленного;
		НовыйУзел.НомерПринятого = НомерПринятого;
		НовыйУзел.Записать();
		ОбменМобильныеПереопределяемый.ЗарегистрироватьИзмененияДанных(НовыйУзел.Ссылка);
		УзелОбмена = НовыйУзел.Ссылка;

		СтруктураРеквизитовУзла = Новый Структура("Код", НовыйУзел.Код);

	Иначе

		СтруктураРеквизитовУзла = Новый Структура("Код, ПометкаУдаления, Наименование, НомерПринятого, НомерОтправленного");   
		ЗаполнитьЗначенияСвойств(СтруктураРеквизитовУзла, УзелОбмена);

		Если СтруктураРеквизитовУзла.ПометкаУдаления
			Или СтруктураРеквизитовУзла.Наименование <> НаименованиеМобильногоКомпьютера Тогда

			Узел = УзелОбмена.ПолучитьОбъект();
			Узел.ПометкаУдаления = Ложь;
			Узел.Наименование = НаименованиеМобильногоКомпьютера;
			Узел.Записать();

		КонецЕсли;

		Если СтруктураРеквизитовУзла.НомерОтправленного <> НомерОтправленного ИЛИ
			СтруктураРеквизитовУзла.НомерПринятого <> НомерПринятого Тогда

			Узел = УзелОбмена.ПолучитьОбъект();
			Узел.НомерОтправленного = НомерОтправленного;
			Узел.НомерПринятого = НомерПринятого;
			#Удаление
			Узел.Записать();
			ОбменМобильныеПереопределяемый.ЗарегистрироватьИзмененияДанных(УзелОбмена);
            #КонецУдаления
			#Вставка
			Попытка
				Узел.Записать(); 
				ОбменМобильныеПереопределяемый.ЗарегистрироватьИзмененияДанных(УзелОбмена);
			Исключение
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Выполнение операции'"),
				УровеньЖурналаРегистрации.Ошибка,,,
				"Ошибка Узел.Записать(), код узла: " + КодУзла);
			КонецПопытки;	
			#КонецВставки
		КонецЕсли;

	КонецЕсли;

	Возврат СтруктураРеквизитовУзла.Код;

КонецФункции // <-БИТ> Руденков_Е.И. 23.07.2024
