//++ Гурьев ЧТЗ_К2_v_6.3

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьСертификат();
	ОбновитьСписокВыбораНоменклатурыСырья();
	ОбновитьСписокВыбораЗаказов();
	//++ Гурьев 10.10.23 ЧТЗ_К3
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	//-- Гурьев 10.10.23 ЧТЗ_К3
	ПериодСырье.ДатаНачала = Объект.ДатаНачалаСырье;
	ПериодСырье.ДатаОкончания = Объект.ДатаОкончанияСырье;
	
	//++Бит Трейгер П.М. 19.12.2024 Блок Качества. Переделка.
	Если не ЗначениеЗаполнено(Объект.Ссылка) Тогда
	Объект.автор = Пользователи.ТекущийПользователь();	
    конецЕсли;
    Элементы.ГруппаСертификатКачества.Видимость = ложь;
    //ЭтаФорма.Элементы.ГруппаСертификатКачества.Видимость = ложь;
    //--Бит Трейгер П.М. 19.12.2024 Блок Качества. Переделка. 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПродукцияПриИзменении(Элемент)
	ПродукцияПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПродукцияПриИзмененииНаСервере()
	
	ЗаполнитьТЧРезультатИспытаний();
	ЗаполнитьСертификат();
	ОбновитьСписокВыбораЗаказов();
	
	Объект.НТДПродукции = Объект.Продукция.КАНАТ_НТДНоменклатуры;
	Объект.ВидГотовойПродукцииИспытания = Объект.Продукция.КАНАТКач_ВидДляКонтроляКачества;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказКлиентаПриИзменении(Элемент)
	ЗаказКлиентаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаказКлиентаПриИзмененииНаСервере()
	ЗаполнитьСертификат();
	ОбновитьСписокВыбораЗаказов();
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	ОбновитьСписокВыбораНоменклатурыСырья();
КонецПроцедуры

&НаКлиенте
Процедура ЗаказНаПроизводствоПриИзменении(Элемент)
	ЗаказНаПроизводствоПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаказНаПроизводствоПриИзмененииНаСервере()
	ОбновитьСписокВыбораЗаказов();
КонецПроцедуры

&НаКлиенте
Процедура ЗаказКлиентаОчистка(Элемент, СтандартнаяОбработка)
	ОбновитьСписокВыбораЗаказов();
КонецПроцедуры

&НаКлиенте
Процедура ЗаказНаПроизводствоОчистка(Элемент, СтандартнаяОбработка)
	ОбновитьСписокВыбораЗаказов();
КонецПроцедуры

&НаКлиенте
Процедура ПериодСырьеПриИзменении(Элемент)
	ОбновитьСписокВыбораНоменклатурыСырья();
	Объект.ДатаНачалаСырье = ПериодСырье.ДатаНачала;
	Объект.ДатаОкончанияСырье = ПериодСырье.ДатаОкончания;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРезультатИспытаний

&НаКлиенте
Процедура РезультатИспытанийПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.ВыводитьВПФ = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСырье

&НаКлиенте
Процедура СырьеПриИзменении(Элемент)
	
	ИзменитьТекстСырьяДляПечати();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьРезультат(Команда)
	ЗаполнитьРезультатСервер();
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьСырье(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Период",             ПериодСырье);
	ПараметрыОткрытия.Вставить("Склад",              Объект.Склад);
	ПараметрыОткрытия.Вставить("РезультатИспытаний", Объект.Ссылка);
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаПодбораСырьяКлиент", ЭтотОбъект);
	
	ОткрытьФорму("Документ.КАНАТ_РезультатИспытаний.Форма.ФормаПодбораСырья",
				 ПараметрыОткрытия,
				 ЭтаФорма,
				 ,
				 ,
				 ,
				 ОписаниеОповещения,
				 РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ЗаполнитьСертификат()
	
	Если Объект.Продукция.Пустая() ИЛИ Объект.ЗаказКлиента.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиентаТовары.КАНАТ_Сертификат КАК Сертификат
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|ГДЕ
		|	ЗаказКлиентаТовары.Ссылка = &ЗаказКлиента
		|	И ЗаказКлиентаТовары.Номенклатура = &Продукция
		|	И ЗаказКлиентаТовары.КАНАТ_Сертификат <> ЗНАЧЕНИЕ(Справочник.КАНАТ_Сертификаты.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("ЗаказКлиента", Объект.ЗаказКлиента);
	Запрос.УстановитьПараметр("Продукция", Объект.Продукция);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Сертификат = ВыборкаДетальныеЗаписи.Сертификат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧРезультатИспытаний()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НоменклатураКАНАТ_ПоказателиНТД.Показатель КАК Показатель,
		|	НоменклатураКАНАТ_ПоказателиНТД.Размерность КАК ЕдИзм,
		|	НоменклатураКАНАТ_ПоказателиНТД.Значение КАК Норма,
		|	НоменклатураКАНАТ_ПоказателиНТД.Отклонение КАК ДопустимоеОтклонение,
		|	Истина КАК ВыводитьВПФ
		|ИЗ
		|	Справочник.Номенклатура.КАНАТ_ПоказателиНТД КАК НоменклатураКАНАТ_ПоказателиНТД
		|ГДЕ
		|	НоменклатураКАНАТ_ПоказателиНТД.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Продукция);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Объект.РезультатИспытаний.Загрузить(РезультатЗапроса);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРезультатСервер()
	Если Не Объект.НТДПродукции.Пустая() Тогда
		Объект.Результат = СтрШаблон("Соответствует %1", Объект.НТДПродукции.Наименование);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокВыбораНоменклатурыСырья()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РаспределениеЗапасов.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
	|ГДЕ
	|	РаспределениеЗапасов.Склад = &Склад
	|	//И РаспределениеЗапасов.ВНаличии > 0
	|	//И РаспределениеЗапасов.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
	|	И РаспределениеЗапасов.ЗаказНаОтгрузку.Дата Между &ДатаНачала И &ДатаОкончания";
	
	Запрос.УстановитьПараметр("Склад",         Объект.Склад);
	Запрос.УстановитьПараметр("ДатаНачала",    ПериодСырье.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ПериодСырье.ДатаОкончания);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ДоступнаяНоменклатура = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		ДоступнаяНоменклатура.Добавить(Выборка.Номенклатура);
		
	КонецЦикла; 
	
	Параметр = Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(ДоступнаяНоменклатура));
	мПараметрыВыбора = Новый Массив;
	мПараметрыВыбора.Добавить(Параметр);
	
	//На данный момент отбор выключен
	//ЭтаФорма.Элементы.Продукция.ПараметрыВыбора = Новый ФиксированныйМассив(мПараметрыВыбора);
	//ЭтаФорма.Элементы.СырьеСсылка.ПараметрыВыбора = Новый ФиксированныйМассив(мПараметрыВыбора);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокВыбораЗаказов()
	
	//Запрос
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	ЗаказКлиентаТовары.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаПроизводство2_2 КАК ЗаказНаПроизводство2_2
	               |		ПО ЗаказКлиентаТовары.Ссылка = ЗаказНаПроизводство2_2.ДокументОснование
	               |ГДЕ
	               |	ЗаказКлиентаТовары.Номенклатура = &Номенклатура
	               |	И (&ЗаказНаПроизводствоПараметр = ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
	               |			ИЛИ ЗаказНаПроизводство2_2.Ссылка = &ЗаказНаПроизводствоПараметр)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	ЗаказНаПроизводство2_2Продукция.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ЗаказНаПроизводство2_2.Продукция КАК ЗаказНаПроизводство2_2Продукция
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
	               |		ПО ЗаказНаПроизводство2_2Продукция.Ссылка.ДокументОснование =  ЗаказКлиента.Ссылка
	               |ГДЕ
	               |	ЗаказНаПроизводство2_2Продукция.Номенклатура = &Номенклатура
	               |	И (&ЗаказКлиентаПараметр = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	               |			ИЛИ ЗаказКлиента.Ссылка = &ЗаказКлиентаПараметр)";
	
	Запрос.УстановитьПараметр("Номенклатура",                Объект.Продукция);
	Запрос.УстановитьПараметр("ЗаказКлиентаПараметр",        Объект.ЗаказКлиента);
	Запрос.УстановитьПараметр("ЗаказНаПроизводствоПараметр", Объект.ЗаказНаПроизводство);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ВыборкаЗаказКлиента = РезультатЗапроса[0].Выбрать();
	ВыборкаЗаказНаПроизводство = РезультатЗапроса[1].Выбрать();
	
	//Заказ клиента
	ДоступныеЗаказыКлиента = Новый Массив;
	
	Пока ВыборкаЗаказКлиента.Следующий() Цикл
		
		ДоступныеЗаказыКлиента.Добавить(ВыборкаЗаказКлиента.Ссылка);
		
	КонецЦикла; 
	
	Параметр = Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(ДоступныеЗаказыКлиента));
	мПараметрыВыбора = Новый Массив;
	мПараметрыВыбора.Добавить(Параметр);
	
	ЭтаФорма.Элементы.ЗаказКлиента.ПараметрыВыбора = Новый ФиксированныйМассив(мПараметрыВыбора);
	
	//Заказ на производство
	ДоступныеЗаказыНаПроизводство = Новый Массив;
	
	Пока ВыборкаЗаказНаПроизводство.Следующий() Цикл
		
		ДоступныеЗаказыНаПроизводство.Добавить(ВыборкаЗаказНаПроизводство.Ссылка);
		
	КонецЦикла; 
	
	Параметр = Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(ДоступныеЗаказыНаПроизводство));
	мПараметрыВыбора = Новый Массив;
	мПараметрыВыбора.Добавить(Параметр);
	
	ЭтаФорма.Элементы.ЗаказНаПроизводство.ПараметрыВыбора = Новый ФиксированныйМассив(мПараметрыВыбора);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПодбораСырьяКлиент(МассивСырье, ДопПараметры) Экспорт
	
	Если ТипЗнч(МассивСырье) = Тип("Массив") Тогда
	
		Для Каждого ЭлементСырье Из МассивСырье Цикл
			
			СтрокаСырье = Объект.Сырье.Добавить();
			СтрокаСырье.Сырье = ЭлементСырье.Сырье;
			СтрокаСырье.ХарактеристикаСырья = ЭлементСырье.Характеристика;
			//++Бит Трейгер П.М. 20.12.2024 Блок Качества. Переделка. 
			СтрокаСырье.ПартияСырья = Строка(ЭлементСырье.Серия);
			//--Бит Трейгер П.М. 20.12.2024 Блок Качества. Переделка. 
		КонецЦикла;
		
		ИзменитьТекстСырьяДляПечати();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьТекстСырьяДляПечати()
	
	Объект.СырьеДляПечатнойФормы = "";
	
	Для Каждого Строка Из Объект.Сырье Цикл
		
		Объект.СырьеДляПечатнойФормы = СтрШаблон("%1%2%3%4;",
												 Объект.СырьеДляПечатнойФормы,
												 ?(ЗначениеЗаполнено(Строка.Сырье), " ", "") + Строка.Сырье,
												 ?(ЗначениеЗаполнено(Строка.ХарактеристикаСырья), " ", "") + Строка.ХарактеристикаСырья,
												 ?(ЗначениеЗаполнено(Строка.ПримечаниеПоСырью), " ", "") + Строка.ПримечаниеПоСырью);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СкладНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	//Закоментил, света сказала что не нужно
	//БИТ_++ Шимсиев Накладываем отбор на форму выбора склада
	//СтандартнаяОбработка = ложь;
	//ПараметрыФормы = Новый Структура;
	//ПараметрыФормы.Вставить("РежимВыбора",Истина); 	
	//ПараметрыОтбора = Новый Структура;
	//ПараметрыОтбора.Вставить("Подразделение", Объект.Цех);
	//ПараметрыФормы = Новый Структура;
	//ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора); 
	//ОткрытьФорму("Справочник.Склады.ФормаВыбора",ПараметрыФормы,ЭтаФорма);  
	//БИТ_-- Шимсиев Накладываем отбор на форму выбора склада
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ЗначениеЗаполнено(ВыбранноеЗначение) и ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Склады") тогда
		Объект.Склад = ВыбранноеЗначение; 
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЦехПриИзменении(Элемент)   
	//БИТ_++ Шимсиев Подставляем склад который принадлежит данному подразделению клиент говорит, что такой будет только 1 (Не верю)
	ИзменитьСклад(Объект.Цех); 
	//БИТ_-- Шимсиев Подставляем склад который принадлежит данному подразделению
КонецПроцедуры

&НаСервере
Процедура ИзменитьСклад(Цех);  
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Склады.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Склады КАК Склады
		|ГДЕ
		|	Склады.Подразделение = &Подразделение
		|	И НЕ Склады.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Подразделение", Цех);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Объект.Склад = ВыборкаДетальныеЗаписи.Ссылка; 
	КонецЦикла;
КонецПроцедуры
#КонецОбласти


