
&НаСервере
Процедура КАНАТ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ДобавитьЭлементы();	
КонецПроцедуры 

Процедура  ДобавитьЭлементы()
	//++ Гурьев 01.09.23 Гурьев Вывод реквизита "Комментарий к заказу"
	КолонкаКомментарийКЗаказу = Элементы.Добавить("КАНАТ_ТоварыКомментарийКЗаказу", Тип("ПолеФормы"), Элементы.Товары); 
	КолонкаКомментарийКЗаказу.Заголовок = "Комментарий к заказу"; 
	КолонкаКомментарийКЗаказу.ПутьКДанным = "Объект.Товары.КАНАТ_КомментарийКЗаказу";
	КолонкаКомментарийКЗаказу.Вид = ВидПоляФормы.ПолеВвода;
	//-- Гурьев 01.09.23 
	//VVLarionov   
	ДопИнформацияУПД = Элементы.Добавить("Бит_ДопИнформация",Тип("ПолеФормы"),Элементы.ГруппаОсновное);
	ДопИнформацияУПД.Заголовок = "Дополнительная информация в УПД";
	ДопИнформацияУПД.Вид = ВидПоляФормы.ПолеВвода;
	ДопИнформацияУПД.ПутьКДанным= "Объект.Канат_ДопИнформация";
	
	//VVLarionov
	
КонецПроцедуры


&НаСервере
Процедура КАНАТ_СкладПриИзмененииПослеНаСервере()
	//++ Бит Трейгер П.М. 17.10.2024
	склад = Объект.Склад;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Склады.ТекущийОтветственный КАК ТекущийОтветственный,
		|	Склады.ТекущаяДолжностьОтветственного КАК ТекущаяДолжностьОтветственного
		|ИЗ
		|	Справочник.Склады КАК Склады
		|ГДЕ
		|	Склады.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
	
   Объект.Отпустил = ВыборкаДетальныеЗаписи[0].ТекущийОтветственный;
   Объект.ДолжностьКладовщика = ВыборкаДетальныеЗаписи[0].ТекущаяДолжностьОтветственного;
   
КонецПроцедуры


&НаКлиенте
Процедура КАНАТ_СкладПриИзмененииПосле(Элемент)
	КАНАТ_СкладПриИзмененииПослеНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура КАНАТ_ПередЗаписьюПосле(Отказ, ПараметрыЗаписи)
КАНАТ_ПередЗаписьюПослеНаСервере()		
КонецПроцедуры

&наСервере
Процедура КАНАТ_ПередЗаписьюПослеНаСервере()
    	склад = Объект.Склад;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Склады.ТекущийОтветственный КАК ТекущийОтветственный,
		|	Склады.ТекущаяДолжностьОтветственного КАК ТекущаяДолжностьОтветственного
		|ИЗ
		|	Справочник.Склады КАК Склады
		|ГДЕ
		|	Склады.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
	
   Объект.Отпустил = ВыборкаДетальныеЗаписи[0].ТекущийОтветственный;
   Объект.ДолжностьКладовщика = ВыборкаДетальныеЗаписи[0].ТекущаяДолжностьОтветственного;
	//-- Бит Трейгер П.М. 17.10.2024
КонецПроцедуры
