// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов - см. УправлениеПечатьюПереопределяемый.ПриПечати.МассивОбъектов
//  ПараметрыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ПараметрыПечати
//  КоллекцияПечатныхФорм - см. УправлениеПечатьюПереопределяемый.ПриПечати.КоллекцияПечатныхФорм
//  ОбъектыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ОбъектыПечати
//  ПараметрыВывода - см. УправлениеПечатьюПереопределяемый.ПриПечати.ПараметрыВывода
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Для Каждого Документ Из МассивОбъектов Цикл
	
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПечатьСпецификации") Тогда
			СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
				КоллекцияПечатныхФорм,
				"ПечатьСпецификации",
				"Печать спецификации",
				СформироватьПечатьСпецификации(Документ));
		КонецЕсли;
	
	КонецЦикла;
	ФормированиеПечатныхФорм.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
	
КонецПроцедуры 

//++ Гурьев 06.09.23 формирование печатной формы для печати спецификации
Функция СформироватьПечатьСпецификации(Документ)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.КАНАТ_ПечатьРасходнойСпецификации.ПФ_MXL_ПечатьРасходнойСпецификакии");
	
	ЗаказКлиента = Документы.РасходныйОрдерНаТовары.ПолучитьРодителя(Документ);
	РеализацияТоваровУслуг = Документы.РасходныйОрдерНаТовары.ПолучитьРеализациюТоваровУслуг(Документ);
	//БИТ_Шамсиев++ 09.10.2024 1. Спецификацию к отгрузке из документа Расходный ордер печатаем только после
	//создания УПД. В спецификации ссылка на УПД. (перед созданием спецификации на отгрузку сделать проверку 
	//на наличие проведенной счет/фактуры к реализации по расходному ордеру, если счет/фактуры нет, то выдаваль 
	//пользователю ошибку "Необходимо создать счет/фактуру")
	Если не ЗначениеЗаполнено(РеализацияТоваровУслуг) тогда
			ВызватьИсключение "Необходимо создать счет/фактуру!"; 	
	КонецЕсли;	
	//БИТ_Шамсиев++ 09.10.2024 1. Спецификацию к отгрузке из документа Расходный ордер печатаем только после
	//создания УПД. В спецификации ссылка на УПД. (перед созданием спецификации на отгрузку сделать проверку 
	//на наличие проведенной счет/фактуры к реализации по расходному ордеру, если счет/фактуры нет, то выдаваль 
	//пользователю ошибку "Необходимо создать счет/фактуру")

	ПараметрыДанныхПечати = Новый Структура;
	ПараметрыДанныхПечати.Вставить("РасходныйОрдер",         Документ);
	ПараметрыДанныхПечати.Вставить("ЗаказКлиента",           ЗаказКлиента);
	ПараметрыДанныхПечати.Вставить("РеализацияТоваровУслуг", РеализацияТоваровУслуг);
	
	ДанныеПечати = ПолучитьДанныеПечати(ПараметрыДанныхПечати);
	
	//Шапка
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	
	ДанныеШапка = Новый Структура;
	ДанныеШапка.Вставить("РасходныйОрдерНомер", Документ.Номер);
	ДанныеШапка.Вставить("РасходныйОрдерДата",  Формат(Документ.Дата, "ДФ=dd.MM.yy"));
	ДанныеШапка.Вставить("РеализацияНомер",     РеализацияТоваровУслуг.Номер);
	ДанныеШапка.Вставить("РеализацияДата",      Формат(РеализацияТоваровУслуг.Дата, "ДФ=dd.MM.yy"));
	ДанныеШапка.Вставить("Склад",               Документ.Склад);
	ДанныеШапка.Вставить("Плательщик",          ЗаказКлиента.Партнер.НаименованиеПолное);
	ДанныеШапка.Вставить("Грузополучатель",     ?(ЗначениеЗаполнено(ЗаказКлиента.Грузополучатель),
												  ЗаказКлиента.Грузополучатель.НаименованиеПолное,
												  ЗаказКлиента.Партнер.НаименованиеПолное));
	ОбластьШапка.Параметры.Заполнить(ДанныеШапка);
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	//Таблица
	ОбластьТаблицаШапка = Макет.ПолучитьОбласть("ОбластьТаблицаШапка");
	ТабличныйДокумент.Вывести(ОбластьТаблицаШапка);
	
	ИтогоМест = 0;
	
	ВыборкаНоменклатураНаименование = ДанныеПечати.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаНоменклатураНаименование.Следующий() Цикл
		
		ИтогоМест = ИтогоМест + ВыборкаНоменклатураНаименование.Серия;
		
		ВыборкаХарактеристика = ВыборкаНоменклатураНаименование.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаХарактеристика.Следующий() Цикл
			
			ВыборкаНоменклатураЕдиницаИзмерения = ВыборкаХарактеристика.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаНоменклатураЕдиницаИзмерения.Следующий() Цикл
				
				ОбластьТаблицаНоменклатура = Макет.ПолучитьОбласть("ОбластьТаблицаНоменклатура");
				
				ДанныеТаблицаНоменклатура = Новый Структура;
				ДанныеТаблицаНоменклатура.Вставить("Номенклатура",     ВыборкаНоменклатураЕдиницаИзмерения.НоменклатураНаименование);
				ДанныеТаблицаНоменклатура.Вставить("Упаковка",         ВыборкаНоменклатураЕдиницаИзмерения.Характеристика);
				ДанныеТаблицаНоменклатура.Вставить("ЕдиницаИзмерения", ВыборкаНоменклатураЕдиницаИзмерения.НоменклатураЕдиницаИзмерения);
				ДанныеТаблицаНоменклатура.Вставить("Количество",       ВыборкаНоменклатураЕдиницаИзмерения.Количество);
				ДанныеТаблицаНоменклатура.Вставить("Мест",             ВыборкаНоменклатураЕдиницаИзмерения.Серия);
				
				ОбластьТаблицаНоменклатура.Параметры.Заполнить(ДанныеТаблицаНоменклатура);
				ТабличныйДокумент.Вывести(ОбластьТаблицаНоменклатура);
				
				ДетальныеЗаписи = Новый ТаблицаЗначений;
				ДетальныеЗаписи.Колонки.Добавить("Серия");
				ДетальныеЗаписи.Колонки.Добавить("Количество");
				
				ВыборкаДетальныеЗаписи = ВыборкаНоменклатураЕдиницаИзмерения.Выбрать();
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					
					Строка = ДетальныеЗаписи.Добавить();
					Строка.Серия = СтрЗаменить(ВыборкаДетальныеЗаписи.Серия,"/","");
					Строка.Количество = ВыборкаДетальныеЗаписи.Количество;
					
				КонецЦикла;
				
				КоличествоСтрок = ?(Цел(ДетальныеЗаписи.Количество() / 3) = ДетальныеЗаписи.Количество() / 3,
									Цел(ДетальныеЗаписи.Количество() / 3),
									Цел(ДетальныеЗаписи.Количество() / 3) + 1);
				
				Для СчетчикСтрок = 1 По КоличествоСтрок Цикл
					
					ОбластьТаблицаДетальныеЗаписи = Макет.ПолучитьОбласть("ОбластьТаблицаДетальныеЗаписи");
					
					ДанныеТаблицаДетальныеЗаписи = Новый Структура;
					
					Для СчетчикКолонок = 1 По 3 Цикл
						Номер = (СчетчикКолонок-1) * КоличествоСтрок + СчетчикСтрок;
						Если Номер <= ДетальныеЗаписи.Количество() Тогда
							ДанныеТаблицаДетальныеЗаписи.Вставить("Номер" + Строка(СчетчикКолонок),      Номер);
							ДанныеТаблицаДетальныеЗаписи.Вставить("Серия" + Строка(СчетчикКолонок),      ДетальныеЗаписи[Номер-1].Серия);
							ДанныеТаблицаДетальныеЗаписи.Вставить("Количество" + Строка(СчетчикКолонок), ДетальныеЗаписи[Номер-1].Количество);
						КонецЕсли;
					КонецЦикла;
					
					ОбластьТаблицаДетальныеЗаписи.Параметры.Заполнить(ДанныеТаблицаДетальныеЗаписи);
					ТабличныйДокумент.Вывести(ОбластьТаблицаДетальныеЗаписи);
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	//Итого
	ОбластьИтого = Макет.ПолучитьОбласть("ОбластьИтого");
	ОбластьИтого.Параметры.ИтогоМест = ИтогоМест;
	ТабличныйДокумент.Вывести(ОбластьИтого);
	
	Возврат ТабличныйДокумент;
	
КонецФункции
//-- Гурьев 06.09.23

//++ Гурьев 07.09.23 Получение данных печати
Функция ПолучитьДанныеПечати(ПараметрыДанныхПечати)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|	ВЫБРАТЬ
	|		РасходныйОрдерНаТоварыОтгружаемыеТовары.Номенклатура.Наименование КАК НоменклатураНаименование,
	|		РасходныйОрдерНаТоварыОтгружаемыеТовары.Номенклатура.ЕдиницаИзмерения КАК НоменклатураЕдиницаИзмерения,
	|		РасходныйОрдерНаТоварыОтгружаемыеТовары.Серия КАК Серия,
	|		РасходныйОрдерНаТоварыОтгружаемыеТовары.Характеристика КАК Характеристика,
	|		РасходныйОрдерНаТоварыОтгружаемыеТовары.Количество КАК Количество
	|	ИЗ
	|		Документ.РасходныйОрдерНаТовары.ОтгружаемыеТовары КАК РасходныйОрдерНаТоварыОтгружаемыеТовары
	|	ГДЕ
	|		РасходныйОрдерНаТоварыОтгружаемыеТовары.Ссылка = &РасходныйОрдерСсылка
	|		И РасходныйОрдерНаТоварыОтгружаемыеТовары.УпаковочныйЛист = ЗНАЧЕНИЕ(Документ.УпаковочныйЛист.ПустаяСсылка)
	|	УПОРЯДОЧИТЬ ПО
	|		РасходныйОрдерНаТоварыОтгружаемыеТовары.Серия
	|	ИТОГИ
	|		СУММА(Количество),
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Серия)
	|		
	|	ПО
	|		НоменклатураНаименование,
	|		Характеристика,
	|		НоменклатураЕдиницаИзмерения";
	
	Запрос.УстановитьПараметр("РасходныйОрдерСсылка", ПараметрыДанныхПечати.РасходныйОрдер);
	
	Возврат Запрос.Выполнить();
	
КонецФункции
//-- Гурьев 07.09.23
