
&После("ПередЗаписью")
Процедура КАНАТ_ПередЗаписью(Отказ)
	//БИТ_Гурьев__28.03.24++
	АдресУказан = Ложь;
	
	Для Каждого Строка Из ЭтотОбъект.КонтактнаяИнформация Цикл
		
		Если Строка.Вид = Справочники.ВидыКонтактнойИнформации.АдресПартнера Тогда
			
			АдресУказан = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не АдресУказан Тогда
			
				//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
		// Данный фрагмент построен конструктором.
		// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	КонтрагентыКонтактнаяИнформация.Представление КАК Представление,
			|	КонтрагентыКонтактнаяИнформация.ЗначенияПолей КАК ЗначенияПолей,
			|	КонтрагентыКонтактнаяИнформация.Страна КАК Страна,
			|	КонтрагентыКонтактнаяИнформация.Регион КАК Регион,
			|	КонтрагентыКонтактнаяИнформация.Город КАК Город,
			|	КонтрагентыКонтактнаяИнформация.АдресЭП КАК АдресЭП,
			|	КонтрагентыКонтактнаяИнформация.ДоменноеИмяСервера КАК ДоменноеИмяСервера,
			|	КонтрагентыКонтактнаяИнформация.НомерТелефона КАК НомерТелефона,
			|	КонтрагентыКонтактнаяИнформация.НомерТелефонаБезКодов КАК НомерТелефонаБезКодов,
			|	КонтрагентыКонтактнаяИнформация.ВидДляСписка КАК ВидДляСписка,
			|	КонтрагентыКонтактнаяИнформация.ДействуетС КАК ДействуетС,
			|	КонтрагентыКонтактнаяИнформация.Значение КАК Значение
			|ИЗ
			|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
			|		ПО КонтрагентыКонтактнаяИнформация.Ссылка = Контрагенты.Ссылка
			|ГДЕ
			|	Контрагенты.Партнер = &Партнер
			|	И КонтрагентыКонтактнаяИнформация.Вид = &Вид";
		
		Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента);
		Запрос.УстановитьПараметр("Партнер", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			НовыйАдрес = КонтактнаяИнформация.Добавить();
			ЗаполнитьЗначенияСвойств(НовыйАдрес, ВыборкаДетальныеЗаписи);
			НовыйАдрес.Вид = Справочники.ВидыКонтактнойИнформации.АдресПартнера;
			НовыйАдрес.ВидДляСписка = Справочники.ВидыКонтактнойИнформации.АдресПартнера;
		КонецЕсли;
	
		
	КонецЕсли;
	//БИТ_Гурьев__28.03.24--
КонецПроцедуры
