&ИзменениеИКонтроль("ПолучитьРезультатЗапросаПоОстаткамЗаказов")
Функция КАНАТ_ПолучитьРезультатЗапросаПоОстаткамЗаказов(ДанныеОтбора, ПараметрыЗаполнения, СкладРеализации, МассивЗаказов)

	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("МассивЗаказов",             МассивЗаказов);
	Запрос.УстановитьПараметр("Партнер",                   ДанныеОтбора.Партнер);
	Запрос.УстановитьПараметр("Контрагент",                ДанныеОтбора.Контрагент);
	Запрос.УстановитьПараметр("Договор",                   ДанныеОтбора.Договор);
	Запрос.УстановитьПараметр("Организация",               ДанныеОтбора.Организация);
	Запрос.УстановитьПараметр("Сделка",                    ДанныеОтбора.Сделка);
	Запрос.УстановитьПараметр("Соглашение",                ДанныеОтбора.Соглашение);
	Запрос.УстановитьПараметр("ВалютаВзаиморасчетов",      ДанныеОтбора.ВалютаВзаиморасчетов);
	Запрос.УстановитьПараметр("НалогообложениеНДС",        ДанныеОтбора.НалогообложениеНДС);
	Запрос.УстановитьПараметр("ЦенаВключаетНДС",           ДанныеОтбора.ЦенаВключаетНДС);
	Запрос.УстановитьПараметр("ВернутьМногооборотнуюТару", ДанныеОтбора.ВернутьМногооборотнуюТару);
	Запрос.УстановитьПараметр("ТребуетсяЗалогЗаТару",      ДанныеОтбора.ТребуетсяЗалогЗаТару);
	Запрос.УстановитьПараметр("ПорядокРасчетов",           ДанныеОтбора.ПорядокРасчетов);
	Запрос.УстановитьПараметр("Регистратор",               ДанныеОтбора.Ссылка);
	Запрос.УстановитьПараметр("СкладРеализации",           СкладРеализации);
	Запрос.УстановитьПараметр("ОтобратьПоЗаказу",          МассивЗаказов <> Неопределено);
	Запрос.УстановитьПараметр("ХозяйственнаяОперация",     ДанныеОтбора.ХозяйственнаяОперация);
	Запрос.УстановитьПараметр("ТекущаяДата",               НачалоДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("ИспользоватьСоглашенияСКлиентами",
	ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами"));
	Запрос.УстановитьПараметр("НаправлениеДеятельности",        ДанныеОтбора.НаправлениеДеятельности);
	Запрос.УстановитьПараметр("ИспользоватьНаправленияДеятельности",
	ПолучитьФункциональнуюОпцию("ИспользоватьУчетДоходовПоНаправлениямДеятельности"));
	НалогообложениеНДСЭкспорт = ДанныеОтбора.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНаЭкспорт
	Или ДанныеОтбора.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ЭкспортСырьевыхТоваровУслуг
	Или ДанныеОтбора.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ЭкспортНесырьевыхТоваров;
	Запрос.УстановитьПараметр("НалогообложениеНДСЭкспорт", НалогообложениеНДСЭкспорт);

	ИспользоватьРасширенныеВозможностиЗаказаКлиента = Неопределено;
	ПараметрыЗаполнения.Свойство("ИспользоватьРасширенныеВозможностиЗаказаКлиента",
	ИспользоватьРасширенныеВозможностиЗаказаКлиента);
	Если ИспользоватьРасширенныеВозможностиЗаказаКлиента = Неопределено Тогда
		ИспользоватьРасширенныеВозможностиЗаказаКлиента = ПолучитьФункциональнуюОпцию("ИспользоватьРасширенныеВозможностиЗаказаКлиента");
	КонецЕсли;
	Запрос.УстановитьПараметр("ЭтоЗаказКакСчет", Не ИспользоватьРасширенныеВозможностиЗаказаКлиента);

	ХозяйственныеОперацииРаспоряжений = Новый Массив();

	Если ДанныеОтбора.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиенту
		Или ДанныеОтбора.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиентуРеглУчет 
		Или ДанныеОтбора.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности Тогда

		ХозяйственныеОперацииРаспоряжений.Добавить(Перечисления.ХозяйственныеОперации.РеализацияКлиенту);
		ХозяйственныеОперацииРаспоряжений.Добавить(Перечисления.ХозяйственныеОперации.ВозвратТоваровОтКлиента);
		ХозяйственныеОперацииРаспоряжений.Добавить(Перечисления.ХозяйственныеОперации.ВозвратОтРозничногоПокупателя);
		ХозяйственныеОперацииРаспоряжений.Добавить(Перечисления.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности);

	ИначеЕсли ДанныеОтбора.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию  Тогда

		ХозяйственныеОперацииРаспоряжений.Добавить(Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию);
		ХозяйственныеОперацииРаспоряжений.Добавить(Перечисления.ХозяйственныеОперации.ВозвратОтКомиссионера);

	КонецЕсли;

	Запрос.УстановитьПараметр("ХозяйственныеОперацииРаспоряжений", ХозяйственныеОперацииРаспоряжений);

	ВариантОформления = Неопределено;
	ПараметрыЗаполнения.Свойство("ВариантОформления", ВариантОформления);

	МассивВариантовОформления = Новый Массив;
	Если ЗначениеЗаполнено(ВариантОформления) Тогда
		МассивВариантовОформления.Добавить(ВариантОформления);
	Иначе
		МассивВариантовОформления.Добавить(Перечисления.ВариантыОформленияПродажи.РеализацияТоваровУслуг);
		МассивВариантовОформления.Добавить(Перечисления.ВариантыОформленияПродажи.АктНаПередачуПрав);
	КонецЕсли;

	Запрос.УстановитьПараметр("МассивВариантовОформления", МассивВариантовОформления);

	РеализацияТоваровУслугЛокализация.УстановитьПараметрыОсобенностиУчетаНоменклатуры(ПараметрыЗаполнения, Запрос.Параметры);

	Если ТипЗнч(ДанныеОтбора) = Тип("Структура") 
		И ДанныеОтбора.Свойство("ТоварыРеализации") Тогда
		Запрос.УстановитьПараметр("ТоварыРеализации", ДанныеОтбора.ТоварыРеализации);
	Иначе
		ТоварыРеализации = Новый ТаблицаЗначений;
		ТоварыРеализации.Колонки.Добавить("ЗаказКлиента", Новый ОписаниеТипов("ДокументСсылка.ЗаказКлиента"));
		ТоварыРеализации.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ТоварыРеализации.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
		ТоварыРеализации.Колонки.Добавить("КодСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0)));
		ТоварыРеализации.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
		ТоварыРеализации.Колонки.Добавить("СуммаВзаиморасчетов", ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля());
		ТоварыРеализации.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
		ТоварыРеализации.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0)));
		ТоварыРеализации.Колонки.Добавить("Упаковка", Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
		ТоварыРеализации.Колонки.Добавить("Серия", Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
		ТоварыРеализации.Колонки.Добавить("ВидЦены", Новый ОписаниеТипов("СправочникСсылка.ВидыЦен"));
		ТоварыРеализации.Колонки.Добавить("КоличествоВЗаказе", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
		ТоварыРеализации.Колонки.Добавить("Цена", ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля());
		ТоварыРеализации.Колонки.Добавить("СтавкаНДС", Новый ОписаниеТипов("СправочникСсылка.СтавкиНДС"));
		ТоварыРеализации.Колонки.Добавить("Сумма", ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля());
		ТоварыРеализации.Колонки.Добавить("СуммаНДС", ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля());
		ТоварыРеализации.Колонки.Добавить("СуммаСНДС", ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля());
		ТоварыРеализации.Колонки.Добавить("ПроцентРучнойСкидки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(5, 2)));
		ТоварыРеализации.Колонки.Добавить("СуммаРучнойСкидки", ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля());
		ТоварыРеализации.Колонки.Добавить("ПроцентАвтоматическойСкидки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(5, 2)));
		ТоварыРеализации.Колонки.Добавить("СуммаАвтоматическойСкидки", ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля());
		ТоварыРеализации.Колонки.Добавить("СуммаБонусныхБалловКСписанию", ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля());
		ТоварыРеализации.Колонки.Добавить("СуммаБонусныхБалловКСписаниюВВалюте", ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля());
		ТоварыРеализации.Колонки.Добавить("СуммаНачисленныхБонусныхБалловВВалюте", ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля());
		ТоварыРеализации.Колонки.Добавить("НоменклатураНабора", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ТоварыРеализации.Колонки.Добавить("ХарактеристикаНабора", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
		ТоварыРеализации.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"));
		ТоварыРеализации.Колонки.Добавить("КлючСвязи", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0)));

		Запрос.УстановитьПараметр("ТоварыРеализации", ТоварыРеализации);
	КонецЕсли;

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТоварыРеализации.КодСтроки КАК ЧИСЛО(10, 0)) КАК КодСтроки,
	|	ТоварыРеализации.ЗаказКлиента КАК ЗаказКлиента,
	|	ВЫРАЗИТЬ(ТоварыРеализации.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ВЫРАЗИТЬ(ТоварыРеализации.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
	|	ТоварыРеализации.Количество КАК Количество,
	|	ВЫРАЗИТЬ(ТоварыРеализации.Склад КАК Справочник.Склады) КАК Склад,
	|	ТоварыРеализации.НомерСтроки КАК НомерСтроки,
	|	ВЫРАЗИТЬ(ТоварыРеализации.Упаковка КАК Справочник.УпаковкиЕдиницыИзмерения) КАК Упаковка,
	|	ТоварыРеализации.Серия КАК Серия,
	|	ТоварыРеализации.ВидЦены КАК ВидЦены,
	|	ТоварыРеализации.Цена КАК Цена,
	|	ТоварыРеализации.СтавкаНДС КАК СтавкаНДС,
	|	ТоварыРеализации.Сумма КАК Сумма,
	|	ТоварыРеализации.СуммаНДС КАК СуммаНДС,
	|	ТоварыРеализации.СуммаСНДС КАК СуммаСНДС,
	|	ТоварыРеализации.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
	|	ТоварыРеализации.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	|	ТоварыРеализации.ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки,
	|	ТоварыРеализации.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
	|	ТоварыРеализации.СуммаБонусныхБалловКСписанию КАК СуммаБонусныхБалловКСписанию,
	|	ТоварыРеализации.СуммаБонусныхБалловКСписаниюВВалюте КАК СуммаБонусныхБалловКСписаниюВВалюте,
	|	ТоварыРеализации.СуммаНачисленныхБонусныхБалловВВалюте КАК СуммаНачисленныхБонусныхБалловВВалюте,
	|	ТоварыРеализации.НоменклатураНабора КАК НоменклатураНабора,
	|	ТоварыРеализации.ХарактеристикаНабора КАК ХарактеристикаНабора,
	|	ТоварыРеализации.Подразделение КАК Подразделение,
	|	ТоварыРеализации.КлючСвязи КАК КлючСвязи
	|ПОМЕСТИТЬ ВтТоварыРеализации
	|ИЗ
	|	&ТоварыРеализации КАК ТоварыРеализации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтТоварыРеализации.КодСтроки КАК КодСтроки,
	|	ВтТоварыРеализации.ЗаказКлиента КАК ЗаказКлиента,
	|	ВтТоварыРеализации.Номенклатура КАК Номенклатура,
	|	ВтТоварыРеализации.Характеристика КАК Характеристика,
	|	СУММА(ВтТоварыРеализации.Количество) КАК Количество,
	|	ВтТоварыРеализации.Серия КАК Серия,
	|	ВтТоварыРеализации.Упаковка КАК Упаковка
	|ПОМЕСТИТЬ ВтТоварыРеализацииПоЗаказу
	|ИЗ
	|	ВтТоварыРеализации КАК ВтТоварыРеализации
	|ГДЕ
	|	ВтТоварыРеализации.КодСтроки <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтТоварыРеализации.КодСтроки,
	|	ВтТоварыРеализации.ЗаказКлиента,
	|	ВтТоварыРеализации.Номенклатура,
	|	ВтТоварыРеализации.Характеристика,
	|	ВтТоварыРеализации.Серия,
	|	ВтТоварыРеализации.Упаковка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Регистратор КАК ЗаказКлиента,
	|	&ПорядокРасчетов КАК ПорядокРасчетов,
	|	ТоварыРеализации.Номенклатура КАК Номенклатура,
	|	ТоварыРеализации.Характеристика КАК Характеристика,
	|	ТоварыРеализации.КодСтроки КАК КодСтроки,
	|	ТоварыРеализации.Количество КАК Количество,
	|	ТоварыРеализации.Сумма КАК СуммаВзаиморасчетов,
	|	ТоварыРеализации.Склад КАК Склад,
	|	ТоварыРеализации.НомерСтроки КАК НомерСтроки,
	|	ТоварыРеализации.Упаковка КАК Упаковка,
	|	ТоварыРеализации.Серия КАК Серия,
	|	ТоварыРеализации.ВидЦены КАК ВидЦены,
	|	ТоварыРеализации.Количество КАК КоличествоВЗаказе,
	|	ТоварыРеализации.Цена КАК Цена,
	|	ТоварыРеализации.СтавкаНДС КАК СтавкаНДС,
	|	ТоварыРеализации.Сумма КАК Сумма,
	|	ТоварыРеализации.СуммаНДС КАК СуммаНДС,
	|	ТоварыРеализации.СуммаСНДС КАК СуммаСНДС,
	|	ТоварыРеализации.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
	|	ТоварыРеализации.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	|	ТоварыРеализации.ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки,
	|	ТоварыРеализации.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
	|	ТоварыРеализации.СуммаБонусныхБалловКСписанию КАК СуммаБонусныхБалловКСписанию,
	|	ТоварыРеализации.СуммаБонусныхБалловКСписаниюВВалюте КАК СуммаБонусныхБалловКСписаниюВВалюте,
	|	ТоварыРеализации.СуммаНачисленныхБонусныхБалловВВалюте КАК СуммаНачисленныхБонусныхБалловВВалюте,
	|	ТоварыРеализации.НоменклатураНабора КАК НоменклатураНабора,
	|	ТоварыРеализации.ХарактеристикаНабора КАК ХарактеристикаНабора,
	|	ТоварыРеализации.Подразделение КАК Подразделение,
	|	ТоварыРеализации.КлючСвязи КАК КлючСвязи,
	|	СправочникНоменклатуры.ТипНоменклатуры КАК ТипНоменклатуры,
	|	СправочникНоменклатуры.КодТНВЭД КАК КодТНВЭД,
	|	Склады.ИспользоватьОрдернуюСхемуПриОтгрузке = ИСТИНА
	|		И Склады.ДатаНачалаОрдернойСхемыПриОтгрузке <= &ТекущаяДата КАК ИспользуетсяОрдернаяСхемаПриОтгрузке
	|ПОМЕСТИТЬ ВтТоварыРеализацииБезЗаказа
	|ИЗ
	|	ВтТоварыРеализации КАК ТоварыРеализации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатуры
	|		ПО (СправочникНоменклатуры.Ссылка = ТоварыРеализации.Номенклатура)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК Склады
	|		ПО (Склады.Ссылка = ТоварыРеализации.Склад)
	|ГДЕ
	|	ТоварыРеализации.КодСтроки = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказКлиента.Ссылка КАК Ссылка,
	|	ЗаказКлиента.ЭтоЗаказКакСчет КАК ЭтоЗаказКакСчет
	|ПОМЕСТИТЬ ВТЗаказы
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ОтобратьПоЗаказу
	|				ТОГДА ЗаказКлиента.Ссылка В (&МассивЗаказов)
	|			ИНАЧЕ ЗаказКлиента.Партнер = &Партнер
	|					И ЗаказКлиента.Контрагент = &Контрагент
	|					И ЗаказКлиента.Договор = &Договор
	|					И ЗаказКлиента.Организация = &Организация
	|					И ЗаказКлиента.ХозяйственнаяОперация В (&ХозяйственныеОперацииРаспоряжений)
	|					И (НЕ &ИспользоватьСоглашенияСКлиентами
	|						ИЛИ ЗаказКлиента.Соглашение = &Соглашение)
	|					И ЗаказКлиента.Сделка = &Сделка
	|					И (ЗаказКлиента.Валюта = &ВалютаВзаиморасчетов
	|						ИЛИ &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию))
	|					И ВЫБОР
	|						КОГДА ЗаказКлиента.НалогообложениеНДС В (ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортСырьевыхТоваровУслуг), ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортНесырьевыхТоваров))
	|							ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНаЭкспорт)
	|						ИНАЧЕ ЗаказКлиента.НалогообложениеНДС
	|					КОНЕЦ = &НалогообложениеНДС
	|					И ЗаказКлиента.ЦенаВключаетНДС = &ЦенаВключаетНДС
	|					И ЗаказКлиента.ВернутьМногооборотнуюТару = &ВернутьМногооборотнуюТару
	|					И ЗаказКлиента.ТребуетсяЗалогЗаТару = &ТребуетсяЗалогЗаТару
	|					И (НЕ &ИспользоватьНаправленияДеятельности
	|						ИЛИ ЗаказКлиента.НаправлениеДеятельности = &НаправлениеДеятельности)
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказКлиента.Ссылка,
	|	ЗаказКлиента.ЭтоЗаказКакСчет
	|ИЗ
	|	Документ.ЗаявкаНаВозвратТоваровОтКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ОтобратьПоЗаказу
	|				ТОГДА ЗаказКлиента.Ссылка В (&МассивЗаказов)
	|			ИНАЧЕ ЗаказКлиента.Партнер = &Партнер
	|					И ЗаказКлиента.Контрагент = &Контрагент
	|					И ЗаказКлиента.Договор = &Договор
	|					И ЗаказКлиента.Организация = &Организация
	|					И ЗаказКлиента.ХозяйственнаяОперация В (&ХозяйственныеОперацииРаспоряжений)
	|					И (НЕ &ИспользоватьСоглашенияСКлиентами
	|						ИЛИ ЗаказКлиента.Соглашение = &Соглашение)
	|					И ЗаказКлиента.Сделка = &Сделка
	|					И (ЗаказКлиента.Валюта = &ВалютаВзаиморасчетов
	|						ИЛИ &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию))
	|					И ВЫБОР
	|						КОГДА ЗаказКлиента.НалогообложениеНДС В (ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортСырьевыхТоваровУслуг), ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортНесырьевыхТоваров))
	|							ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНаЭкспорт)
	|						ИНАЧЕ ЗаказКлиента.НалогообложениеНДС
	|					КОНЕЦ = &НалогообложениеНДС
	|					И ЗаказКлиента.ЦенаВключаетНДС = &ЦенаВключаетНДС
	|					И ЗаказКлиента.ВернутьМногооборотнуюТару = &ВернутьМногооборотнуюТару
	|					И ЗаказКлиента.ТребуетсяЗалогЗаТару = &ТребуетсяЗалогЗаТару
	|					И (НЕ &ИспользоватьНаправленияДеятельности
	|						ИЛИ ЗаказКлиента.НаправлениеДеятельности = &НаправлениеДеятельности)
	|		КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗаказы.ЗаказКлиента КАК ЗаказКлиента,
	|	ТаблицаЗаказы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗаказы.Характеристика КАК Характеристика,
	|	ТаблицаЗаказы.КодСтроки КАК КодСтроки,
	|	ТаблицаЗаказы.Склад КАК Склад,
	|	ТаблицаЗаказы.Серия КАК Серия,
	|	СправочникНоменклатуры.КодТНВЭД КАК КодТНВЭД,
	|	СУММА(ТаблицаЗаказы.КОформлению) КАК Количество,
	|	СУММА(ТаблицаЗаказы.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ТаблицаОстатки
	|ИЗ
	|	(ВЫБРАТЬ
	|		РаспоряженияОбороты.Распоряжение КАК ЗаказКлиента,
	|		РаспоряженияОбороты.Номенклатура КАК Номенклатура,
	|		РаспоряженияОбороты.Характеристика КАК Характеристика,
	|		РаспоряженияОбороты.КодСтроки КАК КодСтроки,
	|		РаспоряженияОбороты.Склад КАК Склад,
	|		РаспоряженияОбороты.Серия КАК Серия,
	|		РаспоряженияОбороты.КОформлениюОборот КАК КОформлению,
	|		РаспоряженияОбороты.СуммаОборот КАК Сумма
	|	ИЗ
	|		РегистрНакопления.РаспоряженияНаОтгрузку.Обороты(
	|				,
	|				,
	|				,
	|				(Распоряжение, &ЭтоЗаказКакСчет) В
	|						(ВЫБРАТЬ
	|							ВТЗаказы.Ссылка,
	|							ВТЗаказы.ЭтоЗаказКакСчет
	|						ИЗ
	|							ВТЗаказы)
	|					И ВЫБОР
	|						КОГДА ВЫРАЗИТЬ(&СкладРеализации КАК Справочник.Склады).ЭтоГруппа
	|							ТОГДА Склад В ИЕРАРХИИ (&СкладРеализации)
	|									ИЛИ Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|						ИНАЧЕ Склад В (ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка), &СкладРеализации)
	|					КОНЕЦ
	|					И Номенклатура.ВариантОформленияПродажи В (&МассивВариантовОформления)
	|					И (&НеОтбиратьПоОсобенностямУчета
	|						ИЛИ Номенклатура.ОсобенностьУчета В (&ОсобенностиУчетаНоменклатуры))) КАК РаспоряженияОбороты
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РаспоряженияДвижения.Распоряжение,
	|		РаспоряженияДвижения.Номенклатура,
	|		РаспоряженияДвижения.Характеристика,
	|		РаспоряженияДвижения.КодСтроки,
	|		РаспоряженияДвижения.Склад,
	|		РаспоряженияДвижения.Серия,
	|		-РаспоряженияДвижения.КОформлению,
	|		-РаспоряженияДвижения.Сумма
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.РаспоряженияНаОтгрузку КАК РаспоряженияДвижения
	|	ГДЕ
	|		РаспоряженияДвижения.Регистратор = &Регистратор
	|		И (РаспоряженияДвижения.Распоряжение, &ЭтоЗаказКакСчет) В
	|				(ВЫБРАТЬ
	|					ВТЗаказы.Ссылка,
	|					ВТЗаказы.ЭтоЗаказКакСчет
	|				ИЗ
	|					ВТЗаказы)
	|		И РаспоряженияДвижения.Активность
	|		И ВЫБОР
	|				КОГДА ВЫРАЗИТЬ(&СкладРеализации КАК Справочник.Склады).ЭтоГруппа
	|					ТОГДА РаспоряженияДвижения.Склад В ИЕРАРХИИ (&СкладРеализации)
	|							ИЛИ РаспоряженияДвижения.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|				ИНАЧЕ РаспоряженияДвижения.Склад В (ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка), &СкладРеализации)
	|			КОНЕЦ
	|		И РаспоряженияДвижения.Номенклатура.ВариантОформленияПродажи В(&МассивВариантовОформления)
	|		И (&НеОтбиратьПоОсобенностямУчета
	|				ИЛИ РаспоряженияДвижения.Номенклатура.ОсобенностьУчета В (&ОсобенностиУчетаНоменклатуры))
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЗаказКлиентаТовары.Ссылка,
	|		ЗаказКлиентаТовары.Номенклатура,
	|		ЗаказКлиентаТовары.Характеристика,
	|		ЗаказКлиентаТовары.КодСтроки,
	|		ЗаказКлиентаТовары.Склад,
	|		ЗаказКлиентаТовары.Серия,
	|		ЗаказКлиентаТовары.Количество,
	|		ЗаказКлиентаТовары.СуммаСНДС
	|	ИЗ
	|		Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|	ГДЕ
	|		(ЗаказКлиентаТовары.Ссылка, &ЭтоЗаказКакСчет, ИСТИНА) В
	|				(ВЫБРАТЬ
	|					ВТЗаказы.Ссылка,
	|					ВТЗаказы.ЭтоЗаказКакСчет,
	|					ВТЗаказы.ЭтоЗаказКакСчет
	|				ИЗ
	|					ВТЗаказы)
	|		И ЗаказКлиентаТовары.Номенклатура.ВариантОформленияПродажи В(&МассивВариантовОформления)
	|		И (&НеОтбиратьПоОсобенностямУчета
	|				ИЛИ ЗаказКлиентаТовары.Номенклатура.ОсобенностьУчета В (&ОсобенностиУчетаНоменклатуры))
	|		И НЕ ЗаказКлиентаТовары.Отменено
	|		И НЕ ЗаказКлиентаТовары.Ссылка.ПометкаУдаления
	|		И ВЫБОР
	|				КОГДА ВЫРАЗИТЬ(&СкладРеализации КАК Справочник.Склады).ЭтоГруппа
	|					ТОГДА ЗаказКлиентаТовары.Склад В ИЕРАРХИИ (&СкладРеализации)
	|							ИЛИ ЗаказКлиентаТовары.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|				ИНАЧЕ ЗаказКлиентаТовары.Склад В (ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка), &СкладРеализации)
	|			КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЗаказКлиентаТовары.Ссылка,
	|		ЗаказКлиентаТовары.Номенклатура,
	|		ЗаказКлиентаТовары.Характеристика,
	|		ЗаказКлиентаТовары.КодСтроки,
	|		ЗаказКлиентаТовары.Ссылка.Склад,
	|		ЗаказКлиентаТовары.Серия,
	|		ЗаказКлиентаТовары.Количество,
	|		ЗаказКлиентаТовары.СуммаСНДС
	|	ИЗ
	|		Документ.ЗаявкаНаВозвратТоваровОтКлиента.ЗаменяющиеТовары КАК ЗаказКлиентаТовары
	|	ГДЕ
	|		(ЗаказКлиентаТовары.Ссылка, &ЭтоЗаказКакСчет, ИСТИНА) В
	|				(ВЫБРАТЬ
	|					ВТЗаказы.Ссылка,
	|					ВТЗаказы.ЭтоЗаказКакСчет,
	|					ВТЗаказы.ЭтоЗаказКакСчет
	|				ИЗ
	|					ВТЗаказы)
	|		И ЗаказКлиентаТовары.Номенклатура.ВариантОформленияПродажи В(&МассивВариантовОформления)
	|		И (&НеОтбиратьПоОсобенностямУчета
	|				ИЛИ ЗаказКлиентаТовары.Номенклатура.ОсобенностьУчета В (&ОсобенностиУчетаНоменклатуры))
	|		И НЕ ЗаказКлиентаТовары.Отменено
	|		И НЕ ЗаказКлиентаТовары.Ссылка.ПометкаУдаления) КАК ТаблицаЗаказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатуры
	|		ПО (СправочникНоменклатуры.Ссылка = ТаблицаЗаказы.Номенклатура)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗаказы.ЗаказКлиента,
	|	ТаблицаЗаказы.Номенклатура,
	|	ТаблицаЗаказы.Характеристика,
	|	ТаблицаЗаказы.КодСтроки,
	|	ТаблицаЗаказы.Склад,
	|	ТаблицаЗаказы.Серия,
	|	СправочникНоменклатуры.КодТНВЭД
	|
	|ИМЕЮЩИЕ
	|	СУММА(ТаблицаЗаказы.КОформлению) > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	КодСтроки,
	|	ЗаказКлиента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаОстатки.ЗаказКлиента КАК ЗаказКлиента,
	|	ЗаказТовары.Ссылка.ПорядокРасчетов КАК ПорядокРасчетов,
	|	ТаблицаОстатки.Номенклатура КАК Номенклатура,
	|	ЗаказТовары.НоменклатураПартнера КАК НоменклатураПартнера,
	|	ТаблицаОстатки.Характеристика КАК Характеристика,
	|	ТаблицаОстатки.КодСтроки КАК КодСтроки,
	|	ТаблицаОстатки.Количество КАК Количество,
	|	ТаблицаОстатки.Сумма КАК СуммаВзаиморасчетов,
	|	ТаблицаОстатки.Склад КАК Склад,
	|	ЕСТЬNULL(НакладнаяТовары.Количество, 0) КАК КоличествоВНакладной,
	|	ЗаказТовары.НомерСтроки КАК НомерСтроки,
	|	ЗаказТовары.Ссылка.Сделка КАК Сделка,
	|	ЗаказТовары.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ЕСТЬNULL(НакладнаяТовары.Упаковка, ЗаказТовары.Упаковка) КАК Упаковка,
	|	ЗаказТовары.Серия КАК Серия,
	|	ЗаказТовары.ВидЦены КАК ВидЦены,
	|	ЗаказТовары.Количество КАК КоличествоВЗаказе,
	|	ЗаказТовары.Цена КАК Цена,
	|	ЗаказТовары.СтавкаНДС КАК СтавкаНДС,
	|	ВЫБОР
	|		КОГДА &НалогообложениеНДСЭкспорт
	|			ТОГДА ТаблицаОстатки.КодТНВЭД
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка)
	|	КОНЕЦ КАК КодТНВЭД,
	|	ЗаказТовары.Сумма КАК Сумма,
	|	ЗаказТовары.СуммаНДС КАК СуммаНДС,
	|	ЗаказТовары.СуммаСНДС КАК СуммаСНДС,
	|	ЗаказТовары.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
	|	ЗаказТовары.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	|	ЗаказТовары.ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки,
	|	ЗаказТовары.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
	|	ЗаказТовары.СуммаБонусныхБалловКСписанию КАК СуммаБонусныхБалловКСписанию,
	|	ЗаказТовары.СуммаБонусныхБалловКСписаниюВВалюте КАК СуммаБонусныхБалловКСписаниюВВалюте,
	|	ЗаказТовары.СуммаНачисленныхБонусныхБалловВВалюте КАК СуммаНачисленныхБонусныхБалловВВалюте,
	|	ЗаказТовары.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ЗаказТовары.НоменклатураНабора КАК НоменклатураНабора,
	|	ЗаказТовары.ХарактеристикаНабора КАК ХарактеристикаНабора,
	|	ЗаказТовары.Подразделение КАК Подразделение,
	|	ЗаказТовары.КлючСвязи КАК КлючСвязи,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(НакладнаяТовары.Упаковка, ЗаказТовары.Упаковка) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, &ТекстЗапросаКоэффициентУпаковки2), 1)
	|	КОНЕЦ КАК Коэффициент,
	|	ТаблицаОстатки.Количество / ЕСТЬNULL(ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, &ТекстЗапросаКоэффициентУпаковки2), 1) КАК КоличествоУпаковок,
	|	ЗаказТовары.СрокПоставки КАК СрокПоставки,
	|	ЗаказТовары.ВариантОбеспечения КАК ВариантОбеспечения,
	|	ВЫБОР
	|		КОГДА ЗаказТовары.Обособленно
	|			ТОГДА ТаблицаОстатки.ЗаказКлиента.Назначение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	КОНЕЦ КАК Назначение,
	|	ЗаказТоварыСклад.ИспользоватьОрдернуюСхемуПриОтгрузке = ИСТИНА
	|		И ЗаказТоварыСклад.ДатаНачалаОрдернойСхемыПриОтгрузке <= &ТекущаяДата КАК ОрдернаяСхемаПриОтгрузке,
	|	ВЫБОР
	|		КОГДА ЗаказТовары.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ЗаказТоварыСклад.ИспользоватьОрдернуюСхемуПриОтгрузке = ИСТИНА
	|				И ЗаказТоварыСклад.ДатаНачалаОрдернойСхемыПриОтгрузке <= &ТекущаяДата
	|	КОНЕЦ КАК ПроверятьОтгрузку
	|ИЗ
	|	ТаблицаОстатки КАК ТаблицаОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказТовары
	|		ПО ТаблицаОстатки.Номенклатура = ЗаказТовары.Номенклатура
	|			И ТаблицаОстатки.Характеристика = ЗаказТовары.Характеристика
	|			И ТаблицаОстатки.КодСтроки = ЗаказТовары.КодСтроки
	|			И ТаблицаОстатки.ЗаказКлиента = ЗаказТовары.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК ЗаказТоварыСклад
	|		ПО (ЗаказТоварыСклад.Ссылка = ЗаказТовары.Склад)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТоварыРеализацииПоЗаказу КАК НакладнаяТовары
	|		ПО ТаблицаОстатки.Номенклатура = НакладнаяТовары.Номенклатура
	|			И ТаблицаОстатки.Характеристика = НакладнаяТовары.Характеристика
	|			И ТаблицаОстатки.КодСтроки = НакладнаяТовары.КодСтроки
	|			И ТаблицаОстатки.ЗаказКлиента = НакладнаяТовары.ЗаказКлиента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаОстатки.ЗаказКлиента,
	|	Заказ.ПорядокРасчетов,
	|	ТаблицаОстатки.Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.НоменклатураКонтрагентов.ПустаяСсылка),
	|	ТаблицаОстатки.Характеристика,
	|	ТаблицаОстатки.КодСтроки,
	|	ТаблицаОстатки.Количество,
	|	ТаблицаОстатки.Сумма,
	|	ТаблицаОстатки.Склад,
	|	ЕСТЬNULL(НакладнаяТовары.Количество, 0),
	|	ЗаказТовары.НомерСтроки,
	|	Заказ.Сделка,
	|	ЗаказТовары.ДатаОтгрузки,
	|	ЕСТЬNULL(НакладнаяТовары.Упаковка, ЗаказТовары.Упаковка),
	|	ЗаказТовары.Серия,
	|	ЗаказТовары.ВидЦены,
	|	ЗаказТовары.Количество,
	|	ЗаказТовары.Цена,
	|	ЗаказТовары.СтавкаНДС,
	|	ВЫБОР
	|		КОГДА &НалогообложениеНДСЭкспорт
	|			ТОГДА ТаблицаОстатки.КодТНВЭД
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка)
	|	КОНЕЦ,
	|	ЗаказТовары.Сумма,
	|	ЗаказТовары.СуммаНДС,
	|	ЗаказТовары.СуммаСНДС,
	|	ЗаказТовары.ПроцентРучнойСкидки,
	|	ЗаказТовары.СуммаРучнойСкидки,
	|	ЗаказТовары.ПроцентАвтоматическойСкидки,
	|	ЗаказТовары.СуммаАвтоматическойСкидки,
	|	ЗаказТовары.СуммаБонусныхБалловКСписанию,
	|	ЗаказТовары.СуммаБонусныхБалловКСписаниюВВалюте,
	|	ЗаказТовары.СуммаНачисленныхБонусныхБалловВВалюте,
	|	ЗаказТовары.Номенклатура.ТипНоменклатуры,
	|	ЗаказТовары.НоменклатураНабора,
	|	ЗаказТовары.ХарактеристикаНабора,
	|	ЗаказТовары.Подразделение,
	|	ЗаказТовары.КлючСвязи,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(НакладнаяТовары.Упаковка, ЗаказТовары.Упаковка) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, &ТекстЗапросаКоэффициентУпаковки2), 1)
	|	КОНЕЦ,
	|	ТаблицаОстатки.Количество / ЕСТЬNULL(ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, &ТекстЗапросаКоэффициентУпаковки2), 1),
	|	ЗаказТовары.СрокПоставки,
	|	ЗаказТовары.ВариантОбеспечения,
	|	ВЫБОР
	|		КОГДА ЗаказТовары.Обособленно
	|			ТОГДА ТаблицаОстатки.ЗаказКлиента.Назначение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	КОНЕЦ,
	|	Заказ.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке = ИСТИНА
	|		И Заказ.Склад.ДатаНачалаОрдернойСхемыПриОтгрузке <= &ТекущаяДата,
	|	ВЫБОР
	|		КОГДА ЗаказТовары.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ Заказ.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке = ИСТИНА
	|				И Заказ.Склад.ДатаНачалаОрдернойСхемыПриОтгрузке <= &ТекущаяДата
	|	КОНЕЦ
	|ИЗ
	|	ТаблицаОстатки КАК ТаблицаОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаВозвратТоваровОтКлиента.ЗаменяющиеТовары КАК ЗаказТовары
	|		ПО ТаблицаОстатки.Номенклатура = ЗаказТовары.Номенклатура
	|			И ТаблицаОстатки.Характеристика = ЗаказТовары.Характеристика
	|			И ТаблицаОстатки.КодСтроки = ЗаказТовары.КодСтроки
	|			И ТаблицаОстатки.ЗаказКлиента = ЗаказТовары.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаВозвратТоваровОтКлиента КАК Заказ
	|		ПО (Заказ.Ссылка = ЗаказТовары.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТоварыРеализацииПоЗаказу КАК НакладнаяТовары
	|		ПО ТаблицаОстатки.Номенклатура = НакладнаяТовары.Номенклатура
	|			И ТаблицаОстатки.Характеристика = НакладнаяТовары.Характеристика
	|			И ТаблицаОстатки.КодСтроки = НакладнаяТовары.КодСтроки
	|			И ТаблицаОстатки.ЗаказКлиента = НакладнаяТовары.ЗаказКлиента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыРеализации.ЗаказКлиента,
	|	ТоварыРеализации.ПорядокРасчетов,
	|	ТоварыРеализации.Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.НоменклатураКонтрагентов.ПустаяСсылка),
	|	ТоварыРеализации.Характеристика,
	|	ТоварыРеализации.КодСтроки,
	|	ТоварыРеализации.Количество,
	|	ТоварыРеализации.Сумма,
	|	ТоварыРеализации.Склад,
	|	ТоварыРеализации.Количество,
	|	ТоварыРеализации.НомерСтроки,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ТоварыРеализации.Упаковка,
	|	ТоварыРеализации.Серия,
	|	ТоварыРеализации.ВидЦены,
	|	0,
	|	ТоварыРеализации.Цена,
	|	ТоварыРеализации.СтавкаНДС,
	|	ВЫБОР
	|		КОГДА &НалогообложениеНДСЭкспорт
	|			ТОГДА ТоварыРеализации.КодТНВЭД
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка)
	|	КОНЕЦ,
	|	ТоварыРеализации.Сумма,
	|	ТоварыРеализации.СуммаНДС,
	|	ТоварыРеализации.СуммаСНДС,
	|	ТоварыРеализации.ПроцентРучнойСкидки,
	|	ТоварыРеализации.СуммаРучнойСкидки,
	|	ТоварыРеализации.ПроцентАвтоматическойСкидки,
	|	ТоварыРеализации.СуммаАвтоматическойСкидки,
	|	ТоварыРеализации.СуммаБонусныхБалловКСписанию,
	|	ТоварыРеализации.СуммаБонусныхБалловКСписаниюВВалюте,
	|	ТоварыРеализации.СуммаНачисленныхБонусныхБалловВВалюте,
	|	ТоварыРеализации.ТипНоменклатуры,
	|	ТоварыРеализации.НоменклатураНабора,
	|	ТоварыРеализации.ХарактеристикаНабора,
	|	ТоварыРеализации.Подразделение,
	|	ТоварыРеализации.КлючСвязи,
	|	ВЫБОР
	|		КОГДА ТоварыРеализации.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки3, 1)
	|	КОНЕЦ,
	|	ТоварыРеализации.Количество / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки3, 1),
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка),
	|	ТоварыРеализации.ИспользуетсяОрдернаяСхемаПриОтгрузке,
	|	ВЫБОР
	|		КОГДА ТоварыРеализации.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ТоварыРеализации.ИспользуетсяОрдернаяСхемаПриОтгрузке
	|	КОНЕЦ
	|ИЗ
	|	ВтТоварыРеализацииБезЗаказа КАК ТоварыРеализации
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТаблицаОстатки.ЗаказКлиента,
	|	ЗаказТовары.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗаказКлиентаТовары.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка В(&МассивЗаказов)
	|	И ЗаказКлиентаТовары.Номенклатура.ВариантОформленияПродажи В(&МассивВариантовОформления)
	|	И ЗаказКлиентаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
	|	И НЕ ЗаказКлиентаТовары.Отменено
	|	И ЗаказКлиентаТовары.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗаказКлиентаТовары.НомерСтроки
	|ИЗ
	|	Документ.ЗаявкаНаВозвратТоваровОтКлиента.ЗаменяющиеТовары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка В(&МассивЗаказов)
	|	И ЗаказКлиентаТовары.Номенклатура.ВариантОформленияПродажи В(&МассивВариантовОформления)
	|	И ЗаказКлиентаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
	|	И НЕ ЗаказКлиентаТовары.Отменено
	|	И ЗаказКлиентаТовары.Ссылка.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказКлиента.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ДокументыОтгрузки
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ОтобратьПоЗаказу
	|				ТОГДА ЗаказКлиента.Ссылка В (&МассивЗаказов)
	|						ИЛИ ЗаказКлиента.Ссылка = &Регистратор
	|			ИНАЧЕ ЗаказКлиента.Партнер = &Партнер
	|					И ЗаказКлиента.Контрагент = &Контрагент
	|					И ЗаказКлиента.Договор = &Договор
	|					И ЗаказКлиента.Организация = &Организация
	|					И ЗаказКлиента.ХозяйственнаяОперация В (&ХозяйственныеОперацииРаспоряжений)
	|					И (НЕ &ИспользоватьСоглашенияСКлиентами
	|						ИЛИ ЗаказКлиента.Соглашение = &Соглашение)
	|					И ЗаказКлиента.Сделка = &Сделка
	|					И (&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию)
	|						ИЛИ ЗаказКлиента.Валюта = &ВалютаВзаиморасчетов)
	|					И ВЫБОР
	|						КОГДА ЗаказКлиента.НалогообложениеНДС В (ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортСырьевыхТоваровУслуг), ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортНесырьевыхТоваров))
	|							ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНаЭкспорт)
	|						ИНАЧЕ ЗаказКлиента.НалогообложениеНДС
	|					КОНЕЦ = &НалогообложениеНДС
	|					И ЗаказКлиента.ЦенаВключаетНДС = &ЦенаВключаетНДС
	|					И ЗаказКлиента.ВернутьМногооборотнуюТару = &ВернутьМногооборотнуюТару
	|					И (НЕ &ИспользоватьНаправленияДеятельности
	|						ИЛИ ЗаказКлиента.НаправлениеДеятельности = &НаправлениеДеятельности)
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА ВЫРАЗИТЬ(&СкладРеализации КАК Справочник.Склады).ЭтоГруппа
	|				ТОГДА ЗаказКлиента.Склад В ИЕРАРХИИ (&СкладРеализации)
	|						ИЛИ ЗаказКлиента.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|			ИНАЧЕ ЗаказКлиента.Склад В (ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка), &СкладРеализации)
	|					ИЛИ ВЫРАЗИТЬ(ЗаказКлиента.Склад КАК Справочник.Склады).ЭтоГруппа
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаявкаНаВозвратТоваровОтКлиента.Ссылка
	|ИЗ
	|	Документ.ЗаявкаНаВозвратТоваровОтКлиента КАК ЗаявкаНаВозвратТоваровОтКлиента
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ОтобратьПоЗаказу
	|				ТОГДА ЗаявкаНаВозвратТоваровОтКлиента.Ссылка В (&МассивЗаказов)
	|						ИЛИ ЗаявкаНаВозвратТоваровОтКлиента.Ссылка = &Регистратор
	|			ИНАЧЕ ЗаявкаНаВозвратТоваровОтКлиента.Партнер = &Партнер
	|					И ЗаявкаНаВозвратТоваровОтКлиента.Контрагент = &Контрагент
	|					И ЗаявкаНаВозвратТоваровОтКлиента.Договор = &Договор
	|					И ЗаявкаНаВозвратТоваровОтКлиента.Организация = &Организация
	|					И ЗаявкаНаВозвратТоваровОтКлиента.ХозяйственнаяОперация В (&ХозяйственныеОперацииРаспоряжений)
	|					И (НЕ &ИспользоватьСоглашенияСКлиентами
	|						ИЛИ ЗаявкаНаВозвратТоваровОтКлиента.Соглашение = &Соглашение)
	|					И ЗаявкаНаВозвратТоваровОтКлиента.Сделка = &Сделка
	|					И (&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию)
	|						ИЛИ ЗаявкаНаВозвратТоваровОтКлиента.Валюта = &ВалютаВзаиморасчетов)
	|					И ЗаявкаНаВозвратТоваровОтКлиента.НалогообложениеНДС = &НалогообложениеНДС
	|					И ЗаявкаНаВозвратТоваровОтКлиента.ЦенаВключаетНДС = &ЦенаВключаетНДС
	|					И ЗаявкаНаВозвратТоваровОтКлиента.ВернутьМногооборотнуюТару = &ВернутьМногооборотнуюТару
	|					И (НЕ &ИспользоватьНаправленияДеятельности
	|						ИЛИ ЗаявкаНаВозвратТоваровОтКлиента.НаправлениеДеятельности = &НаправлениеДеятельности)
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА ВЫРАЗИТЬ(&СкладРеализации КАК Справочник.Склады).ЭтоГруппа
	|				ТОГДА ЗаявкаНаВозвратТоваровОтКлиента.Склад В ИЕРАРХИИ (&СкладРеализации)
	|						ИЛИ ЗаявкаНаВозвратТоваровОтКлиента.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|			ИНАЧЕ ЗаявкаНаВозвратТоваровОтКлиента.Склад В (ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка), &СкладРеализации)
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ОтобратьПоЗаказу
	|				ТОГДА РеализацияТоваровУслуг.Ссылка В (&МассивЗаказов)
	|						ИЛИ РеализацияТоваровУслуг.Ссылка = &Регистратор
	|			ИНАЧЕ РеализацияТоваровУслуг.Партнер = &Партнер
	|					И РеализацияТоваровУслуг.Контрагент = &Контрагент
	|					И РеализацияТоваровУслуг.Договор = &Договор
	|					И РеализацияТоваровУслуг.Организация = &Организация
	|					И РеализацияТоваровУслуг.ХозяйственнаяОперация В (&ХозяйственныеОперацииРаспоряжений)
	|					И (НЕ &ИспользоватьСоглашенияСКлиентами
	|						ИЛИ РеализацияТоваровУслуг.Соглашение = &Соглашение)
	|					И РеализацияТоваровУслуг.Сделка = &Сделка
	|					И (&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию)
	|						ИЛИ РеализацияТоваровУслуг.Валюта = &ВалютаВзаиморасчетов)
	|					И РеализацияТоваровУслуг.НалогообложениеНДС = &НалогообложениеНДС
	|					И РеализацияТоваровУслуг.ЦенаВключаетНДС = &ЦенаВключаетНДС
	|					И РеализацияТоваровУслуг.ВернутьМногооборотнуюТару = &ВернутьМногооборотнуюТару
	|					И (НЕ &ИспользоватьНаправленияДеятельности
	|						ИЛИ РеализацияТоваровУслуг.НаправлениеДеятельности = &НаправлениеДеятельности)
	|		КОНЕЦ
	|	И РеализацияТоваровУслуг.Ссылка = &Регистратор
	|	И ВЫБОР
	|			КОГДА ВЫРАЗИТЬ(&СкладРеализации КАК Справочник.Склады).ЭтоГруппа
	|				ТОГДА РеализацияТоваровУслуг.Склад В ИЕРАРХИИ (&СкладРеализации)
	|						ИЛИ РеализацияТоваровУслуг.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|			ИНАЧЕ РеализацияТоваровУслуг.Склад В (ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка), &СкладРеализации)
	|		КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ НоменклатураСВариантомОформления
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ВариантОформленияПродажи В(&МассивВариантовОформления)
	|	И (&НеОтбиратьПоОсобенностямУчета
	|			ИЛИ Номенклатура.ОсобенностьУчета В (&ОсобенностиУчетаНоменклатуры))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказКлиента.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ЗаказКлиента
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	(ЗаказКлиента.Ссылка, &ЭтоЗаказКакСчет) В
	|			(ВЫБРАТЬ
	|				ВТЗаказы.Ссылка,
	|				ВТЗаказы.ЭтоЗаказКакСчет
	|			ИЗ
	|				ВТЗаказы)
	|	И ВЫБОР
	|			КОГДА ВЫРАЗИТЬ(&СкладРеализации КАК Справочник.Склады).ЭтоГруппа
	|				ТОГДА ЗаказКлиента.Склад В ИЕРАРХИИ (&СкладРеализации)
	|						ИЛИ ЗаказКлиента.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|			ИНАЧЕ ЗаказКлиента.Склад В (ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка), &СкладРеализации)
	|		КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗаказы.ЗаказКлиента КАК ЗаказКлиента,
	|	ТаблицаЗаказы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗаказы.Характеристика КАК Характеристика,
	|	ТаблицаЗаказы.Склад КАК Склад,
	|	ТаблицаЗаказы.ОрдернаяСхемаПриОтгрузке КАК ОрдернаяСхемаПриОтгрузке,
	|	ТаблицаЗаказы.Серия КАК Серия,
	|	ТаблицаЗаказы.Назначение КАК Назначение,
	|	СУММА(ТаблицаЗаказы.КоличествоСобирается) КАК КоличествоСобирается,
	|	СУММА(ТаблицаЗаказы.Количество) КАК Количество
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТоварыКОтгрузкеОстатки.ДокументОтгрузки КАК ЗаказКлиента,
	|		ТоварыКОтгрузкеОстатки.Номенклатура КАК Номенклатура,
	|		ТоварыКОтгрузкеОстатки.Характеристика КАК Характеристика,
	|		ТоварыКОтгрузкеОстатки.Склад КАК Склад,
	|		ВЫБОР
	|			КОГДА ТоварыКОтгрузкеОстатки.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке = ИСТИНА
	|					И ТоварыКОтгрузкеОстатки.Склад.ДатаНачалаОрдернойСхемыПриОтгрузке <= &ТекущаяДата
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ КАК ОрдернаяСхемаПриОтгрузке,
	|		ТоварыКОтгрузкеОстатки.Серия КАК Серия,
	|		ТоварыКОтгрузкеОстатки.Назначение КАК Назначение,
	|		ТоварыКОтгрузкеОстатки.СобираетсяПриход КАК КоличествоСобирается,
	|		ТоварыКОтгрузкеОстатки.КОтгрузкеРасход + ТоварыКОтгрузкеОстатки.СобраноПриход КАК Количество
	|	ИЗ
	|		РегистрНакопления.ТоварыКОтгрузке.ОстаткиИОбороты(
	|				,
	|				,
	|				,
	|				,
	|				ДокументОтгрузки В
	|						(ВЫБРАТЬ
	|							ДокументыОтгрузки.Ссылка
	|						ИЗ
	|							ДокументыОтгрузки)
	|					И Номенклатура В
	|						(ВЫБРАТЬ
	|							НоменклатураСВариантомОформления.Ссылка
	|						ИЗ
	|							НоменклатураСВариантомОформления)) КАК ТоварыКОтгрузкеОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыКОтгрузкеОстатки.ДокументОтгрузки,
	|		ТоварыКОтгрузкеОстатки.Номенклатура,
	|		ТоварыКОтгрузкеОстатки.Характеристика,
	|		ТоварыКОтгрузкеОстатки.Склад,
	|		(ТоварыКОтгрузкеОстатки.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке = ИСТИНА
	|			И ТоварыКОтгрузкеОстатки.Склад.ДатаНачалаОрдернойСхемыПриОтгрузке <= &ТекущаяДата),
	|		ТоварыКОтгрузкеОстатки.Серия,
	|		ТоварыКОтгрузкеОстатки.Назначение,
	|		ТоварыКОтгрузкеОстатки.СобираетсяПриход,
	|		- ТоварыКОтгрузкеОстатки.КОтгрузкеПриход
	|	ИЗ
	|		РегистрНакопления.ТоварыКОтгрузке.ОстаткиИОбороты(
	|				,
	|				,
	|				Регистратор,
	|				,
	|				ДокументОтгрузки В
	|						(ВЫБРАТЬ
	|							ДокументыОтгрузки.Ссылка
	|						ИЗ
	|							ДокументыОтгрузки)
	|					И Номенклатура В
	|						(ВЫБРАТЬ
	|							НоменклатураСВариантомОформления.Ссылка
	|						ИЗ
	|							НоменклатураСВариантомОформления)) КАК ТоварыКОтгрузкеОстатки
	|	ГДЕ ТоварыКОтгрузкеОстатки.Регистратор ССЫЛКА Документ.АктОРасхожденияхПослеОтгрузки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыКОтгрузкеОстатки.ДокументОтгрузки,
	|		ТоварыКОтгрузкеОстатки.Номенклатура,
	|		ТоварыКОтгрузкеОстатки.Характеристика,
	|		ТоварыКОтгрузкеОстатки.Склад,
	|		(ТоварыКОтгрузкеОстатки.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке = ИСТИНА
	|			И ТоварыКОтгрузкеОстатки.Склад.ДатаНачалаОрдернойСхемыПриОтгрузке <= &ТекущаяДата),
	|		ТоварыКОтгрузкеОстатки.Серия,
	|		ТоварыКОтгрузкеОстатки.Назначение,
	|		ТоварыКОтгрузкеОстатки.СобираетсяПриход,
	|		- ТоварыКОтгрузкеОстатки.КОтгрузкеПриход
	|	ИЗ
	|		РегистрНакопления.ТоварыКОтгрузке.ОстаткиИОбороты(
	|				,
	|				,
	|				Регистратор,
	|				,
	|				ДокументОтгрузки В
	|						(ВЫБРАТЬ
	|							ДокументыОтгрузки.Ссылка
	|						ИЗ
	|							ДокументыОтгрузки)
	|					И Номенклатура В
	|						(ВЫБРАТЬ
	|							НоменклатураСВариантомОформления.Ссылка
	|						ИЗ
	|							НоменклатураСВариантомОформления)) КАК ТоварыКОтгрузкеОстатки
	|	ГДЕ ТоварыКОтгрузкеОстатки.Регистратор ССЫЛКА Документ.АктОРасхожденияхПослеОтгрузки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЗаказыОстатки.Распоряжение,
	|		ЗаказыОстатки.Номенклатура,
	|		ЗаказыОстатки.Характеристика,
	|		ЗаказыОстатки.Склад,
	|		ВЫБОР
	|			КОГДА ЗаказыОстатки.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке = ИСТИНА
	|					И ЗаказыОстатки.Склад.ДатаНачалаОрдернойСхемыПриОтгрузке <= &ТекущаяДата
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ,
	|		ЗаказыОстатки.Серия,
	|		ВЫБОР
	|			КОГДА ЗаказТовары.Обособленно
	|				ТОГДА ЗаказТовары.Ссылка.Назначение
	|			КОГДА ЗаказТоварыЗамена.Обособленно
	|				ТОГДА ЗаказТоварыЗамена.Ссылка.Назначение
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|		КОНЕЦ,
	|		0,
	|		ЗаказыОстатки.КОформлениюОборот
	|	ИЗ
	|		РегистрНакопления.РаспоряженияНаОтгрузку.Обороты(
	|				,
	|				,
	|				РЕГИСТРАТОР,
	|				Распоряжение В
	|						(ВЫБРАТЬ
	|							ЗаказКлиента.Ссылка
	|						ИЗ
	|							ЗаказКлиента)
	|					И Номенклатура В
	|						(ВЫБРАТЬ
	|							НоменклатураСВариантомОформления.Ссылка
	|						ИЗ
	|							НоменклатураСВариантомОформления)
	|					И ВидДвиженияРегистра = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияНакопления.Расход)) КАК ЗаказыОстатки
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказТовары
	|			ПО ЗаказыОстатки.Номенклатура = ЗаказТовары.Номенклатура
	|				И ЗаказыОстатки.Характеристика = ЗаказТовары.Характеристика
	|				И ЗаказыОстатки.КодСтроки = ЗаказТовары.КодСтроки
	|				И ЗаказыОстатки.Распоряжение = ЗаказТовары.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаВозвратТоваровОтКлиента.ЗаменяющиеТовары КАК ЗаказТоварыЗамена
	|			ПО ЗаказыОстатки.Номенклатура = ЗаказТоварыЗамена.Номенклатура
	|				И ЗаказыОстатки.Характеристика = ЗаказТоварыЗамена.Характеристика
	|				И ЗаказыОстатки.КодСтроки = ЗаказТоварыЗамена.КодСтроки
	|				И ЗаказыОстатки.Распоряжение = ЗаказТоварыЗамена.Ссылка
	|	ГДЕ
	|		ЗаказыОстатки.Регистратор <> &Регистратор) КАК ТаблицаЗаказы
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗаказы.ЗаказКлиента,
	|	ТаблицаЗаказы.Номенклатура,
	|	ТаблицаЗаказы.Характеристика,
	|	ТаблицаЗаказы.Склад,
	|	ТаблицаЗаказы.ОрдернаяСхемаПриОтгрузке,
	|	ТаблицаЗаказы.Серия,
	|	ТаблицаЗаказы.Назначение
	|
	|ИМЕЮЩИЕ
	|	(СУММА(ТаблицаЗаказы.Количество) > 0
	|		ИЛИ СУММА(ТаблицаЗаказы.КоличествоСобирается) > 0)";

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаКоэффициентУпаковки1",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
	"НакладнаяТовары.Упаковка",
	"НакладнаяТовары.Номенклатура"));
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаКоэффициентУпаковки2",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
	"ЗаказТовары.Упаковка",
	"ЗаказТовары.Номенклатура"));
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаКоэффициентУпаковки3",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
	"ТоварыРеализации.Упаковка",
	"ТоварыРеализации.Номенклатура"));

	УстановитьПривилегированныйРежим(Истина);
	Возврат Запрос.ВыполнитьПакет();

КонецФункции   

//&Вместо("ПолучитьРезультатЗапросаПоОстаткамЗаказов")
//Функция КАНАТ_ПолучитьРезультатЗапросаПоОстаткамЗаказов(ДанныеОтбора, ПараметрыЗаполнения, СкладРеализации, МассивЗаказов)
//	Запрос = Новый Запрос;
//	
//	Запрос.УстановитьПараметр("МассивЗаказов",             МассивЗаказов);
//	Запрос.УстановитьПараметр("Партнер",                   ДанныеОтбора.Партнер);
//	Запрос.УстановитьПараметр("Контрагент",                ДанныеОтбора.Контрагент);
//	Запрос.УстановитьПараметр("Договор",                   ДанныеОтбора.Договор);
//	Запрос.УстановитьПараметр("Организация",               ДанныеОтбора.Организация);
//	Запрос.УстановитьПараметр("Сделка",                    ДанныеОтбора.Сделка);
//	Запрос.УстановитьПараметр("Соглашение",                ДанныеОтбора.Соглашение);
//	Запрос.УстановитьПараметр("ВалютаВзаиморасчетов",      ДанныеОтбора.ВалютаВзаиморасчетов);
//	Запрос.УстановитьПараметр("НалогообложениеНДС",        ДанныеОтбора.НалогообложениеНДС);
//	Запрос.УстановитьПараметр("ЦенаВключаетНДС",           ДанныеОтбора.ЦенаВключаетНДС);
//	Запрос.УстановитьПараметр("ВернутьМногооборотнуюТару", ДанныеОтбора.ВернутьМногооборотнуюТару);
//	Запрос.УстановитьПараметр("ТребуетсяЗалогЗаТару",      ДанныеОтбора.ТребуетсяЗалогЗаТару);
//	Запрос.УстановитьПараметр("ПорядокРасчетов",           ДанныеОтбора.ПорядокРасчетов);
//	Запрос.УстановитьПараметр("Регистратор",               ДанныеОтбора.Ссылка);
//	Запрос.УстановитьПараметр("СкладРеализации",           СкладРеализации);
//	Запрос.УстановитьПараметр("ОтобратьПоЗаказу",          МассивЗаказов <> Неопределено);
//	Запрос.УстановитьПараметр("ХозяйственнаяОперация",     ДанныеОтбора.ХозяйственнаяОперация);
//	Запрос.УстановитьПараметр("ТекущаяДата",               НачалоДня(ТекущаяДатаСеанса()));
//	Запрос.УстановитьПараметр("ИспользоватьСоглашенияСКлиентами",
//		ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами"));
//	Запрос.УстановитьПараметр("НаправлениеДеятельности",        ДанныеОтбора.НаправлениеДеятельности);
//	Запрос.УстановитьПараметр("ИспользоватьНаправленияДеятельности",
//		ПолучитьФункциональнуюОпцию("ИспользоватьУчетДоходовПоНаправлениямДеятельности"));
//		
//	ИспользоватьРасширенныеВозможностиЗаказаКлиента = Неопределено;
//	ПараметрыЗаполнения.Свойство("ИспользоватьРасширенныеВозможностиЗаказаКлиента",
//		ИспользоватьРасширенныеВозможностиЗаказаКлиента);
//	Если ИспользоватьРасширенныеВозможностиЗаказаКлиента = Неопределено Тогда
//		ИспользоватьРасширенныеВозможностиЗаказаКлиента = ПолучитьФункциональнуюОпцию("ИспользоватьРасширенныеВозможностиЗаказаКлиента");
//	КонецЕсли;
//	Запрос.УстановитьПараметр("ЭтоЗаказКакСчет", Не ИспользоватьРасширенныеВозможностиЗаказаКлиента);
//	
//	ХозяйственныеОперацииРаспоряжений = Новый Массив();
//	
//	Если ДанныеОтбора.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиенту
//		Или ДанныеОтбора.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиентуРеглУчет 
//		Или ДанныеОтбора.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности Тогда
//		
//		ХозяйственныеОперацииРаспоряжений.Добавить(Перечисления.ХозяйственныеОперации.РеализацияКлиенту);
//		ХозяйственныеОперацииРаспоряжений.Добавить(Перечисления.ХозяйственныеОперации.ВозвратТоваровОтКлиента);
//		ХозяйственныеОперацииРаспоряжений.Добавить(Перечисления.ХозяйственныеОперации.ВозвратОтРозничногоПокупателя);
//		ХозяйственныеОперацииРаспоряжений.Добавить(Перечисления.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности);
//		
//	ИначеЕсли ДанныеОтбора.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию  Тогда
//		
//		ХозяйственныеОперацииРаспоряжений.Добавить(Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию);
//		ХозяйственныеОперацииРаспоряжений.Добавить(Перечисления.ХозяйственныеОперации.ВозвратОтКомиссионера);
//		
//	КонецЕсли;
//	
//	Запрос.УстановитьПараметр("ХозяйственныеОперацииРаспоряжений", ХозяйственныеОперацииРаспоряжений);
//	
//	ВариантОформления = Неопределено;
//	ПараметрыЗаполнения.Свойство("ВариантОформления", ВариантОформления);
//	
//	МассивВариантовОформления = Новый Массив;
//	Если ЗначениеЗаполнено(ВариантОформления) Тогда
//		МассивВариантовОформления.Добавить(ВариантОформления);
//	Иначе
//		МассивВариантовОформления.Добавить(Перечисления.ВариантыОформленияПродажи.РеализацияТоваровУслуг);
//		МассивВариантовОформления.Добавить(Перечисления.ВариантыОформленияПродажи.АктНаПередачуПрав);
//	КонецЕсли;
//	
//	Запрос.УстановитьПараметр("МассивВариантовОформления", МассивВариантовОформления);
//	
//	РеализацияТоваровУслугЛокализация.УстановитьПараметрыОсобенностиУчетаНоменклатуры(ПараметрыЗаполнения, Запрос.Параметры);
//		
//	Если ТипЗнч(ДанныеОтбора) = Тип("Структура") 
//		И ДанныеОтбора.Свойство("ТоварыРеализации") Тогда
//		Запрос.УстановитьПараметр("ТоварыРеализации", ДанныеОтбора.ТоварыРеализации);
//	Иначе
//		ТоварыРеализации = Новый ТаблицаЗначений;
//		ТоварыРеализации.Колонки.Добавить("ЗаказКлиента", Новый ОписаниеТипов("ДокументСсылка.ЗаказКлиента"));
//		ТоварыРеализации.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
//		ТоварыРеализации.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
//		ТоварыРеализации.Колонки.Добавить("КодСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0)));
//		ТоварыРеализации.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
//		ТоварыРеализации.Колонки.Добавить("СуммаВзаиморасчетов", ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля());
//		ТоварыРеализации.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
//		ТоварыРеализации.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0)));
//		ТоварыРеализации.Колонки.Добавить("Упаковка", Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
//		ТоварыРеализации.Колонки.Добавить("Серия", Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
//		ТоварыРеализации.Колонки.Добавить("ВидЦены", Новый ОписаниеТипов("СправочникСсылка.ВидыЦен"));
//		ТоварыРеализации.Колонки.Добавить("КоличествоВЗаказе", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
//		ТоварыРеализации.Колонки.Добавить("Цена", ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля());
//		ТоварыРеализации.Колонки.Добавить("СтавкаНДС", Новый ОписаниеТипов("СправочникСсылка.СтавкиНДС"));
//		ТоварыРеализации.Колонки.Добавить("Сумма", ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля());
//		ТоварыРеализации.Колонки.Добавить("СуммаНДС", ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля());
//		ТоварыРеализации.Колонки.Добавить("СуммаСНДС", ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля());
//		ТоварыРеализации.Колонки.Добавить("ПроцентРучнойСкидки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(5, 2)));
//		ТоварыРеализации.Колонки.Добавить("СуммаРучнойСкидки", ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля());
//		ТоварыРеализации.Колонки.Добавить("ПроцентАвтоматическойСкидки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(5, 2)));
//		ТоварыРеализации.Колонки.Добавить("СуммаАвтоматическойСкидки", ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля());
//		ТоварыРеализации.Колонки.Добавить("СуммаБонусныхБалловКСписанию", ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля());
//		ТоварыРеализации.Колонки.Добавить("СуммаБонусныхБалловКСписаниюВВалюте", ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля());
//		ТоварыРеализации.Колонки.Добавить("СуммаНачисленныхБонусныхБалловВВалюте", ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля());
//		ТоварыРеализации.Колонки.Добавить("НоменклатураНабора", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
//		ТоварыРеализации.Колонки.Добавить("ХарактеристикаНабора", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
//		ТоварыРеализации.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"));
//		ТоварыРеализации.Колонки.Добавить("КлючСвязи", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0)));
//		
//		Запрос.УстановитьПараметр("ТоварыРеализации", ТоварыРеализации);
//	КонецЕсли;
//	
//	Запрос.Текст =
//		"ВЫБРАТЬ
//		|	ТоварыРеализации.КодСтроки КАК КодСтроки,
//		|	ТоварыРеализации.ЗаказКлиента КАК ЗаказКлиента,
//		|	ТоварыРеализации.Номенклатура КАК Номенклатура,
//		|	ТоварыРеализации.Характеристика КАК Характеристика,
//		|	ТоварыРеализации.Количество КАК Количество,
//		|	ТоварыРеализации.Серия КАК Серия,
//		|	ТоварыРеализации.Упаковка КАК Упаковка
//		|ПОМЕСТИТЬ ВтТоварыРеализации
//		|ИЗ
//		|	&ТоварыРеализации КАК ТоварыРеализации
//		|ГДЕ
//		|	ТоварыРеализации.КодСтроки <> 0
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ВтТоварыРеализации.КодСтроки КАК КодСтроки,
//		|	ВтТоварыРеализации.ЗаказКлиента КАК ЗаказКлиента,
//		|	ВтТоварыРеализации.Номенклатура КАК Номенклатура,
//		|	ВтТоварыРеализации.Характеристика КАК Характеристика,
//		|	СУММА(ВтТоварыРеализации.Количество) КАК Количество,
//		|	ВтТоварыРеализации.Серия КАК Серия,
//		|	ВЫРАЗИТЬ(ВтТоварыРеализации.Упаковка КАК Справочник.УпаковкиЕдиницыИзмерения) КАК Упаковка
//		|ПОМЕСТИТЬ ВтТоварыРеализацииПоЗаказу
//		|ИЗ
//		|	ВтТоварыРеализации КАК ВтТоварыРеализации
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	ВтТоварыРеализации.КодСтроки,
//		|	ВтТоварыРеализации.ЗаказКлиента,
//		|	ВтТоварыРеализации.Номенклатура,
//		|	ВтТоварыРеализации.Характеристика,
//		|	ВтТоварыРеализации.Серия,
//		|	ВтТоварыРеализации.Упаковка
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	&Регистратор КАК ЗаказКлиента,
//		|	&ПорядокРасчетов КАК ПорядокРасчетов,
//		|	ВЫРАЗИТЬ(ТоварыРеализации.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
//		|	ТоварыРеализации.Характеристика КАК Характеристика,
//		|	ТоварыРеализации.КодСтроки КАК КодСтроки,
//		|	ТоварыРеализации.Количество КАК Количество,
//		|	ТоварыРеализации.Сумма КАК СуммаВзаиморасчетов,
//		|	ВЫРАЗИТЬ(ТоварыРеализации.Склад КАК Справочник.Склады) КАК Склад,
//		|	ТоварыРеализации.НомерСтроки КАК НомерСтроки,
//		|	ВЫРАЗИТЬ(ТоварыРеализации.Упаковка КАК Справочник.УпаковкиЕдиницыИзмерения) КАК Упаковка,
//		|	ТоварыРеализации.Серия КАК Серия,
//		|	ТоварыРеализации.ВидЦены КАК ВидЦены,
//		|	ТоварыРеализации.Количество КАК КоличествоВЗаказе,
//		|	ТоварыРеализации.Цена КАК Цена,
//		|	ТоварыРеализации.СтавкаНДС КАК СтавкаНДС,
//		|	ТоварыРеализации.Сумма КАК Сумма,
//		|	ТоварыРеализации.СуммаНДС КАК СуммаНДС,
//		|	ТоварыРеализации.СуммаСНДС КАК СуммаСНДС,
//		|	ТоварыРеализации.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
//		|	ТоварыРеализации.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
//		|	ТоварыРеализации.ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки,
//		|	ТоварыРеализации.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
//		|	ТоварыРеализации.СуммаБонусныхБалловКСписанию КАК СуммаБонусныхБалловКСписанию,
//		|	ТоварыРеализации.СуммаБонусныхБалловКСписаниюВВалюте КАК СуммаБонусныхБалловКСписаниюВВалюте,
//		|	ТоварыРеализации.СуммаНачисленныхБонусныхБалловВВалюте КАК СуммаНачисленныхБонусныхБалловВВалюте,
//		|	ТоварыРеализации.НоменклатураНабора КАК НоменклатураНабора,
//		|	ТоварыРеализации.ХарактеристикаНабора КАК ХарактеристикаНабора,
//		|	ТоварыРеализации.Подразделение КАК Подразделение,
//		|	ТоварыРеализации.КлючСвязи КАК КлючСвязи
//		|ПОМЕСТИТЬ ВтТоварыРеализацииБезЗаказа
//		|ИЗ
//		|	&ТоварыРеализации КАК ТоварыРеализации
//		|ГДЕ
//		|	ТоварыРеализации.КодСтроки = 0
//		|;
//		|
//		//VVlarionov_fix_09,09.24 
//		|//////////////////////////////////////////////////////////////////////////////// 
//		|ВЫБРАТЬ
//		|	ЗаказКлиента.Ссылка КАК Ссылка,
//		|	ЗаказКлиента.ЭтоЗаказКакСчет КАК ЭтоЗаказКакСчет
//		|ПОМЕСТИТЬ ВТЗаказы
//		|ИЗ
//		|	Документ.ЗаказКлиента КАК ЗаказКлиента
//		|ГДЕ
//		|	ВЫБОР
//		|			КОГДА &ОтобратьПоЗаказу
//		|				ТОГДА ЗаказКлиента.Ссылка В (&МассивЗаказов)
//		|			ИНАЧЕ ЗаказКлиента.Партнер = &Партнер
//		|					И ЗаказКлиента.Контрагент = &Контрагент
//		|					И ЗаказКлиента.Договор = &Договор
//		|					И ЗаказКлиента.Организация = &Организация
//		|					И ЗаказКлиента.ХозяйственнаяОперация В (&ХозяйственныеОперацииРаспоряжений)
//		|					И (НЕ &ИспользоватьСоглашенияСКлиентами
//		|						ИЛИ ЗаказКлиента.Соглашение = &Соглашение)
//		|					И ЗаказКлиента.Сделка = &Сделка
//		|					И (ЗаказКлиента.Валюта = &ВалютаВзаиморасчетов
//		|						ИЛИ &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию))
//		|					И ВЫБОР
//		|						КОГДА ЗаказКлиента.НалогообложениеНДС В (ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортСырьевыхТоваровУслуг), ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортНесырьевыхТоваров))
//		|							ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНаЭкспорт)
//		|						ИНАЧЕ ЗаказКлиента.НалогообложениеНДС
//		|					КОНЕЦ = &НалогообложениеНДС
//		|					И ЗаказКлиента.ЦенаВключаетНДС = &ЦенаВключаетНДС
//		|					И ЗаказКлиента.ВернутьМногооборотнуюТару = &ВернутьМногооборотнуюТару
//		|					И ЗаказКлиента.ТребуетсяЗалогЗаТару = &ТребуетсяЗалогЗаТару
//		|					И (НЕ &ИспользоватьНаправленияДеятельности
//		|						ИЛИ ЗаказКлиента.НаправлениеДеятельности = &НаправлениеДеятельности)
//		|		КОНЕЦ
//		|
//		|ОБЪЕДИНИТЬ ВСЕ
//		|
//		|ВЫБРАТЬ
//		|	ЗаказКлиента.Ссылка,
//		|	ЗаказКлиента.ЭтоЗаказКакСчет
//		|ИЗ
//		|	Документ.ЗаявкаНаВозвратТоваровОтКлиента КАК ЗаказКлиента
//		|ГДЕ
//		|	ВЫБОР
//		|			КОГДА &ОтобратьПоЗаказу
//		|				ТОГДА ЗаказКлиента.Ссылка В (&МассивЗаказов)
//		|			ИНАЧЕ ЗаказКлиента.Партнер = &Партнер
//		|					И ЗаказКлиента.Контрагент = &Контрагент
//		|					И ЗаказКлиента.Договор = &Договор
//		|					И ЗаказКлиента.Организация = &Организация
//		|					И ЗаказКлиента.ХозяйственнаяОперация В (&ХозяйственныеОперацииРаспоряжений)
//		|					И (НЕ &ИспользоватьСоглашенияСКлиентами
//		|						ИЛИ ЗаказКлиента.Соглашение = &Соглашение)
//		|					И ЗаказКлиента.Сделка = &Сделка
//		|					И (ЗаказКлиента.Валюта = &ВалютаВзаиморасчетов
//		|						ИЛИ &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию))
//		|					И ВЫБОР
//		|						КОГДА ЗаказКлиента.НалогообложениеНДС В (ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортСырьевыхТоваровУслуг), ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортНесырьевыхТоваров))
//		|							ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНаЭкспорт)
//		|						ИНАЧЕ ЗаказКлиента.НалогообложениеНДС
//		|					КОНЕЦ = &НалогообложениеНДС
//		|					И ЗаказКлиента.ЦенаВключаетНДС = &ЦенаВключаетНДС
//		|					И ЗаказКлиента.ВернутьМногооборотнуюТару = &ВернутьМногооборотнуюТару
//		|					И ЗаказКлиента.ТребуетсяЗалогЗаТару = &ТребуетсяЗалогЗаТару
//		|					И (НЕ &ИспользоватьНаправленияДеятельности
//		|						ИЛИ ЗаказКлиента.НаправлениеДеятельности = &НаправлениеДеятельности)
//		|		КОНЕЦ
//		|
//		|ИНДЕКСИРОВАТЬ ПО
//		|	Ссылка
//		|;
//		|
//		|//////////////////////////////////////////////////////////////////////////////// 
//		//vvlarionov_fix090924
//		|ВЫБРАТЬ
//		|	ТаблицаЗаказы.ЗаказКлиента КАК ЗаказКлиента,
//		|	ТаблицаЗаказы.Номенклатура КАК Номенклатура,
//		|	ТаблицаЗаказы.Характеристика КАК Характеристика,
//		|	ТаблицаЗаказы.КодСтроки КАК КодСтроки,
//		|	ТаблицаЗаказы.Склад КАК Склад,
//		|	ТаблицаЗаказы.Серия КАК Серия,
//		|	СУММА(ТаблицаЗаказы.КОформлению) КАК Количество,
//		|	СУММА(ТаблицаЗаказы.Сумма) КАК Сумма
//		|ПОМЕСТИТЬ ТаблицаОстатки
//		|ИЗ
//		|	(ВЫБРАТЬ
//		|		ЗаказыОстатки.ЗаказКлиента КАК ЗаказКлиента,
//		|		ЗаказыОстатки.Номенклатура КАК Номенклатура,
//		|		ЗаказыОстатки.Характеристика КАК Характеристика,
//		|		ЗаказыОстатки.КодСтроки КАК КодСтроки,
//		|		ЗаказыОстатки.Склад КАК Склад,
//		|		ЗаказыОстатки.Серия КАК Серия,
//		|		ЗаказыОстатки.КОформлениюОстаток КАК КОформлению,
//		|		ЗаказыОстатки.СуммаОстаток КАК Сумма
//		|	ИЗ
//		|		РегистрНакопления.УдалитьЗаказыКлиентов.Остатки(
//		|				,
//		|				ВЫБОР
//		|						КОГДА &ОтобратьПоЗаказу
//		|							ТОГДА ЗаказКлиента В (&МассивЗаказов)
//		|						ИНАЧЕ ЗаказКлиента.Партнер = &Партнер
//		|								И ЗаказКлиента.Контрагент = &Контрагент
//		|								И ЗаказКлиента.Договор = &Договор
//		|								И ЗаказКлиента.Организация = &Организация
//		|								И ЗаказКлиента.ХозяйственнаяОперация В (&ХозяйственныеОперацииРаспоряжений)
//		|								И ВЫБОР
//		|									КОГДА НЕ &ИспользоватьСоглашенияСКлиентами
//		|										ТОГДА ИСТИНА
//		|									ИНАЧЕ ЗаказКлиента.Соглашение = &Соглашение
//		|								КОНЕЦ
//		|								И ЗаказКлиента.Сделка = &Сделка
//		|								И (ЗаказКлиента.Валюта = &ВалютаВзаиморасчетов
//		|									ИЛИ &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию))
//		|								И ВЫБОР
//		|									КОГДА ЗаказКлиента.НалогообложениеНДС В (ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортСырьевыхТоваровУслуг), ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортНесырьевыхТоваров))
//		|										ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНаЭкспорт)
//		|									ИНАЧЕ ЗаказКлиента.НалогообложениеНДС
//		|								КОНЕЦ = &НалогообложениеНДС
//		|								И ЗаказКлиента.ЦенаВключаетНДС = &ЦенаВключаетНДС
//		|								И ЗаказКлиента.ВернутьМногооборотнуюТару = &ВернутьМногооборотнуюТару
//		|								И ЗаказКлиента.ТребуетсяЗалогЗаТару = &ТребуетсяЗалогЗаТару
//		|								И ВЫБОР
//		|									КОГДА НЕ &ИспользоватьНаправленияДеятельности
//		|										ТОГДА ИСТИНА
//		|									ИНАЧЕ ЗаказКлиента.НаправлениеДеятельности = &НаправлениеДеятельности
//		|								КОНЕЦ
//		|					КОНЕЦ
//		|					И ЗаказКлиента.ЭтоЗаказКакСчет = &ЭтоЗаказКакСчет
//		|					И ВЫБОР
//		|						КОГДА ВЫРАЗИТЬ(&СкладРеализации КАК Справочник.Склады).ЭтоГруппа
//		|							ТОГДА Склад В ИЕРАРХИИ (&СкладРеализации)
//		|									ИЛИ Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
//		|						ИНАЧЕ Склад В (ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка), &СкладРеализации)
//		|					КОНЕЦ
//		|					И Номенклатура.ВариантОформленияПродажи В (&МассивВариантовОформления)
//		|					И (&НеОтбиратьПоОсобенностямУчета ИЛИ Номенклатура.ОсобенностьУчета В (&ОсобенностиУчетаНоменклатуры))) КАК ЗаказыОстатки
//		|	
//		|	ОБЪЕДИНИТЬ ВСЕ
//		|	
//		|	ВЫБРАТЬ
//		|		ЗаказыДвижения.ЗаказКлиента,
//		|		ЗаказыДвижения.Номенклатура,
//		|		ЗаказыДвижения.Характеристика,
//		|		ЗаказыДвижения.КодСтроки,
//		|		ЗаказыДвижения.Склад,
//		|		ЗаказыДвижения.Серия,
//		|		ВЫБОР
//		|			КОГДА ЗаказыДвижения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
//		|				ТОГДА -ЗаказыДвижения.КОформлению
//		|			ИНАЧЕ ЗаказыДвижения.КОформлению
//		|		КОНЕЦ,
//		|		ВЫБОР
//		|			КОГДА ЗаказыДвижения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
//		|				ТОГДА -ЗаказыДвижения.Сумма
//		|			ИНАЧЕ ЗаказыДвижения.Сумма
//		|		КОНЕЦ
//		|	ИЗ
//		|		РегистрНакопления.УдалитьЗаказыКлиентов КАК ЗаказыДвижения
//		|	ГДЕ
//		|		ЗаказыДвижения.Регистратор = &Регистратор
//		|		И ЗаказКлиента.ЭтоЗаказКакСчет = &ЭтоЗаказКакСчет
//		|		И ВЫБОР
//		|				КОГДА &ОтобратьПоЗаказу
//		|					ТОГДА ЗаказыДвижения.ЗаказКлиента В (&МассивЗаказов)
//		|				ИНАЧЕ ЗаказыДвижения.ЗаказКлиента.Партнер = &Партнер
//		|						И ЗаказыДвижения.ЗаказКлиента.Контрагент = &Контрагент
//		|						И ЗаказыДвижения.ЗаказКлиента.Договор = &Договор
//		|						И ЗаказыДвижения.ЗаказКлиента.Организация = &Организация
//		|						И ЗаказыДвижения.ЗаказКлиента.ХозяйственнаяОперация В (&ХозяйственныеОперацииРаспоряжений)
//		|						И ВЫБОР
//		|							КОГДА НЕ &ИспользоватьСоглашенияСКлиентами
//		|								ТОГДА ИСТИНА
//		|							ИНАЧЕ ЗаказыДвижения.ЗаказКлиента.Соглашение = &Соглашение
//		|						КОНЕЦ
//		|						И ЗаказыДвижения.ЗаказКлиента.Сделка = &Сделка
//		|						И (ЗаказыДвижения.ЗаказКлиента.Валюта = &ВалютаВзаиморасчетов
//		|							ИЛИ &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию))
//		|						И ВЫБОР
//		|							КОГДА ЗаказыДвижения.ЗаказКлиента.НалогообложениеНДС В (ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортСырьевыхТоваровУслуг), ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортНесырьевыхТоваров))
//		|								ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНаЭкспорт)
//		|							ИНАЧЕ ЗаказыДвижения.ЗаказКлиента.НалогообложениеНДС
//		|						КОНЕЦ = &НалогообложениеНДС
//		|						И ЗаказыДвижения.ЗаказКлиента.ЦенаВключаетНДС = &ЦенаВключаетНДС
//		|						И ЗаказыДвижения.ЗаказКлиента.ВернутьМногооборотнуюТару = &ВернутьМногооборотнуюТару
//		|						И ЗаказыДвижения.ЗаказКлиента.ТребуетсяЗалогЗаТару = &ТребуетсяЗалогЗаТару
//		|						И ВЫБОР
//		|							КОГДА НЕ &ИспользоватьНаправленияДеятельности
//		|								ТОГДА ИСТИНА
//		|							ИНАЧЕ ЗаказыДвижения.ЗаказКлиента.НаправлениеДеятельности = &НаправлениеДеятельности
//		|						КОНЕЦ
//		|			КОНЕЦ
//		|		И ЗаказыДвижения.Активность
//		|		И ВЫБОР
//		|				КОГДА ВЫРАЗИТЬ(&СкладРеализации КАК Справочник.Склады).ЭтоГруппа
//		|					ТОГДА ЗаказыДвижения.Склад В ИЕРАРХИИ (&СкладРеализации)
//		|							ИЛИ ЗаказыДвижения.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
//		|				ИНАЧЕ ЗаказыДвижения.Склад В (ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка), &СкладРеализации)
//		|			КОНЕЦ
//		|		И ЗаказыДвижения.Номенклатура.ВариантОформленияПродажи В(&МассивВариантовОформления)
//		|		И (&НеОтбиратьПоОсобенностямУчета ИЛИ ЗаказыДвижения.Номенклатура.ОсобенностьУчета В (&ОсобенностиУчетаНоменклатуры))
//		|	
//		|	ОБЪЕДИНИТЬ ВСЕ
//		|	
//		|	ВЫБРАТЬ
//		|		ЗаказКлиентаТовары.Ссылка,
//		|		ЗаказКлиентаТовары.Номенклатура,
//		|		ЗаказКлиентаТовары.Характеристика,
//		|		ЗаказКлиентаТовары.КодСтроки,
//		|		ЗаказКлиентаТовары.Склад,
//		|		ЗаказКлиентаТовары.Серия,
//		|		ЗаказКлиентаТовары.Количество,
//		|		ЗаказКлиентаТовары.СуммаСНДС
//		|	ИЗ
//		|		Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
//		|	ГДЕ
//		|		ВЫБОР
//		|				КОГДА &ОтобратьПоЗаказу
//		|					ТОГДА ЗаказКлиентаТовары.Ссылка В (&МассивЗаказов)
//		|				ИНАЧЕ ЗаказКлиентаТовары.Ссылка.Партнер = &Партнер
//		|						И ЗаказКлиентаТовары.Ссылка.Контрагент = &Контрагент
//		|						И ЗаказКлиентаТовары.Ссылка.Договор = &Договор
//		|						И ЗаказКлиентаТовары.Ссылка.Организация = &Организация
//		|						И ЗаказКлиентаТовары.Ссылка.ХозяйственнаяОперация В (&ХозяйственныеОперацииРаспоряжений)
//		|						И ВЫБОР
//		|							КОГДА НЕ &ИспользоватьСоглашенияСКлиентами
//		|								ТОГДА ИСТИНА
//		|							ИНАЧЕ ЗаказКлиентаТовары.Ссылка.Соглашение = &Соглашение
//		|						КОНЕЦ
//		|						И ЗаказКлиентаТовары.Ссылка.Сделка = &Сделка
//		|						И (ЗаказКлиентаТовары.Ссылка.Валюта = &ВалютаВзаиморасчетов
//		|							ИЛИ &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию))
//		|						И ВЫБОР
//		|							КОГДА ЗаказКлиентаТовары.Ссылка.НалогообложениеНДС В (ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортСырьевыхТоваровУслуг), ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортНесырьевыхТоваров))
//		|								ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНаЭкспорт)
//		|							ИНАЧЕ ЗаказКлиентаТовары.Ссылка.НалогообложениеНДС
//		|						КОНЕЦ = &НалогообложениеНДС
//		|						И ЗаказКлиентаТовары.Ссылка.ЦенаВключаетНДС = &ЦенаВключаетНДС
//		|						И ЗаказКлиентаТовары.Ссылка.ВернутьМногооборотнуюТару = &ВернутьМногооборотнуюТару
//		|						И ЗаказКлиентаТовары.Ссылка.ТребуетсяЗалогЗаТару = &ТребуетсяЗалогЗаТару
//		|						И ВЫБОР
//		|							КОГДА НЕ &ИспользоватьНаправленияДеятельности
//		|								ТОГДА ИСТИНА
//		|							ИНАЧЕ ЗаказКлиентаТовары.Ссылка.НаправлениеДеятельности = &НаправлениеДеятельности
//		|						КОНЕЦ
//		|			КОНЕЦ
//		|		И ЗаказКлиентаТовары.Номенклатура.ВариантОформленияПродажи В(&МассивВариантовОформления)
//		|		И (&НеОтбиратьПоОсобенностямУчета ИЛИ ЗаказКлиентаТовары.Номенклатура.ОсобенностьУчета В (&ОсобенностиУчетаНоменклатуры))
//		|		И НЕ ЗаказКлиентаТовары.Отменено
//		|		И НЕ ЗаказКлиентаТовары.Ссылка.ПометкаУдаления
//		|		И ВЫБОР
//		|				КОГДА ВЫРАЗИТЬ(&СкладРеализации КАК Справочник.Склады).ЭтоГруппа
//		|					ТОГДА ЗаказКлиентаТовары.Склад В ИЕРАРХИИ (&СкладРеализации)
//		|							ИЛИ ЗаказКлиентаТовары.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
//		|				ИНАЧЕ ЗаказКлиентаТовары.Склад В (ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка), &СкладРеализации)
//		|			КОНЕЦ
//		|		И ЗаказКлиентаТовары.Ссылка.ЭтоЗаказКакСчет
//		|		И ЗаказКлиентаТовары.Ссылка.ЭтоЗаказКакСчет = &ЭтоЗаказКакСчет
//		|	
//		|	ОБЪЕДИНИТЬ ВСЕ
//		|	
//		|	ВЫБРАТЬ
//		|		ЗаказКлиентаТовары.Ссылка,
//		|		ЗаказКлиентаТовары.Номенклатура,
//		|		ЗаказКлиентаТовары.Характеристика,
//		|		ЗаказКлиентаТовары.КодСтроки,
//		|		ЗаказКлиентаТовары.Ссылка.Склад,
//		|		ЗаказКлиентаТовары.Серия,
//		|		ЗаказКлиентаТовары.Количество,
//		|		ЗаказКлиентаТовары.СуммаСНДС
//		|	ИЗ
//		|		Документ.ЗаявкаНаВозвратТоваровОтКлиента.ЗаменяющиеТовары КАК ЗаказКлиентаТовары
//		|	ГДЕ
//		|		ВЫБОР
//		|				КОГДА &ОтобратьПоЗаказу
//		|					ТОГДА ЗаказКлиентаТовары.Ссылка В (&МассивЗаказов)
//		|				ИНАЧЕ ЗаказКлиентаТовары.Ссылка.Партнер = &Партнер
//		|						И ЗаказКлиентаТовары.Ссылка.Контрагент = &Контрагент
//		|						И ЗаказКлиентаТовары.Ссылка.Договор = &Договор
//		|						И ЗаказКлиентаТовары.Ссылка.Организация = &Организация
//		|						И ЗаказКлиентаТовары.Ссылка.ХозяйственнаяОперация В (&ХозяйственныеОперацииРаспоряжений)
//		|						И ВЫБОР
//		|							КОГДА НЕ &ИспользоватьСоглашенияСКлиентами
//		|								ТОГДА ИСТИНА
//		|							ИНАЧЕ ЗаказКлиентаТовары.Ссылка.Соглашение = &Соглашение
//		|						КОНЕЦ
//		|						И ЗаказКлиентаТовары.Ссылка.Сделка = &Сделка
//		|						И (ЗаказКлиентаТовары.Ссылка.Валюта = &ВалютаВзаиморасчетов
//		|							ИЛИ &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию))
//		|						И ВЫБОР
//		|							КОГДА ЗаказКлиентаТовары.Ссылка.НалогообложениеНДС В (ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортСырьевыхТоваровУслуг), ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортНесырьевыхТоваров))
//		|								ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНаЭкспорт)
//		|							ИНАЧЕ ЗаказКлиентаТовары.Ссылка.НалогообложениеНДС
//		|						КОНЕЦ = &НалогообложениеНДС
//		|						И ЗаказКлиентаТовары.Ссылка.ЦенаВключаетНДС = &ЦенаВключаетНДС
//		|						И ЗаказКлиентаТовары.Ссылка.ВернутьМногооборотнуюТару = &ВернутьМногооборотнуюТару
//		|						И ЗаказКлиентаТовары.Ссылка.ТребуетсяЗалогЗаТару = &ТребуетсяЗалогЗаТару
//		|						И ВЫБОР
//		|							КОГДА НЕ &ИспользоватьНаправленияДеятельности
//		|								ТОГДА ИСТИНА
//		|							ИНАЧЕ ЗаказКлиентаТовары.Ссылка.НаправлениеДеятельности = &НаправлениеДеятельности
//		|						КОНЕЦ
//		|			КОНЕЦ
//		|		И ЗаказКлиентаТовары.Номенклатура.ВариантОформленияПродажи В(&МассивВариантовОформления)
//		|		И (&НеОтбиратьПоОсобенностямУчета ИЛИ ЗаказКлиентаТовары.Номенклатура.ОсобенностьУчета В (&ОсобенностиУчетаНоменклатуры))
//		|		И НЕ ЗаказКлиентаТовары.Отменено
//		|		И НЕ ЗаказКлиентаТовары.Ссылка.ПометкаУдаления
//		|		И ЗаказКлиентаТовары.Ссылка.ЭтоЗаказКакСчет
//		|		И ЗаказКлиентаТовары.Ссылка.ЭтоЗаказКакСчет = &ЭтоЗаказКакСчет) КАК ТаблицаЗаказы
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	ТаблицаЗаказы.ЗаказКлиента,
//		|	ТаблицаЗаказы.Номенклатура,
//		|	ТаблицаЗаказы.Характеристика,
//		|	ТаблицаЗаказы.КодСтроки,
//		|	ТаблицаЗаказы.Склад,
//		|	ТаблицаЗаказы.Серия
//		|
//		|ИМЕЮЩИЕ
//		|	СУММА(ТаблицаЗаказы.КОформлению) > 0
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ТаблицаОстатки.ЗаказКлиента КАК ЗаказКлиента,
//		|	ЗаказТовары.Ссылка.ПорядокРасчетов КАК ПорядокРасчетов,
//		|	ТаблицаОстатки.Номенклатура КАК Номенклатура,
//		|	ЗаказТовары.НоменклатураПартнера КАК НоменклатураПартнера,
//		|	ТаблицаОстатки.Характеристика КАК Характеристика,
//		|	ТаблицаОстатки.КодСтроки КАК КодСтроки,
//		|	ТаблицаОстатки.Количество КАК Количество,
//		|	ТаблицаОстатки.Сумма КАК СуммаВзаиморасчетов,
//		|	ТаблицаОстатки.Склад КАК Склад,
//		|	ЕСТЬNULL(НакладнаяТовары.Количество, 0) КАК КоличествоВНакладной,
//		|	ЗаказТовары.НомерСтроки КАК НомерСтроки,
//		|	ЗаказТовары.Ссылка.Сделка КАК Сделка,
//		|	ЗаказТовары.ДатаОтгрузки КАК ДатаОтгрузки,
//		|	ЕСТЬNULL(НакладнаяТовары.Упаковка, ЗаказТовары.Упаковка) КАК Упаковка,
//		|	ЗаказТовары.Серия КАК Серия,
//		|	ЗаказТовары.ВидЦены КАК ВидЦены,
//		|	ЗаказТовары.Количество КАК КоличествоВЗаказе,
//		|	ЗаказТовары.Цена КАК Цена,
//		|	ЗаказТовары.СтавкаНДС КАК СтавкаНДС,
//		|	ВЫБОР КОГДА &НалогообложениеНДС В (ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНаЭкспорт),
//		|										ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортСырьевыхТоваровУслуг),
//		|										ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортНесырьевыхТоваров)) ТОГДА
//		|		ТаблицаОстатки.Номенклатура.КодТНВЭД
//		|	ИНАЧЕ
//		|		ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка)
//		|	КОНЕЦ КАК КодТНВЭД,
//		|	ЗаказТовары.Сумма КАК Сумма,
//		|	ЗаказТовары.СуммаНДС КАК СуммаНДС,
//		|	ЗаказТовары.СуммаСНДС КАК СуммаСНДС,
//		|	ЗаказТовары.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
//		|	ЗаказТовары.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
//		|	ЗаказТовары.ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки,
//		|	ЗаказТовары.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
//		|	ЗаказТовары.СуммаБонусныхБалловКСписанию КАК СуммаБонусныхБалловКСписанию,
//		|	ЗаказТовары.СуммаБонусныхБалловКСписаниюВВалюте КАК СуммаБонусныхБалловКСписаниюВВалюте,
//		|	ЗаказТовары.СуммаНачисленныхБонусныхБалловВВалюте КАК СуммаНачисленныхБонусныхБалловВВалюте,
//		|	ЗаказТовары.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
//		|	ЗаказТовары.НоменклатураНабора КАК НоменклатураНабора,
//		|	ЗаказТовары.ХарактеристикаНабора КАК ХарактеристикаНабора,
//		|	ЗаказТовары.Подразделение КАК Подразделение,
//		|	ЗаказТовары.КлючСвязи КАК КлючСвязи,
//		|	ВЫБОР
//		|		КОГДА ЕСТЬNULL(НакладнаяТовары.Упаковка, ЗаказТовары.Упаковка) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
//		|			ТОГДА 1
//		|		ИНАЧЕ ЕСТЬNULL(ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, &ТекстЗапросаКоэффициентУпаковки2), 1)
//		|	КОНЕЦ КАК Коэффициент,
//		|	ТаблицаОстатки.Количество / ЕСТЬNULL(ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, &ТекстЗапросаКоэффициентУпаковки2), 1) КАК КоличествоУпаковок,
//		|	ЗаказТовары.СрокПоставки КАК СрокПоставки,
//		|	ЗаказТовары.ВариантОбеспечения КАК ВариантОбеспечения,
//		|	ВЫБОР
//		|		КОГДА ЗаказТовары.Обособленно
//		|			ТОГДА ТаблицаОстатки.ЗаказКлиента.Назначение
//		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
//		|	КОНЕЦ КАК Назначение,
//		|	ВЫБОР
//		|		КОГДА ЗаказТовары.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке = ИСТИНА
//		|				И ЗаказТовары.Склад.ДатаНачалаОрдернойСхемыПриОтгрузке <= &ТекущаяДата
//		|			ТОГДА ИСТИНА
//		|		ИНАЧЕ ЛОЖЬ
//		|	КОНЕЦ КАК ОрдернаяСхемаПриОтгрузке,
//		|	ВЫБОР
//		|		КОГДА ЗаказТовары.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
//		|			ТОГДА ЛОЖЬ
//		|		ИНАЧЕ ВЫБОР
//		|				КОГДА ЗаказТовары.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке = ИСТИНА
//		|						И ЗаказТовары.Склад.ДатаНачалаОрдернойСхемыПриОтгрузке <= &ТекущаяДата
//		|					ТОГДА ИСТИНА
//		|				ИНАЧЕ ЛОЖЬ
//		|			КОНЕЦ
//		|	КОНЕЦ КАК ПроверятьОтгрузку,
//		|//++ Гурьев 18.09.23
//		|	ЗаказТовары.КАНАТ_КомментарийКЗаказу КАК КАНАТ_КомментарийКЗаказу
//		|//-- Гурьев 18.09.23
//		|ИЗ
//		|	ТаблицаОстатки КАК ТаблицаОстатки
//		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказТовары
//		|		ПО ТаблицаОстатки.Номенклатура = ЗаказТовары.Номенклатура
//		|			И ТаблицаОстатки.Характеристика = ЗаказТовары.Характеристика
//		|			И ТаблицаОстатки.КодСтроки = ЗаказТовары.КодСтроки
//		|			И ТаблицаОстатки.ЗаказКлиента = ЗаказТовары.Ссылка
//		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТоварыРеализацииПоЗаказу КАК НакладнаяТовары
//		|		ПО ТаблицаОстатки.Номенклатура = НакладнаяТовары.Номенклатура
//		|			И ТаблицаОстатки.Характеристика = НакладнаяТовары.Характеристика
//		|			И ТаблицаОстатки.КодСтроки = НакладнаяТовары.КодСтроки
//		|			И ТаблицаОстатки.ЗаказКлиента = НакладнаяТовары.ЗаказКлиента
//		|
//		|ОБЪЕДИНИТЬ ВСЕ
//		|
//		|ВЫБРАТЬ
//		|	ТаблицаОстатки.ЗаказКлиента,
//		|	ЗаказТовары.Ссылка.ПорядокРасчетов,
//		|	ТаблицаОстатки.Номенклатура,
//		|	ЗНАЧЕНИЕ(Справочник.НоменклатураКонтрагентов.ПустаяСсылка),
//		|	ТаблицаОстатки.Характеристика,
//		|	ТаблицаОстатки.КодСтроки,
//		|	ТаблицаОстатки.Количество,
//		|	ТаблицаОстатки.Сумма,
//		|	ТаблицаОстатки.Склад,
//		|	ЕСТЬNULL(НакладнаяТовары.Количество, 0),
//		|	ЗаказТовары.НомерСтроки,
//		|	ЗаказТовары.Ссылка.Сделка,
//		|	ЗаказТовары.ДатаОтгрузки,
//		|	ЕСТЬNULL(НакладнаяТовары.Упаковка, ЗаказТовары.Упаковка),
//		|	ЗаказТовары.Серия,
//		|	ЗаказТовары.ВидЦены,
//		|	ЗаказТовары.Количество,
//		|	ЗаказТовары.Цена,
//		|	ЗаказТовары.СтавкаНДС,
//		|	ВЫБОР КОГДА &НалогообложениеНДС В (ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНаЭкспорт),
//		|										ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортСырьевыхТоваровУслуг),
//		|										ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортНесырьевыхТоваров)) ТОГДА
//		|		ТаблицаОстатки.Номенклатура.КодТНВЭД
//		|	ИНАЧЕ
//		|		ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка)
//		|	КОНЕЦ КАК КодТНВЭД,
//		|	ЗаказТовары.Сумма,
//		|	ЗаказТовары.СуммаНДС,
//		|	ЗаказТовары.СуммаСНДС,
//		|	ЗаказТовары.ПроцентРучнойСкидки,
//		|	ЗаказТовары.СуммаРучнойСкидки,
//		|	ЗаказТовары.ПроцентАвтоматическойСкидки,
//		|	ЗаказТовары.СуммаАвтоматическойСкидки,
//		|	ЗаказТовары.СуммаБонусныхБалловКСписанию,
//		|	ЗаказТовары.СуммаБонусныхБалловКСписаниюВВалюте,
//		|	ЗаказТовары.СуммаНачисленныхБонусныхБалловВВалюте,
//		|	ЗаказТовары.Номенклатура.ТипНоменклатуры,
//		|	ЗаказТовары.НоменклатураНабора,
//		|	ЗаказТовары.ХарактеристикаНабора,
//		|	ЗаказТовары.Подразделение,
//		|	ЗаказТовары.КлючСвязи,
//		|	ВЫБОР
//		|		КОГДА ЕСТЬNULL(НакладнаяТовары.Упаковка, ЗаказТовары.Упаковка) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
//		|			ТОГДА 1
//		|		ИНАЧЕ ЕСТЬNULL(ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, &ТекстЗапросаКоэффициентУпаковки2), 1)
//		|	КОНЕЦ,
//		|	ТаблицаОстатки.Количество / ЕСТЬNULL(ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, &ТекстЗапросаКоэффициентУпаковки2), 1),
//		|	ЗаказТовары.СрокПоставки,
//		|	ЗаказТовары.ВариантОбеспечения,
//		|	ВЫБОР
//		|		КОГДА ЗаказТовары.Обособленно
//		|			ТОГДА ТаблицаОстатки.ЗаказКлиента.Назначение
//		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
//		|	КОНЕЦ,
//		|	ВЫБОР
//		|		КОГДА ЗаказТовары.Ссылка.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке = ИСТИНА
//		|				И ЗаказТовары.Ссылка.Склад.ДатаНачалаОрдернойСхемыПриОтгрузке <= &ТекущаяДата
//		|			ТОГДА ИСТИНА
//		|		ИНАЧЕ ЛОЖЬ
//		|	КОНЕЦ,
//		|	ВЫБОР
//		|		КОГДА ЗаказТовары.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
//		|			ТОГДА ЛОЖЬ
//		|		ИНАЧЕ ВЫБОР
//		|				КОГДА ЗаказТовары.Ссылка.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке = ИСТИНА
//		|						И ЗаказТовары.Ссылка.Склад.ДатаНачалаОрдернойСхемыПриОтгрузке <= &ТекущаяДата
//		|					ТОГДА ИСТИНА
//		|				ИНАЧЕ ЛОЖЬ
//		|			КОНЕЦ
//		|	КОНЕЦ,
//		|//++ Гурьев 18.09.23
//		|	"""" КАК КАНАТ_КомментарийКЗаказу
//		|//-- Гурьев 18.09.23
//		|ИЗ
//		|	ТаблицаОстатки КАК ТаблицаОстатки
//		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаВозвратТоваровОтКлиента.ЗаменяющиеТовары КАК ЗаказТовары
//		|		ПО ТаблицаОстатки.Номенклатура = ЗаказТовары.Номенклатура
//		|			И ТаблицаОстатки.Характеристика = ЗаказТовары.Характеристика
//		|			И ТаблицаОстатки.КодСтроки = ЗаказТовары.КодСтроки
//		|			И ТаблицаОстатки.ЗаказКлиента = ЗаказТовары.Ссылка
//		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТоварыРеализацииПоЗаказу КАК НакладнаяТовары
//		|		ПО ТаблицаОстатки.Номенклатура = НакладнаяТовары.Номенклатура
//		|			И ТаблицаОстатки.Характеристика = НакладнаяТовары.Характеристика
//		|			И ТаблицаОстатки.КодСтроки = НакладнаяТовары.КодСтроки
//		|			И ТаблицаОстатки.ЗаказКлиента = НакладнаяТовары.ЗаказКлиента
//		|
//		|ОБЪЕДИНИТЬ ВСЕ
//		|
//		|ВЫБРАТЬ
//		|	ТоварыРеализации.ЗаказКлиента,
//		|	ТоварыРеализации.ПорядокРасчетов,
//		|	ТоварыРеализации.Номенклатура,
//		|	ЗНАЧЕНИЕ(Справочник.НоменклатураКонтрагентов.ПустаяСсылка),		
//		|	ТоварыРеализации.Характеристика,
//		|	ТоварыРеализации.КодСтроки,
//		|	ТоварыРеализации.Количество,
//		|	ТоварыРеализации.Сумма,
//		|	ТоварыРеализации.Склад,
//		|	ТоварыРеализации.Количество,
//		|	ТоварыРеализации.НомерСтроки,
//		|	НЕОПРЕДЕЛЕНО,
//		|	НЕОПРЕДЕЛЕНО,
//		|	ТоварыРеализации.Упаковка,
//		|	ТоварыРеализации.Серия,
//		|	ТоварыРеализации.ВидЦены,
//		|	0,
//		|	ТоварыРеализации.Цена,
//		|	ТоварыРеализации.СтавкаНДС,
//		|	ВЫБОР КОГДА &НалогообложениеНДС В (ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНаЭкспорт),
//		|										ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортСырьевыхТоваровУслуг),
//		|										ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортНесырьевыхТоваров)) ТОГДА
//		|		ТоварыРеализации.Номенклатура.КодТНВЭД
//		|	ИНАЧЕ
//		|		ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка)
//		|	КОНЕЦ КАК КодТНВЭД,
//		|	ТоварыРеализации.Сумма,
//		|	ТоварыРеализации.СуммаНДС,
//		|	ТоварыРеализации.СуммаСНДС,
//		|	ТоварыРеализации.ПроцентРучнойСкидки,
//		|	ТоварыРеализации.СуммаРучнойСкидки,
//		|	ТоварыРеализации.ПроцентАвтоматическойСкидки,
//		|	ТоварыРеализации.СуммаАвтоматическойСкидки,
//		|	ТоварыРеализации.СуммаБонусныхБалловКСписанию,
//		|	ТоварыРеализации.СуммаБонусныхБалловКСписаниюВВалюте,
//		|	ТоварыРеализации.СуммаНачисленныхБонусныхБалловВВалюте,
//		|	ТоварыРеализации.Номенклатура.ТипНоменклатуры,
//		|	ТоварыРеализации.НоменклатураНабора,
//		|	ТоварыРеализации.ХарактеристикаНабора,
//		|	ТоварыРеализации.Подразделение,
//		|	ТоварыРеализации.КлючСвязи,
//		|	ВЫБОР
//		|		КОГДА ТоварыРеализации.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
//		|			ТОГДА 1
//		|		ИНАЧЕ ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки3, 1)
//		|	КОНЕЦ,
//		|	ТоварыРеализации.Количество / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки3, 1),
//		|	НЕОПРЕДЕЛЕНО,
//		|	НЕОПРЕДЕЛЕНО,
//		|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка),
//		|	ВЫБОР
//		|		КОГДА ТоварыРеализации.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке = ИСТИНА
//		|				И ТоварыРеализации.Склад.ДатаНачалаОрдернойСхемыПриОтгрузке <= &ТекущаяДата
//		|			ТОГДА ИСТИНА
//		|		ИНАЧЕ ЛОЖЬ
//		|	КОНЕЦ,
//		|	ВЫБОР
//		|		КОГДА ТоварыРеализации.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
//		|			ТОГДА ЛОЖЬ
//		|		ИНАЧЕ ВЫБОР
//		|				КОГДА ТоварыРеализации.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке = ИСТИНА
//		|						И ТоварыРеализации.Склад.ДатаНачалаОрдернойСхемыПриОтгрузке <= &ТекущаяДата
//		|					ТОГДА ИСТИНА
//		|				ИНАЧЕ ЛОЖЬ
//		|			КОНЕЦ
//		|	КОНЕЦ,
//		|//++ Гурьев 18.09.23
//		|	"""" КАК КАНАТ_КомментарийКЗаказу
//		|//-- Гурьев 18.09.23
//		|ИЗ
//		|	ВтТоварыРеализацииБезЗаказа КАК ТоварыРеализации
//		|
//		|УПОРЯДОЧИТЬ ПО
//		|	ТаблицаОстатки.ЗаказКлиента,
//		|	ЗаказТовары.НомерСтроки
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ ПЕРВЫЕ 1
//		|	ЗаказКлиентаТовары.НомерСтроки КАК НомерСтроки,
//		|	ЗаказКлиентаТовары.Ссылка Как ЗаказКлиента,
//		|	ЗаказКлиентаТовары.Ссылка.ПорядокРасчетов Как ПорядокРасчетов
//		|ИЗ
//		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
//		|ГДЕ
//		|	ЗаказКлиентаТовары.Ссылка В(&МассивЗаказов)
//		|	И ЗаказКлиентаТовары.Номенклатура.ВариантОформленияПродажи В(&МассивВариантовОформления)
//		|	И ЗаказКлиентаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
//		|	И НЕ ЗаказКлиентаТовары.Отменено
//		|	И ЗаказКлиентаТовары.Ссылка.Проведен
//		|
//		|ОБЪЕДИНИТЬ ВСЕ
//		|
//		|ВЫБРАТЬ ПЕРВЫЕ 1
//		|	ЗаказКлиентаТовары.НомерСтроки,
//		|	ЗаказКлиентаТовары.Ссылка Как ЗаказКлиента,
//		|	ЗаказКлиентаТовары.Ссылка.ПорядокРасчетов Как ПорядокРасчетов
//		|ИЗ
//		|	Документ.ЗаявкаНаВозвратТоваровОтКлиента.ЗаменяющиеТовары КАК ЗаказКлиентаТовары
//		|ГДЕ
//		|	ЗаказКлиентаТовары.Ссылка В(&МассивЗаказов)
//		|	И ЗаказКлиентаТовары.Номенклатура.ВариантОформленияПродажи В(&МассивВариантовОформления)
//		|	И ЗаказКлиентаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
//		|	И НЕ ЗаказКлиентаТовары.Отменено
//		|	И ЗаказКлиентаТовары.Ссылка.Проведен
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ЗаказКлиента.Ссылка КАК Ссылка
//		|ПОМЕСТИТЬ ДокументыОтгрузки
//		|ИЗ
//		|	Документ.ЗаказКлиента КАК ЗаказКлиента
//		|ГДЕ
//		|	ВЫБОР
//		|		КОГДА &ОтобратьПоЗаказу
//		|			ТОГДА ЗаказКлиента.Ссылка В (&МассивЗаказов)
//		|					ИЛИ ЗаказКлиента.Ссылка = &Регистратор
//		|		ИНАЧЕ
//		|			ЗаказКлиента.Партнер = &Партнер
//		|			И ЗаказКлиента.Контрагент = &Контрагент
//		|			И ЗаказКлиента.Договор = &Договор
//		|			И ЗаказКлиента.Организация = &Организация
//		|			И ЗаказКлиента.ХозяйственнаяОперация В (&ХозяйственныеОперацииРаспоряжений)
//		|			И (НЕ &ИспользоватьСоглашенияСКлиентами ИЛИ ЗаказКлиента.Соглашение = &Соглашение)
//		|			И ЗаказКлиента.Сделка = &Сделка
//		|			И (&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию) ИЛИ ЗаказКлиента.Валюта = &ВалютаВзаиморасчетов)
//		|			И ВЫБОР
//		|				КОГДА ЗаказКлиента.НалогообложениеНДС В (ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортСырьевыхТоваровУслуг), ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортНесырьевыхТоваров))
//		|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНаЭкспорт)
//		|				ИНАЧЕ ЗаказКлиента.НалогообложениеНДС
//		|			КОНЕЦ = &НалогообложениеНДС
//		|			И ЗаказКлиента.ЦенаВключаетНДС = &ЦенаВключаетНДС
//		|			И ЗаказКлиента.ВернутьМногооборотнуюТару = &ВернутьМногооборотнуюТару
//		|			И (НЕ &ИспользоватьНаправленияДеятельности ИЛИ ЗаказКлиента.НаправлениеДеятельности = &НаправлениеДеятельности)
//		|	КОНЕЦ
//		|	И ВЫБОР
//		|		КОГДА ВЫРАЗИТЬ(&СкладРеализации КАК Справочник.Склады).ЭтоГруппа
//		|			ТОГДА Склад В ИЕРАРХИИ (&СкладРеализации)
//		|				ИЛИ Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
//		|		ИНАЧЕ Склад В (ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка), &СкладРеализации)
//		|				ИЛИ ВЫРАЗИТЬ(ЗаказКлиента.Склад КАК Справочник.Склады).ЭтоГруппа
//		|	КОНЕЦ
//		|
//		|ОБЪЕДИНИТЬ ВСЕ
//		|
//		|ВЫБРАТЬ
//		|	ЗаявкаНаВозвратТоваровОтКлиента.Ссылка
//		|ИЗ
//		|	Документ.ЗаявкаНаВозвратТоваровОтКлиента КАК ЗаявкаНаВозвратТоваровОтКлиента
//		|ГДЕ
//		|	ВЫБОР
//		|		КОГДА &ОтобратьПоЗаказу
//		|			ТОГДА ЗаявкаНаВозвратТоваровОтКлиента.Ссылка В (&МассивЗаказов)
//		|					ИЛИ ЗаявкаНаВозвратТоваровОтКлиента.Ссылка = &Регистратор
//		|		ИНАЧЕ
//		|			ЗаявкаНаВозвратТоваровОтКлиента.Партнер = &Партнер
//		|			И ЗаявкаНаВозвратТоваровОтКлиента.Контрагент = &Контрагент
//		|			И ЗаявкаНаВозвратТоваровОтКлиента.Договор = &Договор
//		|			И ЗаявкаНаВозвратТоваровОтКлиента.Организация = &Организация
//		|			И ЗаявкаНаВозвратТоваровОтКлиента.ХозяйственнаяОперация В (&ХозяйственныеОперацииРаспоряжений)
//		|			И (НЕ &ИспользоватьСоглашенияСКлиентами ИЛИ ЗаявкаНаВозвратТоваровОтКлиента.Соглашение = &Соглашение)
//		|			И ЗаявкаНаВозвратТоваровОтКлиента.Сделка = &Сделка
//		|			И (&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию) ИЛИ ЗаявкаНаВозвратТоваровОтКлиента.Валюта = &ВалютаВзаиморасчетов)
//		|			И ЗаявкаНаВозвратТоваровОтКлиента.НалогообложениеНДС = &НалогообложениеНДС
//		|			И ЗаявкаНаВозвратТоваровОтКлиента.ЦенаВключаетНДС = &ЦенаВключаетНДС
//		|			И ЗаявкаНаВозвратТоваровОтКлиента.ВернутьМногооборотнуюТару = &ВернутьМногооборотнуюТару
//		|			И (НЕ &ИспользоватьНаправленияДеятельности ИЛИ ЗаявкаНаВозвратТоваровОтКлиента.НаправлениеДеятельности = &НаправлениеДеятельности)
//		|	КОНЕЦ
//		|	И ВЫБОР
//		|		КОГДА ВЫРАЗИТЬ(&СкладРеализации КАК Справочник.Склады).ЭтоГруппа
//		|			ТОГДА Склад В ИЕРАРХИИ (&СкладРеализации)
//		|					ИЛИ Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
//		|		ИНАЧЕ Склад В (ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка), &СкладРеализации)
//		|	КОНЕЦ
//		|
//		|ОБЪЕДИНИТЬ ВСЕ
//		|
//		|ВЫБРАТЬ
//		|	РеализацияТоваровУслуг.Ссылка
//		|ИЗ
//		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
//		|ГДЕ
//		|	ВЫБОР
//		|		КОГДА &ОтобратьПоЗаказу
//		|			ТОГДА РеализацияТоваровУслуг.Ссылка В (&МассивЗаказов)
//		|					ИЛИ РеализацияТоваровУслуг.Ссылка = &Регистратор
//		|		ИНАЧЕ
//		|			РеализацияТоваровУслуг.Партнер = &Партнер
//		|			И РеализацияТоваровУслуг.Контрагент = &Контрагент
//		|			И РеализацияТоваровУслуг.Договор = &Договор
//		|			И РеализацияТоваровУслуг.Организация = &Организация
//		|			И РеализацияТоваровУслуг.ХозяйственнаяОперация В (&ХозяйственныеОперацииРаспоряжений)
//		|			И (НЕ &ИспользоватьСоглашенияСКлиентами ИЛИ РеализацияТоваровУслуг.Соглашение = &Соглашение)
//		|			И РеализацияТоваровУслуг.Сделка = &Сделка
//		|			И (&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию) ИЛИ РеализацияТоваровУслуг.Валюта = &ВалютаВзаиморасчетов)
//		|			И РеализацияТоваровУслуг.НалогообложениеНДС = &НалогообложениеНДС
//		|			И РеализацияТоваровУслуг.ЦенаВключаетНДС = &ЦенаВключаетНДС
//		|			И РеализацияТоваровУслуг.ВернутьМногооборотнуюТару = &ВернутьМногооборотнуюТару
//		|			И (НЕ &ИспользоватьНаправленияДеятельности ИЛИ РеализацияТоваровУслуг.НаправлениеДеятельности = &НаправлениеДеятельности)
//		|	КОНЕЦ
//		|	И РеализацияТоваровУслуг.Ссылка = &Регистратор
//		|	И ВЫБОР
//		|		КОГДА ВЫРАЗИТЬ(&СкладРеализации КАК Справочник.Склады).ЭтоГруппа
//		|			ТОГДА Склад В ИЕРАРХИИ (&СкладРеализации)
//		|					ИЛИ Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
//		|		ИНАЧЕ Склад В (ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка), &СкладРеализации)
//		|	КОНЕЦ
//		|ИНДЕКСИРОВАТЬ ПО
//		|	Ссылка
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	Номенклатура.Ссылка КАК Ссылка
//		|ПОМЕСТИТЬ НоменклатураСВариантомОформления
//		|ИЗ
//		|	Справочник.Номенклатура КАК Номенклатура
//		|ГДЕ
//		|	Номенклатура.ВариантОформленияПродажи В (&МассивВариантовОформления)
//		|	И (&НеОтбиратьПоОсобенностямУчета ИЛИ Номенклатура.ОсобенностьУчета В (&ОсобенностиУчетаНоменклатуры))
//		|ИНДЕКСИРОВАТЬ ПО
//		|	Номенклатура.Ссылка
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ЗаказКлиента.Ссылка
//		|ПОМЕСТИТЬ ЗаказКлиента
//		|ИЗ
//		|	Документ.ЗаказКлиента КАК ЗаказКлиента
//		|ГДЕ
//		|	ВЫБОР
//		|		КОГДА &ОтобратьПоЗаказу
//		|			ТОГДА ЗаказКлиента.Ссылка В (&МассивЗаказов)
//		|		ИНАЧЕ ЗаказКлиента.Партнер = &Партнер
//		|			И ЗаказКлиента.Контрагент = &Контрагент
//		|			И ЗаказКлиента.Договор = &Договор
//		|			И ЗаказКлиента.Организация = &Организация
//		|			И ЗаказКлиента.ХозяйственнаяОперация В (&ХозяйственныеОперацииРаспоряжений)
//		|			И ВЫБОР
//		|				КОГДА НЕ &ИспользоватьСоглашенияСКлиентами
//		|					ТОГДА ИСТИНА
//		|				ИНАЧЕ ЗаказКлиента.Соглашение = &Соглашение
//		|			КОНЕЦ
//		|			И ЗаказКлиента.Сделка = &Сделка
//		|			И (ЗаказКлиента.Валюта = &ВалютаВзаиморасчетов
//		|				ИЛИ &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию))
//		|			И ВЫБОР
//		|				КОГДА ЗаказКлиента.НалогообложениеНДС В (ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортСырьевыхТоваровУслуг), ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортНесырьевыхТоваров))
//		|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНаЭкспорт)
//		|				ИНАЧЕ ЗаказКлиента.НалогообложениеНДС
//		|			КОНЕЦ = &НалогообложениеНДС
//		|			И ЗаказКлиента.ЦенаВключаетНДС = &ЦенаВключаетНДС
//		|			И ЗаказКлиента.ВернутьМногооборотнуюТару = &ВернутьМногооборотнуюТару
//		|			И ЗаказКлиента.ТребуетсяЗалогЗаТару = &ТребуетсяЗалогЗаТару
//		|			И ВЫБОР
//		|			КОГДА НЕ &ИспользоватьНаправленияДеятельности
//		|					ТОГДА ИСТИНА
//		|				ИНАЧЕ ЗаказКлиента.НаправлениеДеятельности = &НаправлениеДеятельности
//		|			КОНЕЦ
//		|	КОНЕЦ
//		|	И ЗаказКлиента.ЭтоЗаказКакСчет = &ЭтоЗаказКакСчет
//		|	И ВЫБОР
//		|		КОГДА ВЫРАЗИТЬ(&СкладРеализации КАК Справочник.Склады).ЭтоГруппа
//		|			ТОГДА Склад В ИЕРАРХИИ (&СкладРеализации)
//		|					ИЛИ Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
//		|		ИНАЧЕ Склад В (ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка), &СкладРеализации)
//		|	КОНЕЦ
//		|ИНДЕКСИРОВАТЬ ПО
//		|	Ссылка
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ТаблицаЗаказы.ЗаказКлиента КАК ЗаказКлиента,
//		|	ТаблицаЗаказы.Номенклатура КАК Номенклатура,
//		|	ТаблицаЗаказы.Характеристика КАК Характеристика,
//		|	ТаблицаЗаказы.Склад КАК Склад,
//		|	ТаблицаЗаказы.ОрдернаяСхемаПриОтгрузке КАК ОрдернаяСхемаПриОтгрузке,
//		|	ТаблицаЗаказы.Серия КАК Серия,
//		|	ТаблицаЗаказы.Назначение,
//		|	СУММА(ТаблицаЗаказы.КоличествоСобирается) КАК КоличествоСобирается,
//		|	СУММА(ТаблицаЗаказы.Количество) КАК Количество
//		|ИЗ
//		|	(ВЫБРАТЬ
//		|		ТоварыКОтгрузкеОстатки.ДокументОтгрузки КАК ЗаказКлиента,
//		|		ТоварыКОтгрузкеОстатки.Номенклатура КАК Номенклатура,
//		|		ТоварыКОтгрузкеОстатки.Характеристика КАК Характеристика,
//		|		ТоварыКОтгрузкеОстатки.Склад КАК Склад,
//		|		ВЫБОР
//		|			КОГДА ТоварыКОтгрузкеОстатки.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке = ИСТИНА
//		|					И ТоварыКОтгрузкеОстатки.Склад.ДатаНачалаОрдернойСхемыПриОтгрузке <= &ТекущаяДата
//		|				ТОГДА ИСТИНА
//		|			ИНАЧЕ ЛОЖЬ
//		|		КОНЕЦ КАК ОрдернаяСхемаПриОтгрузке,
//		|		ТоварыКОтгрузкеОстатки.Серия КАК Серия,
//		|		ТоварыКОтгрузкеОстатки.Назначение КАК Назначение,
//		|		ТоварыКОтгрузкеОстатки.СобираетсяПриход КАК КоличествоСобирается,
//		|		ТоварыКОтгрузкеОстатки.КОтгрузкеРасход + ТоварыКОтгрузкеОстатки.СобраноПриход КАК Количество
//		|	ИЗ
//		|		РегистрНакопления.ТоварыКОтгрузке.ОстаткиИОбороты(
//		|				,
//		|				,
//		|				,
//		|				,
//		|				ДокументОтгрузки В (
//		|					ВЫБРАТЬ
//		|						ДокументыОтгрузки.Ссылка
//		|					ИЗ
//		|						ДокументыОтгрузки)
//		|				И Номенклатура В (
//		|					ВЫБРАТЬ
//		|						НоменклатураСВариантомОформления.Ссылка
//		|					ИЗ
//		|						НоменклатураСВариантомОформления)) КАК ТоварыКОтгрузкеОстатки
//		|	
//		|	ОБЪЕДИНИТЬ ВСЕ
//		|	
//		|	ВЫБРАТЬ
//		|		ЗаказыОстатки.ЗаказКлиента,
//		|		ЗаказыОстатки.Номенклатура,
//		|		ЗаказыОстатки.Характеристика,
//		|		ЗаказыОстатки.Склад,
//		|		ВЫБОР
//		|			КОГДА ЗаказыОстатки.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке = ИСТИНА
//		|					И ЗаказыОстатки.Склад.ДатаНачалаОрдернойСхемыПриОтгрузке <= &ТекущаяДата
//		|				ТОГДА ИСТИНА
//		|			ИНАЧЕ ЛОЖЬ
//		|		КОНЕЦ,
//		|		ЗаказыОстатки.Серия,
//		|		ВЫБОР
//		|			КОГДА ЗаказТовары.Обособленно ТОГДА
//		|					 ЗаказТовары.Ссылка.Назначение
//		|			КОГДА ЗаказТоварыЗамена.Обособленно ТОГДА
//		|					ЗаказТоварыЗамена.Ссылка.Назначение
//		|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
//		|		КОНЕЦ КАК Назначение,
//		|		0,
//		|		-ЗаказыОстатки.КОформлениюРасход
//		|	ИЗ
//		|		РегистрНакопления.УдалитьЗаказыКлиентов.Обороты(
//		|				,
//		|				,
//		|				РЕГИСТРАТОР,
//		|				ЗаказКлиента В (
//		|					ВЫБРАТЬ
//		|						ЗаказКлиента.Ссылка
//		|					ИЗ
//		|						ЗаказКлиента)
//		|				И Номенклатура В (
//		|					ВЫБРАТЬ
//		|						НоменклатураСВариантомОформления.Ссылка
//		|					ИЗ
//		|						НоменклатураСВариантомОформления)) КАК ЗаказыОстатки
//		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказТовары
//		|		ПО ЗаказыОстатки.Номенклатура = ЗаказТовары.Номенклатура
//		|			И ЗаказыОстатки.Характеристика = ЗаказТовары.Характеристика
//		|			И ЗаказыОстатки.КодСтроки = ЗаказТовары.КодСтроки
//		|			И ЗаказыОстатки.ЗаказКлиента = ЗаказТовары.Ссылка
//		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаВозвратТоваровОтКлиента.ЗаменяющиеТовары КАК ЗаказТоварыЗамена
//		|		ПО ЗаказыОстатки.Номенклатура = ЗаказТоварыЗамена.Номенклатура
//		|			И ЗаказыОстатки.Характеристика = ЗаказТоварыЗамена.Характеристика
//		|			И ЗаказыОстатки.КодСтроки = ЗаказТоварыЗамена.КодСтроки
//		|			И ЗаказыОстатки.ЗаказКлиента = ЗаказТоварыЗамена.Ссылка
//		|
//		|	ГДЕ
//		|		ЗаказыОстатки.Регистратор <> &Регистратор) КАК ТаблицаЗаказы
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	ТаблицаЗаказы.ЗаказКлиента,
//		|	ТаблицаЗаказы.Номенклатура,
//		|	ТаблицаЗаказы.Характеристика,
//		|	ТаблицаЗаказы.Склад,
//		|	ТаблицаЗаказы.ОрдернаяСхемаПриОтгрузке,
//		|	ТаблицаЗаказы.Серия,
//		|	ТаблицаЗаказы.Назначение
//		|
//		|ИМЕЮЩИЕ
//		|	(СУММА(ТаблицаЗаказы.Количество) > 0
//		|		ИЛИ СУММА(ТаблицаЗаказы.КоличествоСобирается) > 0)";
//	
//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаКоэффициентУпаковки1",
//		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
//			"НакладнаяТовары.Упаковка",
//			"НакладнаяТовары.Номенклатура"));
//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаКоэффициентУпаковки2",
//		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
//			"ЗаказТовары.Упаковка",
//			"ЗаказТовары.Номенклатура"));
//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаКоэффициентУпаковки3",
//		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
//			"ТоварыРеализации.Упаковка",
//			"ТоварыРеализации.Номенклатура"));
//	
//	УстановитьПривилегированныйРежим(Истина);
//	Возврат Запрос.ВыполнитьПакет();
//КонецФункции

&После("ДобавитьКомандыСозданияНаОсновании")
Процедура КАНАТ_ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры)
	//++ Гурьев 17.11.23 ЧТЗ_2.10 Ввод на основании пропуска на выезд
	Документы.КАНАТ_ПропускНаВыезд.ДобавитьКомандуСоздатьПропускНаВыезд(КомандыСозданияНаОсновании);
	//-- Гурьев 17.11.23
КонецПроцедуры


