
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Номенклатура.ТекстЗапроса = " ВЫБРАТЬ
|	СправочникНоменклатура.Ссылка КАК Ссылка,
|	СправочникНоменклатура.ПометкаУдаления КАК ПометкаУдаления,
|	СправочникНоменклатура.Код КАК Код,
|	СправочникНоменклатура.Наименование КАК Наименование,
|	СправочникНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
|	СправочникНоменклатура.КАНАТ_НТДНоменклатуры КАК КАНАТ_НТДНоменклатуры,
|	СправочникНоменклатура.НаименованиеПолное КАК НаименованиеПолное,
|	СправочникНоменклатура.КАНАТКач_ВидДляКонтроляКачества КАК КАНАТКач_ВидДляКонтроляКачества,
|	СправочникНоменклатура.Артикул КАК Артикул,
|	СправочникНоменклатура.ТипНоменклатуры КАК ТипНоменклатуры,
|	СправочникНоменклатура.КАНАТ_ТекстДублиАртикулов КАК КАНАТ_ТекстДублиАртикулов,
|	СправочникНоменклатура.КАНАТ_НеГенерироватьАртикул КАК КАНАТ_НеГенерироватьАртикул,
|
|	СправочникНоменклатура.Предопределенный КАК Предопределенный,
|	СправочникНоменклатура.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных, 
|	ВсеОстатки.ВНаличии как ВНаличии,
|	ВсеОстатки.Свободно как Свободно
|ИЗ
|	Справочник.Номенклатура КАК СправочникНоменклатура
|	
|	ЛЕВОЕ СОЕДИНЕНИЕ(
|		ВЫБРАТЬ
|			РаспределениеЗапасов.Номенклатура    КАК Номенклатура,
|			СУММА(РаспределениеЗапасов.ВНаличии) КАК ВНаличии,
|			СУММА(РаспределениеЗапасов.Запас)    КАК Запас,
|			СУММА(РаспределениеЗапасов.Свободно) КАК Свободно
|		ИЗ
|			РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
|		ГДЕ
|			РаспределениеЗапасов.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
|			И РаспределениеЗапасов.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
|			И РаспределениеЗапасов.Склад В(&Склад)
|		СГРУППИРОВАТЬ ПО
|			РаспределениеЗапасов.Номенклатура
|	) КАК ВсеОстатки
|	ПО 
|		(ВсеОстатки.Номенклатура = СправочникНоменклатура.Ссылка)
|
|ГДЕ
|	СправочникНоменклатура.ГруппаФинансовогоУчета В (&ГруппаФинУчета)";
	Номенклатура.Параметры.УстановитьЗначениеПараметра("ГруппаФинУчета",Параметры.ГруппаФинУчета);
	Номенклатура.Параметры.УстановитьЗначениеПараметра("Склад",Параметры.Склад);
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОповеститьОВыборе(ВыбраннаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТолькоВНаличииПриИзменении(Элемент)  
	Номенклатура.Отбор.Элементы.Очистить();
	Если ТолькоВНаличии Тогда
	ЭлементОтбора = Номенклатура.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВНаличии");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
	ЭлементОтбора.ПравоеЗначение = 0;
	                         КонецЕсли;
КонецПроцедуры


//ОбновитьЗапросНаСервере
//	СхемаЗапроса = Новый СхемаЗапроса;
//	СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);  
//	
//	Если ЗначениеЗаполнено(Подразделение) тогда
//		СхемаЗапроса.ПакетЗапросов[2].Операторы[0].Отбор.Добавить("(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.Подразделение = &Подразделение)");
//		Запрос.УстановитьПараметр("Подразделение", Подразделение);
//	КонецЕсли;
//	Если ЗначениеЗаполнено(СтатусЭтапа) тогда
//		СхемаЗапроса.ПакетЗапросов[2].Операторы[0].Отбор.Добавить("(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.Статус В(&Статусы))");
//		Запрос.УстановитьПараметр("Статусы", СтатусЭтапа);
//	КонецЕсли;
//	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
