
&НаСервере
Процедура КАНАТ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//БИТ_Гурьев__22.03.24++
	Список.ТекстЗапроса = "
		|ВЫБРАТЬ
		|СправочникКонтактныеЛицаПартнеров.Ссылка,
		|СправочникКонтактныеЛицаПартнеров.ПометкаУдаления,
		|СправочникКонтактныеЛицаПартнеров.Предопределенный,
		|СправочникКонтактныеЛицаПартнеров.Владелец,
		|СправочникКонтактныеЛицаПартнеров.Наименование,
		|СправочникКонтактныеЛицаПартнеров.ДолжностьПоВизитке,
		|СправочникКонтактныеЛицаПартнеров.ДатаРегистрацииСвязи,
		|СправочникКонтактныеЛицаПартнеров.ДатаПрекращенияСвязи,
		|СправочникКонтактныеЛицаПартнеров.Автор,
		|СправочникКонтактныеЛицаПартнеров.Комментарий,
		|СправочникКонтактныеЛицаПартнеров.Представление,
		|КонтактныеЛицаПартнеровРолиКонтактногоЛица.РольКонтактногоЛица,
		|СправочникКонтактныеЛицаПартнеров.Пол,
		|СправочникКонтактныеЛицаПартнеров.ДатаРождения,
		|СправочникКонтактныеЛицаПартнеров.КАНАТ_Подписант
	|ИЗ
		|Справочник.КонтактныеЛицаПартнеров КАК СправочникКонтактныеЛицаПартнеров
		|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров.РолиКонтактногоЛица КАК КонтактныеЛицаПартнеровРолиКонтактногоЛица
		|ПО СправочникКонтактныеЛицаПартнеров.Ссылка = КонтактныеЛицаПартнеровРолиКонтактногоЛица.Ссылка
		|	И КонтактныеЛицаПартнеровРолиКонтактногоЛица.НомерСтроки = 1";
	
	
	ЭлементПодписант = Элементы.Добавить("КАНАТ_Подписант", Тип("ПолеФормы"), Элементы.Список);
	ЭлементПодписант.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементПодписант.Заголовок = "Подписант";
	ЭлементПодписант.ПутьКДанным = "Список.КАНАТ_Подписант";
	//БИТ_Гурьев__22.03.24--
КонецПроцедуры
