
&ИзменениеИКонтроль("ПриЧтенииСозданииФормыСУпаковочнымиЛистами")
Процедура КАНАТ_ПриЧтенииСозданииФормыСУпаковочнымиЛистами(Форма, ТЧТовары, ЗаголовокНачальногоУровня, РежимПросмотраПоТоварам, УпаковочныйЛистРодитель)

	Форма.ИспользоватьУпаковочныеЛисты = ПолучитьФункциональнуюОпцию("ИспользоватьУпаковочныеЛисты");
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ЕстьМаркируемаяПродукция") Тогда
		Форма.ИспользоватьУпаковочныеЛисты = Форма.ИспользоватьУпаковочныеЛисты И Не Форма.ЕстьМаркируемаяПродукция;
	КонецЕсли;

	ИмяТЧТовары = ПараметрыУказанияСерий(Форма).ИмяТЧТовары;
	ИменаЭлементовФормы = ИменаЭлементовФормы(ИмяТЧТовары);
	
	#Удаление
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(
	Форма.Элементы,
	"ДекорацияНавигацияОтступ, ДекорацияМест",
	"Видимость",
	Форма.ИспользоватьУпаковочныеЛисты);
	#КонецУдаления
	#Вставка
	Если Форма.ИмяФормы <> "Документ.РасходныйОрдерНаТовары.Форма.ФормаДокумента" Тогда
		ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(
		Форма.Элементы,
		"ДекорацияНавигацияОтступ, ДекорацияМест",
		"Видимость",
		Форма.ИспользоватьУпаковочныеЛисты);
	Иначе
		ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(
		Форма.Элементы,
		"ДекорацияНавигацияОтступ",
		"Видимость",
		Форма.ИспользоватьУпаковочныеЛисты);
	КонецЕсли;
	#КонецВставки
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(
	Форма.Элементы,
	ИменаЭлементовФормы.НомерСтроки,
	"Видимость",
	Не Форма.ИспользоватьУпаковочныеЛисты);

	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(
	Форма.Элементы,
	ИменаЭлементовФормы.ГруппаНоменклатураУпаковочныйЛист,
	"ОтображатьВШапке",
	Форма.ИспользоватьУпаковочныеЛисты);

	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(
	Форма.Элементы,
	ИменаЭлементовФормы.Номенклатура,
	"ОтображатьВШапке",
	Не Форма.ИспользоватьУпаковочныеЛисты);

	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(
	Форма.Элементы,
	"ГруппаСканирование",
	"Видимость",
	Форма.ИспользоватьПодключаемоеОборудование
	И ПараметрыУказанияСерий(Форма).ИспользоватьСерииНоменклатуры);

	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(
	Форма.Элементы,
	ИменаЭлементовФормы.НаУровеньВверх,
	"Доступность",
	Ложь);
	Если УпаковочныйЛистРодитель = Неопределено Тогда
		Форма.УпаковочныйЛистРодитель = Документы.УпаковочныйЛист.ПустаяСсылка();
	Иначе
		Форма.УпаковочныйЛистРодитель = УпаковочныйЛистРодитель;
	КонецЕсли;

	ВсегоМест = 0;
	НайденныеСтроки = ТЧТовары.НайтиСтроки(Новый Структура("УпаковочныйЛистРодитель", Документы.УпаковочныйЛист.ПустаяСсылка()));
	Если НайденныеСтроки.Количество() > 0 Тогда
		Для Каждого Стр Из НайденныеСтроки Цикл
			ВсегоМест = ВсегоМест + Стр.КоличествоУпаковок;
		КонецЦикла;
		Если Форма.Объект.ВсегоМест <> ВсегоМест Тогда
			Форма.Объект.ВсегоМест = ВсегоМест;
			Форма.Модифицированность = Ложь
		КонецЕсли;
	КонецЕсли;

	РежимПросмотраПриИзменении(Форма, ТЧТовары, ЗаголовокНачальногоУровня, РежимПросмотраПоТоварам);

КонецПроцедуры
