
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИзменитьДоступностьЭлементов();
	
КонецПроцедуры


&НаСервере
Процедура ИзменитьДоступностьЭлементов()
	
	Если ИспользоватьГосконтракт Тогда
		Элементы.Госконтракт.Доступность = Истина;
	Иначе
		Госконтракт = Перечисления.ТипыНаправленийДеятельности.ПустаяСсылка();
		Элементы.Госконтракт.Доступность = Ложь;
	КонецЕсли;
	
	Если ИспользоватьПлательщик Тогда
		Элементы.Плательщик.Доступность = Истина;
	Иначе
		Плательщик = Справочники.Контрагенты.ПустаяСсылка();
		Элементы.Плательщик.Доступность = Ложь;
	КонецЕсли;
	
	Если ИспользоватьПериод Тогда
		Элементы.Период.Доступность = Истина;
	Иначе
		Период.ДатаНачала= Дата("00010101");
		Период.ДатаОкончания = ТекущаяДата();
		Элементы.Период.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПериодПриИзменении(Элемент)
	ИзменитьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПлательщикПриИзменении(Элемент)
	ИзменитьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьГосконтрактПриИзменении(Элемент)
	ИзменитьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	ТабличныйДокумент = СформироватьТабличныйДокумент();
	
	Идентификатор = "ОтчетГособоронзаказПериод";
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(Идентификатор);
	
	КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокумент;
	КоллекцияПечатныхФорм[0].Экземпляров = 1;
	КоллекцияПечатныхФорм[0].СинонимМакета = "Отчет о реализации по гособоронзаказам за период";
	
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,Неопределено,ЭтаФорма);
	
КонецПроцедуры 

&НаСервере
Функция СформироватьТабличныйДокумент()
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.КАНАТ_ОтчетОбОтгрузкахПоГособоронзаказам.КАНАТ_ПФ_РеализацияГособоронЗаказ");
	
	//Шапка
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	
	ДанныеШапки = Новый Структура;
	ДанныеШапки.Вставить("Организация", БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация"));
	ДанныеШапки.Вставить("НачалоПериода", Формат(Период.ДатаНачала,"ДФ=dd.MM.yy"));
	ДанныеШапки.Вставить("КонецПериода", Формат(Период.ДатаОкончания,"ДФ=dd.MM.yy"));
	
	ОбластьШапка.Параметры.Заполнить(ДанныеШапки);
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	
	//Таблица
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ОбластьШапкаТаблицы");
	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СчетФактураВыданный.Номер КАК Номер,
	|	СчетФактураВыданный.Дата КАК Дата,
	|	СчетФактураВыданный.Контрагент КАК Плательщик,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.Сумма, 0) КАК СуммаКонтракта,
	|	ГосударственныеКонтракты.Представление КАК Представление,
	|	ГосударственныеКонтракты.НомерИГК КАК НомерИГК,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СуммаПоСчетуФактуре КАК СуммаПоСчетуФактуре,
	|	ЕСТЬNULL(РеализацияТоваровУслуг.Номер, """") КАК НомерРеализации,
	|	ЕСТЬNULL(РеализацияТоваровУслуг.Дата, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаРеализации,
	|	ЕСТЬNULL(РеализацияТоваровУслуг.СуммаДокумента, 0) КАК СуммаРеализации
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГосударственныеКонтракты КАК ГосударственныеКонтракты
	|			ПО ДоговорыКонтрагентов.ГосударственныйКонтракт = ГосударственныеКонтракты.Ссылка
	|		ПО СчетФактураВыданный.Договор = ДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналУчетаСчетовФактур.СрезПоследних КАК ЖурналУчетаСчетовФактурСрезПоследних
	|		ПО СчетФактураВыданный.Ссылка = ЖурналУчетаСчетовФактурСрезПоследних.СчетФактура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО СчетФактураВыданный.ДокументОснование = РеализацияТоваровУслуг.Ссылка
	|ГДЕ
	|	(СчетФактураВыданный.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|			ИЛИ НЕ &ИспользоватьПериод)
	|	И (СчетФактураВыданный.Контрагент = &Плательщик
	|			ИЛИ НЕ &ИспользоватьПлательщик)
	|	И (ГосударственныеКонтракты.Ссылка = &Госконтракт
	|			ИЛИ НЕ &ИспользоватьГосконтракт)
	|	И ДоговорыКонтрагентов.ДоговорСУчастникомГОЗ
	|	И СчетФактураВыданный.Проведен = ИСТИНА
	|	И СчетФактураВыданный.ПометкаУдаления = ЛОЖЬ
	|	И ДоговорыКонтрагентов.ПометкаУдаления = ЛОЖЬ
	|	И ГосударственныеКонтракты.ПометкаУдаления = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	СчетФактураВыданный.Номер,
	|	СчетФактураВыданный.Дата,
	|	СчетФактураВыданный.Контрагент,
	|	ДоговорыКонтрагентов.Сумма,
	|	ГосударственныеКонтракты.Представление,
	|	ГосударственныеКонтракты.НомерИГК,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СуммаПоСчетуФактуре,
	|	ЕСТЬNULL(РеализацияТоваровУслуг.Номер, """"),
	|	ЕСТЬNULL(РеализацияТоваровУслуг.Дата, ДАТАВРЕМЯ(1, 1, 1)),
	|	ЕСТЬNULL(РеализацияТоваровУслуг.СуммаДокумента, 0)";
	
	Запрос.УстановитьПараметр("Госконтракт"				,Госконтракт);
	Запрос.УстановитьПараметр("ИспользоватьГосконтракт"	,ИспользоватьГосконтракт);
	Запрос.УстановитьПараметр("ИспользоватьПериод"		,ИспользоватьПериод);
	Запрос.УстановитьПараметр("ИспользоватьПлательщик"	,ИспользоватьПлательщик);
	Запрос.УстановитьПараметр("КонецПериода"			,Период.ДатаОкончания);
	Запрос.УстановитьПараметр("НачалоПериода"			,Период.ДатаНачала);
	Запрос.УстановитьПараметр("Плательщик"				,Плательщик);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ИтогоСуммаДоговор		= 0;
	ИтогоСуммаСФ			= 0;
	ИтогоСуммаРеализации	= 0;
	Счетчик = 1;
	
	Пока Выборка.Следующий() Цикл
		
		ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("ОбластьТаблица");
		
		ДанныеСтроки = Новый Структура;
		ДанныеСтроки.Вставить("ПП",             Счетчик);
		ДанныеСтроки.Вставить("Номер",          Выборка.Номер);
		ДанныеСтроки.Вставить("Дата",           Выборка.Дата);
		ДанныеСтроки.Вставить("Плательщик",     Выборка.Плательщик);
		ДанныеСтроки.Вставить("СуммаКонтракта", Выборка.СуммаКонтракта);
		ДанныеСтроки.Вставить("СуммаСФ",        Выборка.СуммаПоСчетуФактуре);
		ДанныеСтроки.Вставить("Госконтракт",    Выборка.Представление);
		ДанныеСтроки.Вставить("ИГК",            Выборка.НомерИГК);
		ДанныеСтроки.Вставить("НомерРеализации",Выборка.НомерРеализации);
		ДанныеСтроки.Вставить("ДатаРеализации", Формат(Выборка.ДатаРеализации,"ДФ=dd.MM.yyyy"));
		ДанныеСтроки.Вставить("СуммаРеализации",Выборка.СуммаРеализации);
		
		ОбластьСтрокаТаблицы.Параметры.Заполнить(ДанныеСтроки);
		ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);
		
		Счетчик					= Счетчик + 1;
		ИтогоСуммаДоговор		= ИтогоСуммаДоговор + Выборка.СуммаКонтракта;
		ИтогоСуммаСФ			= ИтогоСуммаСФ + Выборка.СуммаПоСчетуФактуре;
		ИтогоСуммаРеализации	= ИтогоСуммаРеализации+ Выборка.СуммаРеализации;
	КонецЦикла;
	
	ОбластьТаблицаПодвал = Макет.ПолучитьОбласть("ОбластьТаблицаПодвал");
	ДанныеИтоги = Новый Структура;
	ДанныеИтоги.Вставить("ИтогоСуммаКонтракт"	,ИтогоСуммаДоговор);
	ДанныеИтоги.Вставить("ИтогоСуммаСФ"			,ИтогоСуммаСФ);
	ДанныеИтоги.Вставить("ИтогоСуммаРеализации"	,ИтогоСуммаРеализации);
	
	ОбластьТаблицаПодвал.Параметры.Заполнить(ДанныеИтоги);
	ТабличныйДокумент.Вывести(ОбластьТаблицаПодвал);
	
	//Подвал
	ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодвал");
	ДанныеПодвал = Новый Структура;
	ДанныеПодвал.Вставить("Пользователь", Пользователи.ТекущийПользователь());
	ДанныеПодвал.Вставить("Дата", ТекущаяДата());
	
	ОбластьПодвал.Параметры.Заполнить(ДанныеПодвал);
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
	Возврат ТабличныйДокумент;
	
КонецФункции
