
//&Вместо("ТекстЗапросаДанныхТабличнойЧастиДляПечатиСчетаФактуры")
//Функция КАНАТ_ТекстЗапросаДанныхТабличнойЧастиДляПечатиСчетаФактуры(ПараметрыПечати)
//	ПечататьСчетаФактурыПолученные = ПараметрыПечати.Свойство("МассивСчетФактураПолученный");
//	
//	ТекстЗапроса =
//	"ВЫБРАТЬ
//	|	СчетаФактурыОснования.Ссылка                                 КАК Ссылка,  
//	//Бит_Гурьев_02.05.24
//	|	максимум(АналитикиТаблицыТоваровСНомерамиСтрок.НомерСтрокиСФ)          КАК НомерСтроки,
//	|	максимум(АналитикиТаблицыТоваровСНомерамиСтрок.НомерСтрокиИсходногоСФ) КАК НомерСтрокиИсходногоСФ,
//	//Бит_Гурьев_02.05.24
//	|	ТаблицаДокумента.Номенклатура                                КАК Номенклатура,
//	|	ТаблицаДокумента.НоменклатураНаименование                    КАК НоменклатураНаименование,
//	|	ТаблицаДокумента.НоменклатураКод                             КАК НоменклатураКод,
//	|	ТаблицаДокумента.КодТНВЭД                                    КАК КодТНВЭД,
//	|	ТаблицаДокумента.ЕдиницаИзмерения                            КАК ЕдиницаИзмерения,
//	|	ДанныеЕдиницыИзмерения.Представление                         КАК ЕдиницаИзмеренияНаименование,
//	|	ДанныеЕдиницыИзмерения.Код                                   КАК ЕдиницаИзмеренияКод,
//	|	ТаблицаДокумента.Номенклатура.ЕдиницаИзмеренияТНВЭД          КАК ЕдиницаИзмеренияТНВЭД,
//	|	ТаблицаДокумента.Номенклатура.ЕдиницаИзмеренияТНВЭД.Представление КАК ЕдиницаИзмеренияТНВЭДНаименование,
//	|	ТаблицаДокумента.Номенклатура.ЕдиницаИзмеренияТНВЭД.Код      КАК ЕдиницаИзмеренияТНВЭДКод,
//	|	ТаблицаДокумента.Характеристика                              КАК Характеристика,
//	|	ТаблицаДокумента.НоменклатураПартнера          				 КАК НоменклатураПартнера,
//	|	ЕСТЬNULL(ДанныеХарактеристики.НаименованиеПолное, """")      КАК ХарактеристикаНаименование,
//	|	ТаблицаДокумента.Серия.Наименование                          КАК СерияНаименование,
//	|	ТаблицаДокумента.НомерГТД                                    КАК НомерГТДСсылка,
//	|	ЕСТЬNULL(ТаблицаДокумента.НомерГТД.ТипНомераГТД, НЕОПРЕДЕЛЕНО) КАК ТипНомераГТД,
//	|	ВЫБОР
//	|		КОГДА ТаблицаДокумента.НомерГТД.РегистрационныйНомер = """"
//	|			ТОГДА ТаблицаДокумента.НомерГТД
//	|		ИНАЧЕ ТаблицаДокумента.НомерГТД.РегистрационныйНомер
//	|	КОНЕЦ                                                        КАК НомерГТД,
//	|	ДанныеСтраныПросхождения.Ссылка                              КАК СтранаПроисхождения,
//	|	ДанныеСтраныПросхождения.Код                                 КАК СтранаПроисхожденияКод,
//	|	СУММА(ТаблицаДокумента.Количество)                           КАК Количество,
//	|	СУММА(ТаблицаДокумента.КоличествоПоРНПТ)                     КАК КоличествоПоРНПТ,
//	|	ВЫБОР КОГДА СУММА(ТаблицаДокумента.Количество) = 0 И ТаблицаДокумента.Цена = 0
//	|		ТОГДА ТаблицаДокумента.ЦенаДо
//	|		ИНАЧЕ ТаблицаДокумента.Цена
//	|	КОНЕЦ КАК Цена,
//	|	СУММА(ТаблицаДокумента.СуммаБезНДС)                          КАК СуммаБезНДС,
//	|	СУММА(ТаблицаДокумента.СуммаНДС)                             КАК СуммаНДС,
//	|	СУММА(ТаблицаДокумента.СуммаБезНДС
//	|		+ ТаблицаДокумента.СуммаНДС)                             КАК СуммаСНДС,
//	|	ТаблицаДокумента.СтавкаНДС                                   КАК СтавкаНДС,
//	|
//	|	СУММА(ТаблицаДокумента.КоличествоДо)                         КАК КоличествоДо,
//	|	СУММА(ТаблицаДокумента.КоличествоПоРНПТДо)                   КАК КоличествоПоРНПТДо,
//	|	СУММА(ТаблицаДокумента.КоличествоПоРНПТУвеличение)           КАК КоличествоПрослежУвеличение,
//	|	СУММА(ТаблицаДокумента.КоличествоПоРНПТУменьшение)           КАК КоличествоПрослежУменьшение,
//	|	ТаблицаДокумента.ЦенаДо                                      КАК ЦенаДо,
//	|	СУММА(ТаблицаДокумента.СуммаБезНДСДо)                        КАК СуммаБезНДСДо,
//	|	СУММА(ТаблицаДокумента.РазницаБезНДСУвеличение)              КАК РазницаБезНДСУвеличение,
//	|	СУММА(ТаблицаДокумента.РазницаБезНДСУменьшение)              КАК РазницаБезНДСУменьшение,
//	|	СУММА(ТаблицаДокумента.СуммаНДСДо)                           КАК СуммаНДСДо,
//	|	СУММА(ТаблицаДокумента.РазницаНДСУвеличение)                 КАК РазницаНДСУвеличение,
//	|	СУММА(ТаблицаДокумента.РазницаНДСУменьшение)                 КАК РазницаНДСУменьшение,
//	|	СУММА(ТаблицаДокумента.СуммаБезНДСДо
//	|		+ ТаблицаДокумента.СуммаНДСДо)                           КАК СуммаСНДСДо,
//	|	СУММА(ТаблицаДокумента.РазницаСНДСУвеличение)                КАК РазницаСНДСУвеличение,
//	|	СУММА(ТаблицаДокумента.РазницаСНДСУменьшение)                КАК РазницаСНДСУменьшение,
//	|	СУММА(ТаблицаДокумента.КоличествоБазовыхЕдиниц)              КАК КоличествоБазовыхЕдиниц,
//	|	СУММА(ТаблицаДокумента.КоличествоБазовыхЕдиницДо)            КАК КоличествоБазовыхЕдиницДо,
//	|
//	|	//ДанныеНаборов
//	|
//	|	ЛОЖЬ                                                         КАК ЭтоВозвратнаяТара
//	|
//	|ИЗ
//	|	ТаблицаТоваровДокументов КАК ТаблицаДокумента
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СчетаФактурыОснования КАК СчетаФактурыОснования
//	|		ПО (ВЫБОР
//	|				КОГДА СчетаФактурыОснования.ДокументОснование ССЫЛКА Документ.ОтчетКомитентуОЗакупках
//	|					ТОГДА СчетаФактурыОснования.Ссылка = ТаблицаДокумента.СсылкаСФ
//	|				КОГДА СчетаФактурыОснования.ДокументОснование ССЫЛКА Документ.ОтчетКомиссионера
//	|					ТОГДА СчетаФактурыОснования.ДокументОснование = ТаблицаДокумента.Ссылка
//	|						И (ТаблицаДокумента.Покупатель, ТаблицаДокумента.НомерСчетаФактуры) В
//	|							(ВЫБРАТЬ СчетаФактурыПокупатели.Покупатель,
//	|									СчетаФактурыПокупатели.НомерСчетаФактуры
//	|								ИЗ СчетаФактурыПокупатели КАК СчетаФактурыПокупатели
//	|								ГДЕ
//	|								СчетаФактурыПокупатели.Ссылка = СчетаФактурыОснования.Ссылка)
//	|				ИНАЧЕ СчетаФактурыОснования.ДокументОснование = ТаблицаДокумента.Ссылка
//	|			КОНЕЦ)
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК ДанныеЕдиницыИзмерения
//	|		ПО ТаблицаДокумента.ЕдиницаИзмерения = ДанныеЕдиницыИзмерения.Ссылка
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ДанныеХарактеристики
//	|		ПО ТаблицаДокумента.Характеристика = ДанныеХарактеристики.Ссылка
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтраныМира КАК ДанныеСтраныПросхождения
//	|		ПО ТаблицаДокумента.НомерГТД.СтранаПроисхождения = ДанныеСтраныПросхождения.Ссылка
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ АналитикиТаблицыТоваровСНомерамиСтрок КАК АналитикиТаблицыТоваровСНомерамиСтрок
//	|		ПО АналитикиТаблицыТоваровСНомерамиСтрок.СчетФактура = СчетаФактурыОснования.Ссылка
//	|		И АналитикиТаблицыТоваровСНомерамиСтрок.НомерСтрокиИсходногоСФ = ТаблицаДокумента.НомерСтрокиИсходногоСФ
//	|		И АналитикиТаблицыТоваровСНомерамиСтрок.Номенклатура = ТаблицаДокумента.Номенклатура
//	|		И АналитикиТаблицыТоваровСНомерамиСтрок.НоменклатураНаименование = ТаблицаДокумента.НоменклатураНаименование
//	|		И АналитикиТаблицыТоваровСНомерамиСтрок.КодТНВЭД = ТаблицаДокумента.КодТНВЭД
//	|		И АналитикиТаблицыТоваровСНомерамиСтрок.Характеристика = ТаблицаДокумента.Характеристика
//	|		И АналитикиТаблицыТоваровСНомерамиСтрок.Серия = ТаблицаДокумента.Серия
//	|		И АналитикиТаблицыТоваровСНомерамиСтрок.НомерГТД = ТаблицаДокумента.НомерГТД
//	|		И АналитикиТаблицыТоваровСНомерамиСтрок.Цена = ТаблицаДокумента.Цена
//	|		И АналитикиТаблицыТоваровСНомерамиСтрок.СтавкаНДС = ТаблицаДокумента.СтавкаНДС
//	|		И АналитикиТаблицыТоваровСНомерамиСтрок.ЦенаДо = ТаблицаДокумента.ЦенаДо
//	|		//СоединениеНаборов
//	
//	|ГДЕ
//	|	НЕ ТаблицаДокумента.ЭтоВозвратнаяТара
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	СчетаФактурыОснования.Ссылка,
//	//Бит_Гурьев_02.05.24
//	//|	АналитикиТаблицыТоваровСНомерамиСтрок.НомерСтрокиСФ,
//	//|	АналитикиТаблицыТоваровСНомерамиСтрок.НомерСтрокиИсходногоСФ, 
//	//Бит_Гурьев_02.05.24
//	|	ТаблицаДокумента.Номенклатура,
//	|	ТаблицаДокумента.НоменклатураНаименование,
//	|	ТаблицаДокумента.НоменклатураКод,
//	|	ТаблицаДокумента.КодТНВЭД,
//	|	ТаблицаДокумента.ЕдиницаИзмерения,
//	|	ТаблицаДокумента.Номенклатура.ЕдиницаИзмеренияТНВЭД,
//	|	ТаблицаДокумента.Номенклатура.ЕдиницаИзмеренияТНВЭД.Представление,
//	|	ТаблицаДокумента.Номенклатура.ЕдиницаИзмеренияТНВЭД.Код,
//	|	ДанныеЕдиницыИзмерения.Представление,
//	|	ДанныеЕдиницыИзмерения.Код,
//	|	ТаблицаДокумента.Характеристика,
//	|	ТаблицаДокумента.НоменклатураПартнера,	
//	|	ДанныеХарактеристики.НаименованиеПолное,
//	|	ТаблицаДокумента.Серия.Наименование,
//	|	ТаблицаДокумента.НомерГТД,
//	|	ЕСТЬNULL(ТаблицаДокумента.НомерГТД.ТипНомераГТД, НЕОПРЕДЕЛЕНО),
//	|	ВЫБОР
//	|		КОГДА ТаблицаДокумента.НомерГТД.РегистрационныйНомер = """"
//	|			ТОГДА ТаблицаДокумента.НомерГТД
//	|		ИНАЧЕ ТаблицаДокумента.НомерГТД.РегистрационныйНомер
//	|	КОНЕЦ,
//	|	ДанныеСтраныПросхождения.Ссылка,
//	|	ТаблицаДокумента.Цена,
//	|	ТаблицаДокумента.ЦенаДо,
//	|	ТаблицаДокумента.НомерГТД,
//	|	ЕСТЬNULL(ТаблицаДокумента.НомерГТД.ТипНомераГТД, НЕОПРЕДЕЛЕНО),
//	|	//ГруппировкаНаборов
//	|	ТаблицаДокумента.СтавкаНДС";
//	
//	Если ПараметрыПечати.ВыводитьНаборы Тогда
//		
//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ДанныеНаборов",
//		"МИНИМУМ(ТаблицаДокумента.НомерСтрокиНаборы)                     КАК НомерСтрокиНаборы,
//		|	ТаблицаДокумента.ВариантПредставленияНабораВПечатныхФормах   КАК ВариантПредставленияНабораВПечатныхФормах,
//		|	ТаблицаДокумента.ВариантРасчетаЦеныНабора                    КАК ВариантРасчетаЦеныНабора,
//		|	ТаблицаДокумента.НоменклатураНабора                          КАК НоменклатураНабора,
//		|	ТаблицаДокумента.ХарактеристикаНабора                        КАК ХарактеристикаНабора,
//		|	ТаблицаДокумента.ЭтоКомплектующие                            КАК ЭтоКомплектующие,
//		|	ТаблицаДокумента.ЭтоНабор                                    КАК ЭтоНабор,
//		|	ТаблицаДокумента.ПолныйНабор                                 КАК ПолныйНабор,");
//		
//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ГруппировкаНаборов",
//		"ТаблицаДокумента.ВариантПредставленияНабораВПечатныхФормах,
//		|	ТаблицаДокумента.ВариантРасчетаЦеныНабора,
//		|	ТаблицаДокумента.НоменклатураНабора,
//		|	ТаблицаДокумента.ХарактеристикаНабора,
//		|	ТаблицаДокумента.ЭтоКомплектующие,
//		|	ТаблицаДокумента.ЭтоНабор,
//		|	ТаблицаДокумента.ПолныйНабор,");
//		
//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//СоединениеНаборов",
//		"И АналитикиТаблицыТоваровСНомерамиСтрок.ВариантПредставленияНабораВПечатныхФормах = ТаблицаДокумента.ВариантПредставленияНабораВПечатныхФормах
//		|	И АналитикиТаблицыТоваровСНомерамиСтрок.ВариантРасчетаЦеныНабора = ТаблицаДокумента.ВариантРасчетаЦеныНабора
//		|	И АналитикиТаблицыТоваровСНомерамиСтрок.НоменклатураНабора = ТаблицаДокумента.НоменклатураНабора
//		|	И АналитикиТаблицыТоваровСНомерамиСтрок.ХарактеристикаНабора = ТаблицаДокумента.ХарактеристикаНабора
//		|	И АналитикиТаблицыТоваровСНомерамиСтрок.ЭтоКомплектующие = ТаблицаДокумента.ЭтоКомплектующие
//		|	И АналитикиТаблицыТоваровСНомерамиСтрок.ЭтоНабор = ТаблицаДокумента.ЭтоНабор
//		|	И АналитикиТаблицыТоваровСНомерамиСтрок.ПолныйНабор = ТаблицаДокумента.ПолныйНабор");
//		
//	КонецЕсли;
//	
//	Если ПечататьСчетаФактурыПолученные Тогда
//		
//		ТекстЗапроса = ТекстЗапроса + "
//		|
//		|ОБЪЕДИНИТЬ ВСЕ
//		|" +
//		СтрЗаменить(ТекстЗапроса, "СчетаФактурыОснования", "СчетаФактурыПолученныеОснования");
//		
//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СчетаФактурыПолученныеОснования.РеализацияЧерезКомиссионера", "ЛОЖЬ");
//		
//	КонецЕсли;
//	
//	ТекстЗапроса = ТекстЗапроса + "
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	Ссылка,
//	|	//ПорядокНаборов
//	|	НомерСтроки
//	|ИТОГИ ПО
//	|	Ссылка
//	|;";
//	
//	Если ПараметрыПечати.ВыводитьНаборы Тогда
//		
//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ПорядокНаборов",
//			"НомерСтрокиНаборы,
//			|	НоменклатураНабора,
//			|	ХарактеристикаНабора,
//			|	ЭтоНабор УБЫВ,");
//		
//	КонецЕсли;
//	
//	Возврат ТекстЗапроса;
//КонецФункции

&ИзменениеИКонтроль("ТекстЗапросаДанныхТабличнойЧастиДляПечатиСчетаФактуры")
Функция КАНАТ_ТекстЗапросаДанныхТабличнойЧастиДляПечатиСчетаФактуры(ПараметрыПечати)

	ПечататьСчетаФактурыПолученные = ПараметрыПечати.Свойство("МассивСчетФактураПолученный");

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СчетаФактурыОснования.Ссылка                                 КАК Ссылка,
	#Удаление
	|	АналитикиТаблицыТоваровСНомерамиСтрок.НомерСтрокиСФ          КАК НомерСтроки,
	|	АналитикиТаблицыТоваровСНомерамиСтрок.НомерСтрокиИсходногоСФ КАК НомерСтрокиИсходногоСФ,
    #КонецУдаления
	#Вставка
	|	максимум(АналитикиТаблицыТоваровСНомерамиСтрок.НомерСтрокиСФ)          КАК НомерСтроки,
	|	максимум(АналитикиТаблицыТоваровСНомерамиСтрок.НомерСтрокиИсходногоСФ) КАК НомерСтрокиИсходногоСФ,
	#КонецВставки
	|	ТаблицаДокумента.Номенклатура                                КАК Номенклатура,
	|	ТаблицаДокумента.НоменклатураНаименование                    КАК НоменклатураНаименование,
	|	ТаблицаДокумента.НоменклатураКод                             КАК НоменклатураКод,
	|	ТаблицаДокумента.КодТНВЭД                                    КАК КодТНВЭД,
	|	ТаблицаДокумента.ЕдиницаИзмерения                            КАК ЕдиницаИзмерения,
	|	ДанныеЕдиницыИзмерения.Представление                         КАК ЕдиницаИзмеренияНаименование,
	|	ДанныеЕдиницыИзмерения.Код                                   КАК ЕдиницаИзмеренияКод,
	|	ТаблицаДокумента.НомерГТД.ЕдиницаИзмерения                   КАК ЕдиницаИзмеренияТНВЭД,
	|	ТаблицаДокумента.НомерГТД.ЕдиницаИзмерения.Представление     КАК ЕдиницаИзмеренияТНВЭДНаименование,
	|	ТаблицаДокумента.НомерГТД.ЕдиницаИзмерения.Код               КАК ЕдиницаИзмеренияТНВЭДКод,
	|	ТаблицаДокумента.Характеристика                              КАК Характеристика,
	|	ТаблицаДокумента.НоменклатураПартнера          				 КАК НоменклатураПартнера,
	|	ЕСТЬNULL(ДанныеХарактеристики.НаименованиеПолное, """")      КАК ХарактеристикаНаименование,
	|	ТаблицаДокумента.Серия.Наименование                          КАК СерияНаименование,
	|	ТаблицаДокумента.НомерГТД                                    КАК НомерГТДСсылка,
	|	ЕСТЬNULL(ТаблицаДокумента.НомерГТД.ТипНомераГТД, НЕОПРЕДЕЛЕНО) КАК ТипНомераГТД,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.НомерГТД.РегистрационныйНомер = """"
	|			ТОГДА ТаблицаДокумента.НомерГТД
	|		ИНАЧЕ ТаблицаДокумента.НомерГТД.РегистрационныйНомер
	|	КОНЕЦ                                                        КАК НомерГТД,
	|	ДанныеСтраныПросхождения.Ссылка                              КАК СтранаПроисхождения,
	|	ДанныеСтраныПросхождения.Код                                 КАК СтранаПроисхожденияКод,
	|	СУММА(ТаблицаДокумента.Количество)                           КАК Количество,
	|	СУММА(ТаблицаДокумента.КоличествоПоРНПТ)                     КАК КоличествоПоРНПТ,
	|	ВЫБОР КОГДА СУММА(ТаблицаДокумента.Количество) = 0 И ТаблицаДокумента.Цена = 0
	|		ТОГДА ТаблицаДокумента.ЦенаДо
	|		ИНАЧЕ ТаблицаДокумента.Цена
	|	КОНЕЦ КАК Цена,
	|	СУММА(ТаблицаДокумента.СуммаБезНДС)                          КАК СуммаБезНДС,
	|	СУММА(ТаблицаДокумента.СуммаНДС)                             КАК СуммаНДС,
	|	СУММА(ТаблицаДокумента.СуммаБезНДС
	|		+ ТаблицаДокумента.СуммаНДС)                             КАК СуммаСНДС,
	|	ТаблицаДокумента.СтавкаНДС                                   КАК СтавкаНДС,
	|	СУММА(ТаблицаДокумента.МежценоваяРазница)                    КАК МежценоваяРазница,
	|
	|	СУММА(ТаблицаДокумента.КоличествоДо)                         КАК КоличествоДо,
	|	СУММА(ТаблицаДокумента.КоличествоПоРНПТДо)                   КАК КоличествоПоРНПТДо,
	|	СУММА(ТаблицаДокумента.КоличествоПоРНПТУвеличение)           КАК КоличествоПрослежУвеличение,
	|	СУММА(ТаблицаДокумента.КоличествоПоРНПТУменьшение)           КАК КоличествоПрослежУменьшение,
	|	ТаблицаДокумента.ЦенаДо                                      КАК ЦенаДо,
	|	СУММА(ТаблицаДокумента.СуммаБезНДСДо)                        КАК СуммаБезНДСДо,
	|	СУММА(ТаблицаДокумента.МежценоваяРазницаДо)                  КАК МежценоваяРазницаДо,
	|	СУММА(ТаблицаДокумента.РазницаБезНДСУвеличение)              КАК РазницаБезНДСУвеличение,
	|	СУММА(ТаблицаДокумента.РазницаБезНДСУменьшение)              КАК РазницаБезНДСУменьшение,
	|	СУММА(ТаблицаДокумента.СуммаНДСДо)                           КАК СуммаНДСДо,
	|	СУММА(ТаблицаДокумента.РазницаНДСУвеличение)                 КАК РазницаНДСУвеличение,
	|	СУММА(ТаблицаДокумента.РазницаНДСУменьшение)                 КАК РазницаНДСУменьшение,
	|	СУММА(ТаблицаДокумента.СуммаБезНДСДо
	|		+ ТаблицаДокумента.СуммаНДСДо)                           КАК СуммаСНДСДо,
	|	СУММА(ТаблицаДокумента.РазницаСНДСУвеличение)                КАК РазницаСНДСУвеличение,
	|	СУММА(ТаблицаДокумента.РазницаСНДСУменьшение)                КАК РазницаСНДСУменьшение,
	|	СУММА(ТаблицаДокумента.КоличествоБазовыхЕдиниц)              КАК КоличествоБазовыхЕдиниц,
	|	СУММА(ТаблицаДокумента.КоличествоБазовыхЕдиницДо)            КАК КоличествоБазовыхЕдиницДо,
	|
	|	//ДанныеНаборов
	|
	|	ЛОЖЬ                                                         КАК ЭтоВозвратнаяТара
	|
	|ИЗ
	|	ТаблицаТоваровДокументов КАК ТаблицаДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СчетаФактурыОснования КАК СчетаФактурыОснования
	|		ПО (ВЫБОР
	|				КОГДА СчетаФактурыОснования.ДокументОснование ССЫЛКА Документ.ОтчетКомитентуОЗакупках
	|					ТОГДА СчетаФактурыОснования.Ссылка = ТаблицаДокумента.СсылкаСФ
	|				КОГДА СчетаФактурыОснования.ДокументОснование ССЫЛКА Документ.ОтчетКомиссионера
	|					ТОГДА СчетаФактурыОснования.ДокументОснование = ТаблицаДокумента.Ссылка
	|						И (ТаблицаДокумента.Покупатель, ТаблицаДокумента.НомерСчетаФактуры) В
	|							(ВЫБРАТЬ СчетаФактурыПокупатели.Покупатель,
	|									СчетаФактурыПокупатели.НомерСчетаФактуры
	|								ИЗ СчетаФактурыПокупатели КАК СчетаФактурыПокупатели
	|								ГДЕ
	|								СчетаФактурыПокупатели.Ссылка = СчетаФактурыОснования.Ссылка)
	|				ИНАЧЕ СчетаФактурыОснования.ДокументОснование = ТаблицаДокумента.Ссылка
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК ДанныеЕдиницыИзмерения
	|		ПО ТаблицаДокумента.ЕдиницаИзмерения = ДанныеЕдиницыИзмерения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ДанныеХарактеристики
	|		ПО ТаблицаДокумента.Характеристика = ДанныеХарактеристики.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтраныМира КАК ДанныеСтраныПросхождения
	|		ПО ТаблицаДокумента.НомерГТД.СтранаПроисхождения = ДанныеСтраныПросхождения.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ АналитикиТаблицыТоваровСНомерамиСтрок КАК АналитикиТаблицыТоваровСНомерамиСтрок
	|		ПО АналитикиТаблицыТоваровСНомерамиСтрок.СчетФактура = СчетаФактурыОснования.Ссылка
	|		И АналитикиТаблицыТоваровСНомерамиСтрок.НомерСтрокиИсходногоСФ = ТаблицаДокумента.НомерСтрокиИсходногоСФ
	|		И АналитикиТаблицыТоваровСНомерамиСтрок.Номенклатура = ТаблицаДокумента.Номенклатура
	|		И АналитикиТаблицыТоваровСНомерамиСтрок.НоменклатураНаименование = ТаблицаДокумента.НоменклатураНаименование
	|		И АналитикиТаблицыТоваровСНомерамиСтрок.КодТНВЭД = ТаблицаДокумента.КодТНВЭД
	|		И АналитикиТаблицыТоваровСНомерамиСтрок.Характеристика = ТаблицаДокумента.Характеристика
	|		И АналитикиТаблицыТоваровСНомерамиСтрок.Серия = ТаблицаДокумента.Серия
	|		И АналитикиТаблицыТоваровСНомерамиСтрок.НомерГТД = ТаблицаДокумента.НомерГТД
	|		И АналитикиТаблицыТоваровСНомерамиСтрок.Цена = ТаблицаДокумента.Цена
	|		И АналитикиТаблицыТоваровСНомерамиСтрок.СтавкаНДС = ТаблицаДокумента.СтавкаНДС
	|		И АналитикиТаблицыТоваровСНомерамиСтрок.ЦенаДо = ТаблицаДокумента.ЦенаДо
	|		//СоединениеНаборов

	|ГДЕ
	|	НЕ ТаблицаДокумента.ЭтоВозвратнаяТара
	|
	|СГРУППИРОВАТЬ ПО
	|	СчетаФактурыОснования.Ссылка, 
	#Удаление
	|	АналитикиТаблицыТоваровСНомерамиСтрок.НомерСтрокиСФ,
	|	АналитикиТаблицыТоваровСНомерамиСтрок.НомерСтрокиИсходногоСФ,
	#КонецУдаления
	|	ТаблицаДокумента.Номенклатура,
	|	ТаблицаДокумента.НоменклатураНаименование,
	|	ТаблицаДокумента.НоменклатураКод,
	|	ТаблицаДокумента.КодТНВЭД,
	|	ТаблицаДокумента.ЕдиницаИзмерения,
	|	ДанныеЕдиницыИзмерения.Представление,
	|	ДанныеЕдиницыИзмерения.Код,
	|	ТаблицаДокумента.НомерГТД.ЕдиницаИзмерения,
	|	ТаблицаДокумента.НомерГТД.ЕдиницаИзмерения.Представление,
	|	ТаблицаДокумента.НомерГТД.ЕдиницаИзмерения.Код,
	|	ТаблицаДокумента.Характеристика,
	|	ТаблицаДокумента.НоменклатураПартнера,	
	|	ДанныеХарактеристики.НаименованиеПолное,
	|	ТаблицаДокумента.Серия.Наименование,
	|	ТаблицаДокумента.НомерГТД,
	|	ЕСТЬNULL(ТаблицаДокумента.НомерГТД.ТипНомераГТД, НЕОПРЕДЕЛЕНО),
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.НомерГТД.РегистрационныйНомер = """"
	|			ТОГДА ТаблицаДокумента.НомерГТД
	|		ИНАЧЕ ТаблицаДокумента.НомерГТД.РегистрационныйНомер
	|	КОНЕЦ,
	|	ДанныеСтраныПросхождения.Ссылка,
	|	ТаблицаДокумента.Цена,
	|	ТаблицаДокумента.ЦенаДо,
	|	ТаблицаДокумента.НомерГТД,
	|	ЕСТЬNULL(ТаблицаДокумента.НомерГТД.ТипНомераГТД, НЕОПРЕДЕЛЕНО),
	|	//ГруппировкаНаборов
	|	ТаблицаДокумента.СтавкаНДС";

	Если ПараметрыПечати.ВыводитьНаборы Тогда

		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ДанныеНаборов",
		"МИНИМУМ(ТаблицаДокумента.НомерСтрокиНаборы)                     КАК НомерСтрокиНаборы,
		|	ТаблицаДокумента.ВариантПредставленияНабораВПечатныхФормах   КАК ВариантПредставленияНабораВПечатныхФормах,
		|	ТаблицаДокумента.ВариантРасчетаЦеныНабора                    КАК ВариантРасчетаЦеныНабора,
		|	ТаблицаДокумента.НоменклатураНабора                          КАК НоменклатураНабора,
		|	ТаблицаДокумента.ХарактеристикаНабора                        КАК ХарактеристикаНабора,
		|	ТаблицаДокумента.ЭтоКомплектующие                            КАК ЭтоКомплектующие,
		|	ТаблицаДокумента.ЭтоНабор                                    КАК ЭтоНабор,
		|	ТаблицаДокумента.ПолныйНабор                                 КАК ПолныйНабор,");

		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ГруппировкаНаборов",
		"ТаблицаДокумента.ВариантПредставленияНабораВПечатныхФормах,
		|	ТаблицаДокумента.ВариантРасчетаЦеныНабора,
		|	ТаблицаДокумента.НоменклатураНабора,
		|	ТаблицаДокумента.ХарактеристикаНабора,
		|	ТаблицаДокумента.ЭтоКомплектующие,
		|	ТаблицаДокумента.ЭтоНабор,
		|	ТаблицаДокумента.ПолныйНабор,");

		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//СоединениеНаборов",
		"И АналитикиТаблицыТоваровСНомерамиСтрок.ВариантПредставленияНабораВПечатныхФормах = ТаблицаДокумента.ВариантПредставленияНабораВПечатныхФормах
		|	И АналитикиТаблицыТоваровСНомерамиСтрок.ВариантРасчетаЦеныНабора = ТаблицаДокумента.ВариантРасчетаЦеныНабора
		|	И АналитикиТаблицыТоваровСНомерамиСтрок.НоменклатураНабора = ТаблицаДокумента.НоменклатураНабора
		|	И АналитикиТаблицыТоваровСНомерамиСтрок.ХарактеристикаНабора = ТаблицаДокумента.ХарактеристикаНабора
		|	И АналитикиТаблицыТоваровСНомерамиСтрок.ЭтоКомплектующие = ТаблицаДокумента.ЭтоКомплектующие
		|	И АналитикиТаблицыТоваровСНомерамиСтрок.ЭтоНабор = ТаблицаДокумента.ЭтоНабор
		|	И АналитикиТаблицыТоваровСНомерамиСтрок.ПолныйНабор = ТаблицаДокумента.ПолныйНабор");

	КонецЕсли;

	Если ПечататьСчетаФактурыПолученные Тогда

		ТекстЗапроса = ТекстЗапроса + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|" +
		СтрЗаменить(ТекстЗапроса, "СчетаФактурыОснования", "СчетаФактурыПолученныеОснования");

		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СчетаФактурыПолученныеОснования.РеализацияЧерезКомиссионера", "ЛОЖЬ");

	КонецЕсли;

	ТекстЗапроса = ТекстЗапроса + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	//ПорядокНаборов
	|	НомерСтроки
	|ИТОГИ ПО
	|	Ссылка
	|;";

	Если ПараметрыПечати.ВыводитьНаборы Тогда

		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ПорядокНаборов",
		"НомерСтрокиНаборы,
		|	НоменклатураНабора,
		|	ХарактеристикаНабора,
		|	ЭтоНабор УБЫВ,");

	КонецЕсли;

	Возврат ТекстЗапроса;

КонецФункции
