
&НаСервере
Процедура КАНАТ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//++ Гурьев 28.09.23 ЧТЗ_2_11_4
	
	//Добавление на форму флажка ВИП-Клиент
	ПолеВыводитьСкидки = Элементы.Добавить("КАНАТ_ПолеВИПКлиент",
											Тип("ПолеФормы"),
											Элементы.ГруппаНаименование); 
	ПолеВыводитьСкидки.Заголовок = "ВИП-Клиент"; 
	ПолеВыводитьСкидки.ПутьКДанным = "Объект.КАНАТ_ВИПКлиент";
	ПолеВыводитьСкидки.Вид = ВидПоляФормы.ПолеФлажка;
	ПолеВыводитьСкидки.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	
	Элементы.Переместить(ПолеВыводитьСкидки, Элементы.ГруппаНаименование, Элементы.ГруппаНаименования);
	
	//-- Гурьев 28.09.23 ЧТЗ_2_11_4
	
	//БИТ_Гурьев_ЧТЗ_2_16_16.05.24++
	ПолеИспользоватьГрупповыеУпаковки = Элементы.Добавить("КАНАТ_ИспользоватьГрупповыеУпаковки",
											Тип("ПолеФормы"),
											Элементы.ГруппаНаименование); 
	ПолеИспользоватьГрупповыеУпаковки.Заголовок = "Использовать групповые упаковки"; 
	ПолеИспользоватьГрупповыеУпаковки.ПутьКДанным = "Объект.КАНАТ_ИспользоватьГрупповыеУпаковки";
	ПолеИспользоватьГрупповыеУпаковки.Вид = ВидПоляФормы.ПолеФлажка;
	ПолеИспользоватьГрупповыеУпаковки.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	
	Элементы.Переместить(ПолеИспользоватьГрупповыеУпаковки, Элементы.ГруппаНаименование, Элементы.ГруппаНаименования);
	//++Бит Трейгер П.М. Добавить реквизиты к справочнику контрагенты
	НовыйЭлемент = Элементы.Добавить("КАНАТ_КодСбыта",
											Тип("ПолеФормы"),
											Элементы.ГруппаДополнительныеРеквизиты); 
	НовыйЭлемент.Заголовок = "Код сбыта"; 
	НовыйЭлемент.ПутьКДанным = "Объект.КАНАТ_КодСбыта";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	
	
	НовыйЭлемент = Элементы.Добавить("КАНАТ_Отрасль",
											Тип("ПолеФормы"),
											Элементы.ГруппаДополнительныеРеквизиты); 
	НовыйЭлемент.Заголовок = "Отрасль"; 
	НовыйЭлемент.ПутьКДанным = "Объект.КАНАТ_Отрасль";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;

		НовыйЭлемент = Элементы.Добавить("КАНАТ_ФормаОрганизации",
											Тип("ПолеФормы"),
											Элементы.ГруппаДополнительныеРеквизиты); 
	НовыйЭлемент.Заголовок = "Форма Организации"; 
	НовыйЭлемент.ПутьКДанным = "Объект.КАНАТ_ФормаОрганизации";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;

			НовыйЭлемент = Элементы.Добавить("КАНАТ_ГруппировкаДляОтчета",
											Тип("ПолеФормы"),
											Элементы.ГруппаДополнительныеРеквизиты); 
	НовыйЭлемент.Заголовок = "Группировка для отчета"; 
	НовыйЭлемент.ПутьКДанным = "Объект.КАНАТ_ГруппировкаДляОтчета";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;

	
	//--Бит Трейгер П.М. Добавить реквизиты к справочнику контрагенты
	Элементы.ДополнительнаяИнформация.АвтоМаксимальнаяВысота = Ложь;
	Элементы.ДополнительнаяИнформация.МаксимальнаяВысота = 10;
	//БИТ_Гурьев_ЧТЗ_2_16_16.05.24--
	
КонецПроцедуры