
&НаСервере
Процедура ЗаполнитьТекущимиДаннымиНаСервере()
	ФактическийРасход.Очистить();
	
	Запрос = Новый Запрос;   
	#Область ПервыйВариантРеализации
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	РесурсныеСпецификацииМатериалыИУслуги.Номенклатура КАК Материал,
	//|	РесурсныеСпецификацииМатериалыИУслуги.Ссылка КАК СсылкаРесурснаяСпецификация,
	//|	СУММА(РесурсныеСпецификацииМатериалыИУслуги.КоличествоУпаковок/РесурсныеСпецификацииМатериалыИУслуги.Ссылка.ОсновноеИзделиеКоличествоУпаковок) КАК НормаНаШт
	//|ПОМЕСТИТЬ ВТИнфоПоНорме
	//|ИЗ
	//|	Справочник.РесурсныеСпецификации.МатериалыИУслуги КАК РесурсныеСпецификацииМатериалыИУслуги
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	РесурсныеСпецификацииМатериалыИУслуги.Номенклатура,
	//|	РесурсныеСпецификацииМатериалыИУслуги.Ссылка
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.Ссылка.Статус КАК Статус,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.Ссылка КАК Этап,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.Ссылка.ПартияПроизводства.ОсновноеИзделиеНоменклатура КАК Изделие,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.Ссылка.ПартияПроизводства.ОсновноеИзделиеНоменклатура.Артикул КАК КодИзделия,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.Ссылка.ПартияПроизводства.ОсновноеИзделиеХарактеристика КАК ХарактеристикаИзделия,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.Ссылка.ПартияПроизводства.ОсновноеИзделиеНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияИзделия,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.Ссылка.КоличествоУпаковокФакт КАК КоличествоИзделия,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.Номенклатура КАК Сырье,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.Характеристика КАК ХарактеристикаСырья,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.Номенклатура.Артикул КАК КодСырья, 
	//|	Максимум(НЕ ЭтапПроизводства2_2РасходМатериаловИРабот.Номенклатура.ГруппаФинансовогоУчета.КАНАТ_ГруппаФинансовогоУчетаВспомогательногоСырья) КАК ОсновноеСырье, 
	//|	МАКСИМУМ(ЭтапПроизводства2_2ВыходныеИзделия.Количество * ВТИнфоПоНорме.НормаНаШт) КАК НормаРасхода, 
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.КоличествоУпаковок КАК ФактРасхода,
	////|	ЭтапПроизводства2_2РасходМатериаловИРабот.КоличествоУпаковок КАК КоличествоУпаковокРасход,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.Ссылка.Спецификация КАК Спецификация,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.Ссылка.ДатаПроизводства КАК ДатаПроизводства,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.Ссылка.КАНАТ_КомментарийКЗаказу КАК КомментарийКЗаказу,
	////|	ЭтапПроизводства2_2РасходМатериаловИРабот.ИдентификаторСтроки КАК ИдентификаторСтроки,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.ДатаРасхода КАК ДатаРасхода,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.СтатьяКалькуляции КАК СтатьяКалькуляции,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.НомерСтроки КАК РасходНомерСтроки                    
	//|ИЗ
	//|	ВТИнфоПоНорме КАК ВТИнфоПоНорме
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ЭтапПроизводства2_2ВыходныеИзделия
	//|		ПО ВТИнфоПоНорме.СсылкаРесурснаяСпецификация = ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Спецификация
	//|			И ВТИнфоПоНорме.СсылкаРесурснаяСпецификация.ОсновноеИзделиеНоменклатура = ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура
	////|			И ВТИнфоПоНорме.СсылкаРесурснаяСпецификация.ОсновноеИзделиеХарактеристика = ЭтапПроизводства2_2ВыходныеИзделия.Характеристика
	//|		ПРАВОЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2.РасходМатериаловИРабот КАК ЭтапПроизводства2_2РасходМатериаловИРабот
	//|		ПО (ЭтапПроизводства2_2РасходМатериаловИРабот.Ссылка.Спецификация = ВТИнфоПоНорме.СсылкаРесурснаяСпецификация)
	//|			И (ЭтапПроизводства2_2РасходМатериаловИРабот.Номенклатура = ВТИнфоПоНорме.Материал)
	//|ГДЕ
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.Ссылка.ДатаПроизводства >= &ДатаНачала
	//|	И ЭтапПроизводства2_2РасходМатериаловИРабот.Ссылка.ДатаПроизводства <= &ДатаОкончания
	//|	
	//|СГРУППИРОВАТЬ ПО
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.Ссылка,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.ДатаРасхода,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.СтатьяКалькуляции,
	////|	ЭтапПроизводства2_2РасходМатериаловИРабот.ИдентификаторСтроки,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.Характеристика,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.Номенклатура,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.НомерСтроки,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.Ссылка.КАНАТ_КомментарийКЗаказу,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.Ссылка.ДатаПроизводства,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.Ссылка.Спецификация,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.КоличествоУпаковок,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.Номенклатура.Артикул,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.Ссылка.КоличествоУпаковокФакт,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.Ссылка.Спецификация.ОсновноеИзделиеУпаковка,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.Ссылка.Спецификация.ОсновноеИзделиеХарактеристика,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.Ссылка.Спецификация.ОсновноеИзделиеНоменклатура.Артикул,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.Ссылка.Спецификация.ОсновноеИзделиеНоменклатура,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.Ссылка.Статус
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Этап,
	//|	Изделие,
	//|	РасходНомерСтроки";
	//	
	//СхемаЗапроса = Новый СхемаЗапроса;
	//СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);  
	//
	//Если ЗначениеЗаполнено(Подразделение) тогда
	//	СхемаЗапроса.ПакетЗапросов[1].Операторы[0].Отбор.Добавить("(ЭтапПроизводства2_2РасходМатериаловИРабот.Ссылка.Подразделение = &Подразделение)");
	//	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	//КонецЕсли;
	//Если ЗначениеЗаполнено(СтатусЭтапа) тогда
	//	СхемаЗапроса.ПакетЗапросов[1].Операторы[0].Отбор.Добавить("(ЭтапПроизводства2_2РасходМатериаловИРабот.Ссылка.Статус В(&Статусы))");
	//	Запрос.УстановитьПараметр("Статусы", СтатусЭтапа);
	//КонецЕсли;
	//Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	//      
	#КонецОбласти
	Запрос.Текст =      //Игнорируем упаковки т.к. не планируется использовать типовой функционал упаковок
	"ВЫБРАТЬ
	|	РесурсныеСпецификацииМатериалыИУслуги.Номенклатура КАК Материал,
	|	РесурсныеСпецификацииМатериалыИУслуги.Характеристика КАК Характеристика,
	|	РесурсныеСпецификацииМатериалыИУслуги.Ссылка КАК СсылкаРесурснаяСпецификация,
	|	РесурсныеСпецификацииМатериалыИУслуги.Ссылка.ОсновноеИзделиеНоменклатура КАК ОсновноеИзделиеНоменклатура,
	|	СУММА(РесурсныеСпецификацииМатериалыИУслуги.КоличествоУпаковок / Выбор когда РесурсныеСпецификацииМатериалыИУслуги.Ссылка.ОсновноеИзделиеКоличествоУпаковок > 0 ТОгда РесурсныеСпецификацииМатериалыИУслуги.Ссылка.ОсновноеИзделиеКоличествоУпаковок Иначе 1 Конец) КАК НормаНаШт
	|ПОМЕСТИТЬ ВТИнфоПоНорме
	|ИЗ
	|	Справочник.РесурсныеСпецификации.МатериалыИУслуги КАК РесурсныеСпецификацииМатериалыИУслуги
	|
	|СГРУППИРОВАТЬ ПО
	|	РесурсныеСпецификацииМатериалыИУслуги.Номенклатура,
	|	РесурсныеСпецификацииМатериалыИУслуги.Характеристика,
	|	РесурсныеСпецификацииМатериалыИУслуги.Ссылка,
	|	РесурсныеСпецификацииМатериалыИУслуги.Ссылка.ОсновноеИзделиеНоменклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура КАК НоменклатураИзделие,
	|	ЭтапПроизводства2_2ВыходныеИзделия.КоличествоУпаковок КАК КоличествоУпаковокИзделие,
	|	ЭтапПроизводства2_2.Ссылка КАК ЭтапПроизводства2_2Ссылка
	|ПОМЕСТИТЬ ВТКоличествоИзделия
	|ИЗ
	|	Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ЭтапПроизводства2_2ВыходныеИзделия
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2 КАК ЭтапПроизводства2_2
	|		ПО (ЭтапПроизводства2_2ВыходныеИзделия.Ссылка = ЭтапПроизводства2_2.Ссылка
	|				И ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура = ЭтапПроизводства2_2.ПартияПроизводства.ОсновноеИзделиеНоменклатура)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.Статус КАК Статус,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка КАК Этап,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.ДатаПроизводства КАК ДатаРасхода,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.ПартияПроизводства.ОсновноеИзделиеНоменклатура КАК Изделие,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.ПартияПроизводства.ОсновноеИзделиеНоменклатура.Артикул КАК КодИзделия,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.ПартияПроизводства.ОсновноеИзделиеХарактеристика КАК ХарактеристикаИзделия,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.ПартияПроизводства.ОсновноеИзделиеНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияИзделия,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.КоличествоУпаковокФакт КАК КоличествоИзделия,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура КАК Сырье,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Характеристика КАК ХарактеристикаСырья,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура.Артикул КАК КодСырья, 
	|	МАКСИМУМ(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Отменено) КАК Отменено,
	|	МАКСИМУМ(НЕ ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура.ГруппаФинансовогоУчета.КАНАТ_ГруппаФинансовогоУчетаВспомогательногоСырья) КАК ОсновноеСырье,
	|	СУММА(ВТКоличествоИзделия.КоличествоУпаковокИзделие * ВТИнфоПоНорме.НормаНаШт) КАК НормаРасхода,
	|	МАКСИМУМ(Выбор когда ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Отменено Тогда 0 Иначе ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.КоличествоУпаковок конец) КАК ФактРасхода,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.Спецификация КАК Спецификация,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.ДатаПроизводства КАК ДатаПроизводства,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.КАНАТ_КомментарийКЗаказу КАК КомментарийКЗаказу,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.НомерСтроки КАК ОбеспечениеНомерСтроки
	|ИЗ
	|	Документ.ЭтапПроизводства2_2.ОбеспечениеМатериаламиИРаботами КАК ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИнфоПоНорме КАК ВТИнфоПоНорме
	|		ПО (ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.Спецификация = ВТИнфоПоНорме.СсылкаРесурснаяСпецификация)
	|			И (ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура = ВТИнфоПоНорме.Материал)
	|			И (ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Характеристика = ВТИнфоПоНорме.Характеристика)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКоличествоИзделия КАК ВТКоличествоИзделия
	|		ПО (ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка = ВТКоличествоИзделия.ЭтапПроизводства2_2Ссылка)
	|ГДЕ
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.ДатаПроизводства >= &ДатаНачала
	|	И ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.ДатаПроизводства <= &ДатаОкончания
	|
	|СГРУППИРОВАТЬ ПО
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.СтатьяКалькуляции,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Характеристика,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.НомерСтроки,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.КАНАТ_КомментарийКЗаказу,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.ДатаПроизводства,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.Спецификация,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.КоличествоУпаковок,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура.Артикул,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.КоличествоУпаковокФакт,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.Статус,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.ПартияПроизводства.ОсновноеИзделиеНоменклатура,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.ПартияПроизводства.ОсновноеИзделиеНоменклатура.Артикул,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.ПартияПроизводства.ОсновноеИзделиеХарактеристика,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.ПартияПроизводства.ОсновноеИзделиеНоменклатура.ЕдиницаИзмерения
	|
	|УПОРЯДОЧИТЬ ПО
	|	Этап,
	|	Изделие,
	|	ОбеспечениеНомерСтроки";
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);  
	
	Если ЗначениеЗаполнено(Подразделение) тогда
		СхемаЗапроса.ПакетЗапросов[2].Операторы[0].Отбор.Добавить("(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.Подразделение = &Подразделение)");
		Запрос.УстановитьПараметр("Подразделение", Подразделение);
	КонецЕсли;
	Если ЗначениеЗаполнено(СтатусЭтапа) тогда
		СхемаЗапроса.ПакетЗапросов[2].Операторы[0].Отбор.Добавить("(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.Статус В(&Статусы))");
		Запрос.УстановитьПараметр("Статусы", СтатусЭтапа);
	КонецЕсли;
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	Запрос.УстановитьПараметр("ДатаНачала", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Период.ДатаОкончания);
	
	

	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаТЧ = ФактическийРасход.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТекущимиДанными(Команда)
	ЗаполнитьТекущимиДаннымиНаСервере(); 
	УстановитьУсловноеОформление();
КонецПроцедуры

&НаСервере
Процедура ОтразитьФактНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЗ.Статус КАК Статус,
	|	ТЗ.УдалитьСтроку КАК УдалитьСтроку,
	|	ТЗ.ИзменитьСтроку КАК ИзменитьСтроку,   
	|	ТЗ.Этап КАК Этап,
	|	ТЗ.Изделие КАК Изделие,
	|	ТЗ.КодИзделия КАК КодИзделия,
	|	ТЗ.ХарактеристикаИзделия КАК ХарактеристикаИзделия,
	|	ТЗ.ЕдиницаИзмеренияИзделия КАК ЕдиницаИзмеренияИзделия,
	|	ТЗ.КоличествоИзделия КАК КоличествоИзделия,
	|	ТЗ.Сырье КАК Сырье,
	|	ТЗ.ХарактеристикаСырья КАК ХарактеристикаСырья,
	|	ТЗ.КодСырья КАК КодСырья,
	//|	ТЗ.Отменено КАК Отменено,
	|	ТЗ.Нормарасхода КАК Нормарасхода,
	|	ТЗ.ФактРасхода КАК ФактРасхода,
	|	ТЗ.Спецификация КАК Спецификация,
	|	ТЗ.ДатаРасхода КАК ДатаРасхода,
	|	ТЗ.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	ТЗ.ОбеспечениеНомерСтроки КАК ОбеспечениеНомерСтроки,
	|	ТЗ.ДатаПроизводства КАК ДатаПроизводства,
	|	ТЗ.КомментарийКЗаказу КАК КомментарийКЗаказу
	//|	ТЗ.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Статус КАК Статус,
	|	ВТ.УдалитьСтроку КАК УдалитьСтроку,
	|	ВТ.ИзменитьСтроку КАК ИзменитьСтроку, 
	|	ВТ.Этап КАК Этап,
	|	ВТ.Изделие КАК Изделие,
	|	ВТ.КодИзделия КАК КодИзделия,
	|	ВТ.ХарактеристикаИзделия КАК ХарактеристикаИзделия,
	|	ВТ.ЕдиницаИзмеренияИзделия КАК ЕдиницаИзмеренияИзделия,
	|	ВТ.КоличествоИзделия КАК КоличествоИзделия,
	|	ВТ.Сырье КАК Сырье,
	|	ВТ.ХарактеристикаСырья КАК ХарактеристикаСырья,
	|	ВТ.КодСырья КАК КодСырья,
	//|	ТЗ.Отменено КАК Отменено,
	|	ВТ.Нормарасхода КАК Нормарасхода,
	|	ВТ.ФактРасхода КАК ФактРасхода,
	|	ВТ.Спецификация КАК Спецификация,
	|	ВТ.ДатаРасхода КАК ДатаРасхода,
	|	ВТ.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	ВТ.ДатаПроизводства КАК ДатаПроизводства,
	|	ВТ.КомментарийКЗаказу КАК КомментарийКЗаказу,
	//|	ВТ.ИзделиеНомерСтроки КАК ИзделиеНомерСтроки,
	|	ВТ.ОбеспечениеНомерСтроки КАК ОбеспечениеНомерСтроки
	//|	ВТ.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ИЗ
	|	ВТ КАК ВТ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Этап,
	|	УдалитьСтроку
	|ИТОГИ ПО
	|	Этап";
	
	Запрос.УстановитьПараметр("ТЗ", ФактическийРасход.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаЭтапы = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);   
	ПричинаОтменыСсылка = Справочники.ПричиныОтменыПроизводства.НайтиПоНаименованию("АРМ",Истина);
	Если ПричинаОтменыСсылка = Справочники.ПричиныОтменыПроизводства.ПустаяСсылка() Тогда
		ПричинаОбъект = Справочники.ПричиныОтменыПроизводства.СоздатьЭлемент();
		ПричинаОбъект.Наименование = "АРМ";
		ПричинаОбъект.Записать();
		ПричинаОтменыСсылка = ПричинаОбъект.Ссылка;
	КонецЕсли;
	
	Пока ВыборкаЭтапы.Следующий() Цикл
		ДокументЭтап = ВыборкаЭтапы.Этап.ПолучитьОбъект();
		ВыборкаДетальныеЗаписи = ВыборкаЭтапы.Выбрать();   
		//МассивСтрокИзделий = Новый Массив;
		//МассивСтрокРасхода = Новый Массив; 
		ТребуетсяЗапись = Ложь;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
			Если НЕ ВыборкаДетальныеЗаписи.УдалитьСтроку И НЕ ВыборкаДетальныеЗаписи.ИзменитьСтроку тогда
				Продолжить;
			КонецЕсли;
			ТребуетсяЗапись = Истина;
			//СтрокаТЧРасходМатериаловИРабот = ДокументЭтап.РасходМатериаловИРабот.Найти("НомерСтроки",ВыборкаДетальныеЗаписи.РасходНомерСтроки); 
			//Если СтрокаТЧВыходныеИздения = Неопределено и НЕ ВыборкаДетальныеЗаписи.УдалитьСтроку Тогда  
			ПараметрыЗаполненияНазначений = ОбеспечениеПроизводства.ПараметрыДействияЗаполнитьНазначениеОбеспеченияВЭтапеПроизводства(
				ДокументЭтап, ДокументЭтап.ВыходныеИзделия);

			Если ВыборкаДетальныеЗаписи.ОбеспечениеНомерСтроки = 0 и НЕ ВыборкаДетальныеЗаписи.УдалитьСтроку Тогда  
				СтрокаТЧОбеспечениеМатериаламиИРаботами = ДокументЭтап.ОбеспечениеМатериаламиИРаботами.Добавить(); 
				ЗаполнитьЗначенияСвойств(СтрокаТЧОбеспечениеМатериаламиИРаботами,ДокументЭтап,,"Назначение");
				ЗаполнитьЗначенияСвойств(СтрокаТЧОбеспечениеМатериаламиИРаботами,ВыборкаДетальныеЗаписи); 
				
				СтрокаТЧОбеспечениеМатериаламиИРаботами.КоличествоУпаковок = ВыборкаДетальныеЗаписи.ФактРасхода;
				СтрокаТЧОбеспечениеМатериаламиИРаботами.Количество = ВыборкаДетальныеЗаписи.ФактРасхода;
				СтрокаТЧОбеспечениеМатериаламиИРаботами.Номенклатура = ВыборкаДетальныеЗаписи.Сырье;
				СтрокаТЧОбеспечениеМатериаламиИРаботами.Характеристика = ВыборкаДетальныеЗаписи.ХарактеристикаСырья;
				СтрокаТЧОбеспечениеМатериаламиИРаботами.СтатьяКалькуляции = ВыборкаДетальныеЗаписи.СтатьяКалькуляции; 
				СтрокаТЧОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;    
				СтрокаТЧОбеспечениеМатериаламиИРаботами.НазначениеОбеспечения = ПараметрыЗаполненияНазначений.НазначениеМатериалы;    
				//СтрокаТЧОбеспечениеМатериаламиИРаботами.Подразделение = ДокументЭтап.Подразделение;
				//СтрокаТЧОбеспечениеМатериаламиИРаботами.Спецификация =  ДокументЭтап.Спецификация;
				Цех = ПолучитьЦех(ДокументЭтап.Подразделение);  
				Если Цех <> Неопределено Тогда
				СтрокаТЧОбеспечениеМатериаламиИРаботами.Склад = Цех;
				КонецЕсли;

				
	//СтрокаТЧОбеспечениеМатериаламиИРаботами.ДатаРасхода = ВыборкаДетальныеЗаписи.ДатаПроизводства;
				//МассивСтрокИзделий.Добавить(СтрокаТЧВыходныеИздения); 
				
				//Обеспечение                                                   
				//ОтборСтрок = Новый Структура;                                    
				//ОтборСтрок.Вставить("Номенклатура",ВыборкаДетальныеЗаписи.Сырье);
				//ОтборСтрок.Вставить("Характеристика",ВыборкаДетальныеЗаписи.ХарактеристикаСырья);
				//СтрокаРасхода = ДокументЭтап.РасходМатериаловИРабот.НайтиСтроки();
				//Если ЗначениеЗаполнено(СтрокаОбеспечения) тогда
				//	СтрокаОбеспечения.КоличествоУпаковок =  ВыборкаДетальныеЗаписи.ФактРасхода;  
				//Иначе
				//	СтрокаОбеспечения = ДокументЭтап.РасходМатериаловИРабот.Добавить();
				//	ЗаполнитьЗначенияСвойств(СтрокаОбеспечения, ДокументЭтап.ОбеспечениеМатериаламиИРаботами[0],"Склад,ВариантОбеспечения,ДатаОтгрузки,Спецификация,Назначение,НазначениеОбеспечения,Обособленно,Подразделение,Упаковка");
				//	СтрокаОбеспечения.КоличествоУпаковок = ВыборкаДетальныеЗаписи.ФактРасхода;
				//	СтрокаОбеспечения.Номенклатура = ВыборкаДетальныеЗаписи.Сырье;
				//	СтрокаОбеспечения.Характеристика = ВыборкаДетальныеЗаписи.ХарактеристикаСырья;
				//	СтрокаОбеспечения.СтатьяКалькуляции = ВыборкаДетальныеЗаписи.СтатьяКалькуляции; 
				//	СтрокаОбеспечения.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;
				//КонецЕсли;
				
			ИначеЕсли ВыборкаДетальныеЗаписи.ОбеспечениеНомерСтроки <> 0 И ВыборкаДетальныеЗаписи.УдалитьСтроку Тогда  
				СтрокаТЧОбеспечениеМатериаламиИРаботами = ДокументЭтап.ОбеспечениеМатериаламиИРаботами[ВыборкаДетальныеЗаписи.ОбеспечениеНомерСтроки-1];
				СтрокаТЧОбеспечениеМатериаламиИРаботами.Отменено = Истина;  
				СтрокаТЧОбеспечениеМатериаламиИРаботами.ПричинаОтмены = ПричинаОтменыСсылка;
				//ДокументЭтап.ОбеспечениеМатериаламиИРаботами.Удалить(ВыборкаДетальныеЗаписи.ОбеспечениеНомерСтроки-1);
				//Обеспечение
				//СтрокаОбеспечения = ДокументЭтап.РасходМатериаловИРабот.Найти(ВыборкаДетальныеЗаписи.Сырье,"Номенклатура");
				//Если ЗначениеЗаполнено(СтрокаРасхода) тогда
				//	ДокументЭтап.РасходМатериаловИРабот.Удалить(СтрокаРасхода);
				//КонецЕсли;
				
			ИначеЕсли ВыборкаДетальныеЗаписи.ОбеспечениеНомерСтроки <> 0 Тогда 
				СтрокаТЧОбеспечениеМатериаламиИРаботами = ДокументЭтап.ОбеспечениеМатериаламиИРаботами[ВыборкаДетальныеЗаписи.ОбеспечениеНомерСтроки-1];
				СтрокаТЧОбеспечениеМатериаламиИРаботами.КоличествоУпаковок = ВыборкаДетальныеЗаписи.ФактРасхода;
				СтрокаТЧОбеспечениеМатериаламиИРаботами.Количество = ВыборкаДетальныеЗаписи.ФактРасхода;
				СтрокаТЧОбеспечениеМатериаламиИРаботами.Номенклатура = ВыборкаДетальныеЗаписи.Сырье;
				СтрокаТЧОбеспечениеМатериаламиИРаботами.Характеристика = ВыборкаДетальныеЗаписи.ХарактеристикаСырья;
				СтрокаТЧОбеспечениеМатериаламиИРаботами.СтатьяКалькуляции = ВыборкаДетальныеЗаписи.СтатьяКалькуляции;
				СтрокаТЧОбеспечениеМатериаламиИРаботами.Отменено = Ложь;
				СтрокаТЧОбеспечениеМатериаламиИРаботами.ПричинаОтмены = Неопределено;
				//Обеспечение
				//СтрокаРасхода = ДокументЭтап.РасходМатериаловИРабот.Найти(ВыборкаДетальныеЗаписи.Сырье,"Номенклатура");
				//Если ЗначениеЗаполнено(СтрокаРасхода) тогда
				//	СтрокаРасхода.КоличествоУпаковок =  ВыборкаДетальныеЗаписи.ФактРасхода;
				//КонецЕсли;
			Иначе
				ОбщегоНазначения.СообщитьПользователю("Попало в Иначе (удалить строку номер ноль). Ошибка со строками у "+ВыборкаЭтапы.Этап+" - стр."+ВыборкаДетальныеЗаписи.ОбеспечениеНомерСтроки);
			КонецЕсли;
			
		КонецЦикла;      
		
		//////////////////
		Если ТребуетсяЗапись Тогда  
			/////Заполню расход по данным обеспечения
			//ТаблицаИдендификаторов = ДокументЭтап.РасходМатериаловИРабот.ВыгрузитьКолонки("Номенклатура, Характеристика, ИдентификаторСтроки");
			//ДокументЭтап.РасходМатериаловИРабот.Очистить();
			//Для каждого СтрокаОбеспечения из ДокументЭтап.ОбеспечениеМатериаламиИРаботами Цикл
			//	Если СтрокаОбеспечения.Отменено Тогда
			//		Продолжить;
			//	КонецЕсли;
			//	ДобавляемаяСтрока = ДокументЭтап.РасходМатериаловИРабот.Добавить();
			//	ЗаполнитьЗначенияСвойств(ДобавляемаяСтрока,СтрокаОбеспечения,,"ИдентификаторСтроки"); 
			//	ДобавляемаяСтрока.ДатаРасхода = ДокументЭтап.ДатаПроизводства; 
			//	//ОтборСтрок = Новый Структура;                                    
			//	//ОтборСтрок.Вставить("Номенклатура",СтрокаОбеспечения.Номенклатура);
			//	//ОтборСтрок.Вставить("Характеристика",СтрокаОбеспечения.Характеристика);				
			//	//МассивПодходящих = ТаблицаИдендификаторов.НайтиСтроки(ОтборСтрок);
			//	//Если ТаблицаИдендификаторов.Количество() Тогда
			//	//	ДобавляемаяСтрока.ИдентификаторСтроки = МассивПодходящих[0].ИдентификаторСтроки;
			//	//	ТаблицаИдендификаторов.Удалить(МассивПодходящих[0]);                            
			//	
			Документы.ЭтапПроизводства2_2.ЗаполнитьРасходМатериаловИРаботПоДаннымОбеспечения(ДокументЭтап, 0); 
			//  Режим - Число - 0 => заполнение происходит только по данным обеспечения (расход предварительно очищается),
			//          1 => к расходу добавляются данные из обеспечения,
			//          2 => расход корректируется (синхронизируется) по данным обеспечения.
			//
			
			ДокументЭтап.Записать(РежимЗаписиДокумента.Проведение);
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Изменён %1",ВыборкаЭтапы.Этап)); 
		КонецЕсли;
	КонецЦикла;


КонецПроцедуры

&НаКлиенте
Процедура ОтразитьФакт(Команда)
	ОтразитьФактНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьПоСпецификацииНаСервере()
	

КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьПоСпецификации(Команда)
		ПараметрыОткрытия = Новый Структура;
	
	
	ПараметрыОткрытия.Вставить("ГруппаФинУчета", ПолучитьГруппуФинУчета());	 
	ПараметрыОткрытия.Вставить("ЗакрыватьПослеВыбора", Истина);
	ОткрытьФорму("Справочник.РесурсныеСпецификации.ФормаВыбора",
	ПараметрыОткрытия,
	ЭтотОбъект,,,,,
	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	
	ПерезаполнитьПоСпецификацииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьУсловноеОформление();
КонецПроцедуры

&НаСервере
Функция ПолучитьЦех(ПодразделениеСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Склады.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	Склады.Подразделение = &Подразделение
	|	И Склады.ЦеховаяКладовая = ИСТИНА";
	
	Запрос.УстановитьПараметр("Подразделение", ПодразделениеСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ВыборкаДетальныеЗаписи.Следующий();
		Возврат ВыборкаДетальныеЗаписи.Ссылка;  
		
	Иначе 
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	УсловноеОформление.Элементы.Очистить();

	//Сначала задам поля которые редактировать нельзя всегда 
	//Отбор укажу через ИЛИ два условия, одно из которых всегда выполняется. так элемент оформления будет применяться всегда
	ЭлементОформления = УсловноеОформление.Элементы.Добавить(); 
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина); 
	ГруппаОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ФактическийРасход.ИзменитьСтроку"); // имя поля
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Ложь;  
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ФактическийРасход.ИзменитьСтроку"); // имя поля
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Истина; 
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходСтатус");	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходИзделие");	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходКодИзделия");	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходХарактеристика");
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходУпаковкиЕдиницыИзмерения");	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходКоличество");	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходКодСырья");	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходНормаРасхода");
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходСпецификация");	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходДатаПроизводства");	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходКомментарийКЗаказу");	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходДобавленнаяСтрока");	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходСтатьяКалькуляции");
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходДатаРасхода");	
	////////////////////////
	
	//У Основного сырья нельзя ставить удаление
	ЭлементОформления = УсловноеОформление.Элементы.Добавить(); 
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина); 
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ФактическийРасход.ОсновноеСырье"); // имя поля
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Истина;   	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходУдалитьСтроку");	

	//Если поставили признак менять строку, то можно менять количество
	ЭлементОформления = УсловноеОформление.Элементы.Добавить(); 
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина); 
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ФактическийРасход.ИзменитьСтроку"); // имя поля
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Ложь;   	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходФактРасхода");	

	
	//Если поставили менять строку у вспомогательного сырья, то можно менять ещё и само сырьё
	ЭлементОформления = УсловноеОформление.Элементы.Добавить(); 
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);  
	ГруппаОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ФактическийРасход.ИзменитьСтроку"); // имя поля
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Ложь;  
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ФактическийРасход.ОсновноеСырье"); // имя поля
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Истина; 
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходСырье");	
	
	
	//Выделаем цветом отменённые строки серым (которые уже были заранее отменены)
	ЭлементОформления = УсловноеОформление.Элементы.Добавить(); 
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаНевыбраннойКартинки);
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ФактическийРасход.Отменено"); // имя поля
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Истина; 
	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходНормаРасхода");
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходФактРасхода");
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходСтатус");	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходИзделие");	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходКодИзделия");	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходХарактеристика");
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходУпаковкиЕдиницыИзмерения");	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходКоличество");	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходКодСырья");	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходНормаРасхода");
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходСпецификация");	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходДатаПроизводства");	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходКомментарийКЗаказу");	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходДобавленнаяСтрока");	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходСтатьяКалькуляции");
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходДатаРасхода");
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходСырье");
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходЭтап");
		////////////////////////

	//Выделаем цветом расхождения с нормой
	ЭлементОформления = УсловноеОформление.Элементы.Добавить(); 
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.СтатусОбработкиОшибкаПередачиГосИС);
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ФактическийРасход.ФактическийРасходНормаРасхода"); // имя поля
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно; 
	ЭлементОтбора.ПравоеЗначение = Новый ПолеКомпоновкиДанных("ФактическийРасход.ФактическийРасходФактРасхода"); 
	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходНормаРасхода");
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходФактРасхода");
		////////////////////////

КонецПроцедуры

&НаКлиенте
Процедура ФактическийРасходИзменитьСтрокуПриИзменении(Элемент)  
	ВключилиИзменение = Элементы.ФактическийРасход.ТекущиеДанные.ИзменитьСтроку;
	
	Если ВключилиИзменение Тогда 
		Элементы.ФактическийРасход.ТекущиеДанные.УдалитьСтроку = Ложь;
		//Элементы.ФактическийРасход.ТекущийЭлемент = Элементы.ФактическийРасход.ФактРасхода;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФактическийРасходУдалитьСтрокуПриИзменении(Элемент) 
	УдаляютСтроку = Элементы.ФактическийРасход.ТекущиеДанные.УдалитьСтроку;
	
	Если УдаляютСтроку Тогда 
		Элементы.ФактическийРасход.ТекущиеДанные.ИзменитьСтроку = Ложь;                
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФактическийРасходПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	
КонецПроцедуры

&НаКлиенте
Процедура ФактическийРасходПриИзменении(Элемент)
	
	
КонецПроцедуры

&НаКлиенте
Процедура ФактическийРасходПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если Копирование Тогда
		Элементы.ФактическийРасход.ТекущиеДанные.УдалитьСтроку = Ложь;
		Элементы.ФактическийРасход.ТекущиеДанные.ИзменитьСтроку = Истина;
	КонецЕсли;
	
	Если НоваяСтрока Тогда
		Элементы.ФактическийРасход.ТекущиеДанные.ОбеспечениеНомерСтроки = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФактическийРасходСырьеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;        
	
	ПараметрыОткрытия = Новый Структура;
	
	
	ПараметрыОткрытия.Вставить("ГруппаФинУчета", ПолучитьГруппуФинУчета());
	ПараметрыОткрытия.Вставить("Склад", ПолучитьЦех(ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Элементы.ФактическийРасход.ТекущиеДанные.Этап,"Подразделение")));
	ПараметрыОткрытия.Вставить("ЗакрыватьПослеВыбора", Истина);
	ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
	
	ОткрытьФорму("Справочник.Номенклатура.Форма.КАНАТ_ФормаВыбораВспомогательногоСырья",
	ПараметрыОткрытия,
	Элемент,,,,,
	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	
КонецПроцедуры     

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора) 

	//Если ИсточникВыбора.ИмяФормы = "Справочник.Номенклатура.Форма.КАНАТ_ФормаВыбораВспомогательногоСырья" 
	//	И ЗначениеЗаполнено(ВыбранноеЗначение) 
	//	И ИсточникВыбора.ОписаниеОповещенияОЗакрытии = Неопределено Тогда
	//	Элементы.ФактическийРасход.ТекущиеДанные.Сырье = ВыбранноеЗначение;	
	//    Элементы.ФактическийРасход.ТекущиеДанные.КодСырья = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(ВыбранноеЗначение, "Артикул");
	//	Элементы.ФактическийРасход.ТекущиеДанные.НормаРасхода = 0; 
	//Иначе
	Если ИсточникВыбора.ИмяФормы = "Справочник.РесурсныеСпецификации.Форма.ФормаВыбора" И ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		СтруктураДанныхПоСпецификации = ПолучитьДанныеПоСпецификации(ВыбранноеЗначение);
		
		Элементы.ФактическийРасход.ТекущиеДанные.УдалитьСтроку = Ложь;
		Элементы.ФактическийРасход.ТекущиеДанные.ИзменитьСтроку = Истина;
		Элементы.ФактическийРасход.ТекущиеДанные.Спецификация = ВыбранноеЗначение;
		ЗаполнитьЗначенияСвойств(Элементы.ФактическийРасход.ТекущиеДанные,СтруктураДанныхПоСпецификации);
		//Элементы.ФактическийРасход.ТекущиеДанные.Сырье = 
	КонецЕсли;
	
КонецПроцедуры    


&НаСервере
Функция ПолучитьДанныеПоСпецификации(СсылкаСпецификация)
	
	Структура = Новый Структура;  
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РесурсныеСпецификацииМатериалыИУслуги.Номенклатура КАК Номенклатура,
		|	РесурсныеСпецификацииМатериалыИУслуги.Номенклатура.Артикул КАК КодСырья
		|ИЗ
		|	Справочник.РесурсныеСпецификации.МатериалыИУслуги КАК РесурсныеСпецификацииМатериалыИУслуги
		| Где РесурсныеСпецификацииМатериалыИУслуги.Ссылка = &СсылкаСпецификация";
	Запрос.УстановитьПараметр("СсылкаСпецификация",СсылкаСпецификация);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	Структура.Вставить("Сырье",ВыборкаДетальныеЗаписи.Номенклатура);
	Структура.Вставить("КодСырья",ВыборкаДетальныеЗаписи.КодСырья);
	КонецЕсли;
	
	Возврат Структура;
	
КонецФункции

&НаСервере
Функция ПолучитьГруппуФинУчета()             
	
	//УстановитьПривилегированныйРежим(Истина);	
	//Возврат Константы.КАНАТ_ГруппаФинУчетаВспомогательноеСырье.Получить();
	//УстановитьПривилегированныйРежим(Ложь);	

		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГруппыФинансовогоУчетаНоменклатуры.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ГруппыФинансовогоУчетаНоменклатуры КАК ГруппыФинансовогоУчетаНоменклатуры
		|ГДЕ
		|	ГруппыФинансовогоУчетаНоменклатуры.КАНАТ_ГруппаФинансовогоУчетаВспомогательногоСырья = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	
КонецФункции

&НаКлиенте
Процедура ДобавитьКЭтапу(Команда)   
    описаниеОповещения = Новый ОписаниеОповещения("ДобавитьКЭтапуЗавершение",ЭтотОбъект);
	
	ПараметрыОткрытия = Новый Структура;
	
	ПараметрыОткрытия.Вставить("ГруппаФинУчета", ПолучитьГруппуФинУчета());
	ПараметрыОткрытия.Вставить("Склад", ПолучитьЦех(ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Элементы.ФактическийРасход.ТекущиеДанные.Этап,"Подразделение")));
	ПараметрыОткрытия.Вставить("ЗакрыватьПослеВыбора", Истина);
	
	ОткрытьФорму("Справочник.Номенклатура.Форма.КАНАТ_ФормаВыбораВспомогательногоСырья",
	ПараметрыОткрытия,
	ЭтотОбъект,,,,ОписаниеОповещения,
	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
       
КонецПроцедуры    

&НаСервере
Функция ПолучитьСтатьюКалькуляции()             
		
УстановитьПривилегированныйРежим(Истина);
Возврат Константы.КАНАТ_СтатьяКалькуляцииВспомогательноеСырье.Получить();
	
КонецФункции


&НаКлиенте
Процедура ДобавитьКЭтапуЗавершение(РезультатЗакрытия,ДополнительныеПараметры)   Экспорт
	
	Если ЗначениеЗаполнено(РезультатЗакрытия) Тогда  
		//Индекс = Элементы.ФактическийРасход.ТекущаяСтрока; 
		НоваяСтрока = ФактическийРасход.Добавить();    
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Элементы.ФактическийРасход.ТекущиеДанные,
		"ДатаПроизводства,	
		| ЕдиницаИзмеренияИзделия,	
		| Изделие,	
		| КодИзделия,	
		| КоличествоИзделия,	
		| КомментарийКЗаказу,	
		| Статус,	
		| ХарактеристикаИзделия,	
		| Этап,
		| СтатьяКалькуляции,
		| ДатаРасхода,
		|Спецификация");
		
		НоваяСтрока.Сырье = РезультатЗакрытия;
		НоваяСтрока.КодСырья = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(РезультатЗакрытия, "Артикул");    
		НоваяСтрока.СтатьяКалькуляции = ПолучитьСтатьюКалькуляции();
		НоваяСтрока.ИзменитьСтроку = Истина; 
		//ЭтаФорма.ТекущийЭлемент = Элементы.ФактическийРасход[Индекс].ФактРасхода;
		
	КонецЕсли;
	
КонецПроцедуры 	

&НаКлиенте
Процедура ФактическийРасходПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьЭтап(Команда)
ОткрытьФорму("Документ.ЭтапПроизводства2_2.Форма.ФормаДокумента",Новый Структура("Ключ",Элементы.ФактическийРасход.ТекущиеДанные.Этап));

КонецПроцедуры

&НаКлиенте
Процедура ФактическийРасходСырьеОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Номенклатура")
		И ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		СтрокаТабличнойЧасти = Элементы.ФактическийРасход.ТекущиеДанные;
		СтрокаТабличнойЧасти.Сырье = ВыбранноеЗначение;	
		СтрокаТабличнойЧасти.КодСырья = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(ВыбранноеЗначение, "Артикул");
		СтрокаТабличнойЧасти.НормаРасхода = 0;         
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ФактическийРасходПриАктивизацииСтроки(Элемент)   
	Если ФактическийРасход.Количество()>0 И Элементы.ФактическийРасход.ТекущиеДанные <> Неопределено Тогда
	Элементы.ФактическийРасходКонтекстноеМенюСкопировать.Доступность = НЕ Элементы.ФактическийРасход.ТекущиеДанные.ОсновноеСырье;
	КонецЕсли;
КонецПроцедуры

