
&НаСервере
&Вместо("ЗаполнитьНазначениеПлатежа")
Процедура КАНАТ_ЗаполнитьНазначениеПлатежа()
	
	ДокументОснование = Объект.ДокументОснование;
	
	//++ Гурьев 28.09.23 ЧТЗ_2_11_4 Изменен вывод, если документ основание - заказ клиента.
	//Изменен текст назначения для счета на оплату
	
	Если НЕ ПустаяСтрока(ДокументОснование) И НЕ ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		Объект.НазначениеПлатежа = Документы.СчетНаОплатуКлиенту.СформироватьНазначениеПлатежа(
			ДокументОснование.Номер,
			ДокументОснование);
	Иначе
		НазначениеПлатежа = НСтр("ru = 'Оплата по счету № %НомерСчета%';
								|en = 'By account No.%НомерСчета%'");
		НазначениеПлатежа = СтрЗаменить(НазначениеПлатежа, 
			"%НомерСчета%", 
		ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Объект.Номер));
		Объект.НазначениеПлатежа = НазначениеПлатежа;
	КонецЕсли;
	
	//-- Гурьев 28.09.23 ЧТЗ_2_11_4
	

КонецПроцедуры

&НаСервере
Процедура КАНАТ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//++ Гурьев 09.11.23 ЧТЗ_2_11_4
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		КАНАТ_ЗаполнитьНазначениеПлатежа();
	КонецЕсли;
	//-- Гурьев 09.11.23 ЧТЗ_2_11_4
	//БИТ_Гурьев__22.07.24++
	ГруппаФормаОплаты = ЭтаФорма.Элементы.Добавить("ГруппаОбычная", Тип("ГруппаФормы"),Элементы.ГруппаЭтапыГрафикаОплаты);
	ГруппаФормаОплаты.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаФормаОплаты.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаФормаОплаты.ОтображатьЗаголовок = ЛОЖЬ; 
	ГруппаФормаОплаты.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	Элементы.Переместить(ГруппаФормаОплаты, Элементы.ГруппаЭтапыГрафикаОплаты, Элементы.ЭтапыГрафикаОплаты);
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("КАНАТ_ИспользоватьФормуОплаты", Тип("ПолеФормы"),ГруппаФормаОплаты);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	НовыйЭлемент.ПутьКДанным = "Объект.КАНАТ_ИспользоватьФормуОплаты";
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "КАНАТ_ИспользоватьФормуОплатыПриИзменении");
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("КАНАТ_ФормаОплаты", Тип("ПолеФормы"),ГруппаФормаОплаты);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.КАНАТ_ФормаОплаты";
	
	КАНАТ_ОбновитьДоступностьФормыОплаты();
	
	//БИТ_Гурьев__22.07.24--
КонецПроцедуры

&НаСервере
Процедура КАНАТ_ОбновитьДоступностьФормыОплаты()
	
	Если Объект.КАНАТ_ИспользоватьФормуОплаты Тогда
		Элементы.КАНАТ_ФормаОплаты.Доступность = Истина;
		Если Не ЗначениеЗаполнено(Объект.КАНАТ_ФормаОплаты) Тогда
			Объект.КАНАТ_ФормаОплаты = "Оплата по договору";
		КонецЕсли;
	Иначе
		Элементы.КАНАТ_ФормаОплаты.Доступность = Ложь;
		Объект.КАНАТ_ФормаОплаты = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КАНАТ_ИспользоватьФормуОплатыПриИзменении(Элемент)
	
	КАНАТ_ОбновитьДоступностьФормыОплаты();
	
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ЗаполнитьНазначениеПлатежа")
Процедура КАНАТ_ЗаполнитьНазначениеПлатежа1()

	ДокументОснование = Объект.ДокументОснование;

	Если НЕ ПустаяСтрока(ДокументОснование) Тогда
		Объект.НазначениеПлатежа = Документы.СчетНаОплатуКлиенту.СформироватьНазначениеПлатежа(
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "Номер"),
		ДокументОснование);
	Иначе  
		#Удаление
		НазначениеПлатежа = НСтр("ru = 'По счету № %НомерСчета% от %ДатаСчета%';
		|en = 'By account No.%НомерСчета% from %ДатаСчета%'");
		НазначениеПлатежа = СтрЗаменить(НазначениеПлатежа, 
		"%НомерСчета%", 
		ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Объект.Номер));
		НазначениеПлатежа = СтрЗаменить(НазначениеПлатежа, "%ДатаСчета%", Формат(Объект.Дата, "ДЛФ=D"));
		#КонецУдаления 
		#Вставка
		НазначениеПлатежа = НСтр("ru = 'Оплата по счету № %НомерСчета%';
								|en = 'By account No.%НомерСчета%'");
		НазначениеПлатежа = СтрЗаменить(НазначениеПлатежа, 
			"%НомерСчета%", 
		ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Объект.Номер));	
		#КонецВставки
		Объект.НазначениеПлатежа = НазначениеПлатежа;
	КонецЕсли;

КонецПроцедуры
