// <+БИТ> Руденков_Е.И. 23.07.2024  
// ЧТЗ ШК-1 Канат Процесс штрихкодирования  
&ИзменениеИКонтроль("ЗарегистрироватьИзмененияДляАвтономногоРежимаРегистрыПриЗаписи")
Процедура КАНАТ_ЗарегистрироватьИзмененияДляАвтономногоРежимаРегистрыПриЗаписи(Источник, Отказ, Замещение)
	#Вставка
	Если ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.ШтрихкодыНоменклатуры")
		Или ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.СнимкиОтчетов") 
		Или ТипЗнч(Источник) = Тип("СправочникОбъект.ВариантыОтчетов")
		Или ТипЗнч(Источник) = Тип("СправочникОбъект.ВидыНоменклатуры")
		Или ТипЗнч(Источник) = Тип("СправочникОбъект.ДашбордыМЦП")
		Или ТипЗнч(Источник) = Тип("СправочникОбъект.Назначения")
		Или ТипЗнч(Источник) = Тип("СправочникОбъект.Номенклатура")
		Или ТипЗнч(Источник) = Тип("СправочникОбъект.Пользователи")
		Или ТипЗнч(Источник) = Тип("СправочникОбъект.СкладскиеПомещения")
		Или ТипЗнч(Источник) = Тип("СправочникОбъект.СкладскиеЯчейки")
		Или ТипЗнч(Источник) = Тип("СправочникОбъект.Склады")
		Или ТипЗнч(Источник) = Тип("СправочникОбъект.УпаковкиЕдиницыИзмерения")
		Или ТипЗнч(Источник) = Тип("СправочникОбъект.ХарактеристикиНоменклатуры")
		Или ТипЗнч(Источник) = Тип("ДокументОбъект.ОтборРазмещениеТоваров")
		Или ТипЗнч(Источник) = Тип("ДокументОбъект.ПриходныйОрдерНаТовары")
		Или ТипЗнч(Источник) = Тип("ДокументОбъект.РасходныйОрдерНаТовары") Тогда
		
		Возврат;	
	КонецЕсли;
	#КонецВставки
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);

	УзлыДляРегистрации = УзлыДляРегистрации();

	ЗарегистрироватьИзмененияДляУзловОбменаРегистры(УзлыДляРегистрации, Источник);

КонецПроцедуры

&ИзменениеИКонтроль("ЗарегистрироватьИзмененияДляАвтономногоРежимаПриЗаписи")
Процедура КАНАТ_ЗарегистрироватьИзмененияДляАвтономногоРежимаПриЗаписи(Источник, Отказ)

	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	#Вставка
	Если ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.ШтрихкодыНоменклатуры")
		Или ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.СнимкиОтчетов") 
		Или ТипЗнч(Источник) = Тип("СправочникОбъект.ВариантыОтчетов")
		Или ТипЗнч(Источник) = Тип("СправочникОбъект.ВидыНоменклатуры")
		Или ТипЗнч(Источник) = Тип("СправочникОбъект.ДашбордыМЦП")
		Или ТипЗнч(Источник) = Тип("СправочникОбъект.Назначения")
		Или ТипЗнч(Источник) = Тип("СправочникОбъект.Номенклатура")
		Или ТипЗнч(Источник) = Тип("СправочникОбъект.Пользователи")
		Или ТипЗнч(Источник) = Тип("СправочникОбъект.СкладскиеПомещения")
		Или ТипЗнч(Источник) = Тип("СправочникОбъект.СкладскиеЯчейки")
		Или ТипЗнч(Источник) = Тип("СправочникОбъект.Склады")
		Или ТипЗнч(Источник) = Тип("СправочникОбъект.УпаковкиЕдиницыИзмерения")
		Или ТипЗнч(Источник) = Тип("СправочникОбъект.ХарактеристикиНоменклатуры")
		Или ТипЗнч(Источник) = Тип("ДокументОбъект.ОтборРазмещениеТоваров")
		Или ТипЗнч(Источник) = Тип("ДокументОбъект.ПриходныйОрдерНаТовары")
		Или ТипЗнч(Источник) = Тип("ДокументОбъект.РасходныйОрдерНаТовары") Тогда
		
		Возврат;	
	КонецЕсли;
	#КонецВставки
	
	УстановитьПривилегированныйРежим(Истина);

	Если ТипЗнч(Источник) = Тип("СправочникОбъект.ВариантыОтчетов") Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Вариант", Источник.Ссылка);
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СнимкиОтчетов.Вариант КАК Вариант
		|ИЗ
		|	РегистрСведений.СнимкиОтчетов КАК СнимкиОтчетов
		|ГДЕ
		|	СнимкиОтчетов.Вариант = &Вариант";
		Если Запрос.Выполнить().Пустой() Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;

	УзлыДляРегистрации = УзлыДляРегистрации();

	ЗарегистрироватьИзмененияДляУзловОбмена(УзлыДляРегистрации, Источник);

КонецПроцедуры // <-БИТ> Руденков_Е.И. 23.07.2024
