
&НаКлиенте
Процедура КоличествоФактОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	Адрес = АдресЗначенияВХранилище(Число(Текст));
	ОповеститьОВыборе(Адрес);
	
КонецПроцедуры

&НаСервере
Функция АдресЗначенияВХранилище(ВведенноеЧисло)
	
	Возврат ПоместитьВоВременноеХранилище(ВведенноеЧисло,УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("КоличествоФакт") Тогда
		КоличествоФакт = Параметры.КоличествоФакт;
	КонецЕсли;
	
КонецПроцедуры
