// <+БИТ> Руденков_Е.И. 25.07.2024  
// ЧТЗ ШК-1 Канат Процесс штрихкодирования
Процедура ЗаписатьВторичныеДанныеПлановыхНачисленийПриОтменеПроведенияДокумента(Источник, Отказ) Экспорт
	
	Если ТипЗнч(Источник) = Тип("СправочникОбъект.СерииНоменклатуры")
		Или ТипЗнч(Источник) = Тип("СправочникСсылка.СерииНоменклатуры") Тогда
		
		Штрихкод		= Источник.Номер;
		Номенклатура	= Источник.КАНАТ_Номенклатура;
		Характеристика	= Источник.КАНАТ_Характеристика;
		Упаковка		= Источник.КАНАТ_Упаковка;
		Серия			= Источник.Ссылка;
		
		Если Не ЗначениеЗаполнено(Характеристика)
			Или Не ЗначениеЗаполнено(Номенклатура) Тогда
			Возврат;	
		КонецЕсли;
		
		МассивЗаписей = Новый Массив;
		МассивЗаписей.Добавить(Новый Структура("Штрихкод,Номенклатура,Характеристика,Упаковка,КАНАТ_Серия",
												Штрихкод,Номенклатура,Характеристика,Упаковка,Серия));
												
		РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьЗаписьВРегистр(МассивЗаписей);
	КонецЕсли;
	
КонецПроцедуры // <-БИТ> Руденков_Е.И. 25.07.2024
