
&НаСервере
Процедура КАНАТ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//++ 26.09.23 Гурьев ЧТЗ_2.10
	ГруппаКАНАТ_ДопДанные = Элементы.Добавить(
		"КАНАТ_ДопДанные",
		Тип("ГруппаФормы"),
		Элементы.ГруппаТоварныйРазделКолонки);
		
	ГруппаКАНАТ_ДопДанные.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаКАНАТ_ДопДанные.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаКАНАТ_ДопДанные.ОтображатьЗаголовок = Ложь;
	
	ПолеКАНАТ_ФИОСопроводителя = Элементы.Добавить("КАНАТ_ФИОСопроводителя", Тип("ПолеФормы"), Элементы.КАНАТ_ДопДанные);
	ПолеКАНАТ_ФИОСопроводителя.Заголовок = "ФИО Сопроводителя"; 
	ПолеКАНАТ_ФИОСопроводителя.ПутьКДанным = "Объект.КАНАТ_ФИОСопроводителя";
	ПолеКАНАТ_ФИОСопроводителя.Вид = ВидПоляФормы.ПолеВвода;
	//-- 26.09.23 Гурьев
КонецПроцедуры
