
&ИзменениеИКонтроль("ПриОпределенииСправочниковДляЗагрузкиДанных")
Процедура КАНАТ_ПриОпределенииСправочниковДляЗагрузкиДанных(ЗагружаемыеСправочники)

	Если ПолучитьФункциональнуюОпцию("ИспользоватьПартнеровКакКонтрагентов") Тогда

		ПараметрыПоиска = Новый Структура;
		ПараметрыПоиска.Вставить("ПолноеИмя", Метаданные.Справочники.Партнеры.ПолноеИмя());
		НайденнныеСтроки = ЗагружаемыеСправочники.НайтиСтроки(ПараметрыПоиска);
        #Удаление
		Если НайденнныеСтроки.Количество() > 0 Тогда
			НайденнныеСтроки[0].Представление      = Метаданные.Справочники.Контрагенты.Представление();
			НайденнныеСтроки[0].ПрикладнаяЗагрузка = Истина;
		КонецЕсли;
		#КонецУдаления
		ПараметрыПоиска = Новый Структура;
		ПараметрыПоиска.Вставить("ПолноеИмя", Метаданные.Справочники.Контрагенты.ПолноеИмя());
		НайденнныеСтроки = ЗагружаемыеСправочники.НайтиСтроки(ПараметрыПоиска); 

		Если НайденнныеСтроки.Количество() > 0 Тогда

			ЗагружаемыеСправочники.Удалить(ЗагружаемыеСправочники.Индекс(НайденнныеСтроки[0])) ;

		КонецЕсли;

	КонецЕсли;

	Сведения = ЗагружаемыеСправочники.Добавить();
	Сведения.ПолноеИмя = Метаданные.Справочники.Номенклатура.ПолноеИмя();
	Сведения.Представление = Метаданные.Справочники.Номенклатура.Представление();
	Сведения.ПрикладнаяЗагрузка = Истина;

КонецПроцедуры
