// <+БИТ> Руденков_Е.И. 22.07.2024  
// ЧТЗ ШК-1 Канат Процесс штрихкодирования
&НаСервереБезКонтекста
Функция ПолучитьЕдиницуИзмеренияНоменклатуры(НоменклатураСсылка)
	  Возврат НоменклатураСсылка.ЕдиницаИзмерения;
КонецФункции 

&НаСервере
&ИзменениеИКонтроль("СохранитьСериюПоСтроке")
Процедура КАНАТ_СохранитьСериюПоСтроке(ИдентификаторСтроки, ИспользуемыеРеквизитыСерии)

	Если Не ПравоДобавленияСерий Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗнч(ИдентификаторСтроки) <> Тип("ДанныеФормыЭлементКоллекции") Тогда
		СтрокаТаблицы = Объект.Серии.НайтиПоИдентификатору(ИдентификаторСтроки);
	Иначе
		СтрокаТаблицы = ИдентификаторСтроки; 
	КонецЕсли;

	СправочникОбъект = Неопределено;
	Если Не ЗначениеЗаполнено(СтрокаТаблицы.Серия) Тогда

		СправочникОбъект = Справочники.СерииНоменклатуры.СоздатьЭлемент();
		СправочникОбъект.ВидНоменклатуры = НастройкиИспользованияСерий.ВладелецСерий;

	КонецЕсли;

	Если УправлениеСвойствамиУТ.ЕстьДопРеквизитыВТаблице(ЭтотОбъект, "Объект.Серии") Тогда
		Если СправочникОбъект = Неопределено Тогда
			СправочникОбъект = СтрокаТаблицы.Серия.ПолучитьОбъект();
		КонецЕсли;
		УправлениеСвойствамиУТ.ПеренестиДополнительныеРеквизитыИзФормыВОбъект(СправочникОбъект, ЭтотОбъект, СтрокаТаблицы, "Объект.Серии");
	КонецЕсли;

	Если Не ПустаяСтрока(ИспользуемыеРеквизитыСерии) Тогда
		Если СправочникОбъект = Неопределено Тогда
			РеквизитыСерии = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаТаблицы.Серия, ИспользуемыеРеквизитыСерии);
			РеквизитыСтроки = Новый Структура(ИспользуемыеРеквизитыСерии);
			ЗаполнитьЗначенияСвойств(РеквизитыСтроки, СтрокаТаблицы, ИспользуемыеРеквизитыСерии);
			Если Не ОбщегоНазначения.ДанныеСовпадают(РеквизитыСерии, РеквизитыСтроки) Тогда
				СправочникОбъект = СтрокаТаблицы.Серия.ПолучитьОбъект();
				ЗаполнитьЗначенияСвойств(СправочникОбъект, СтрокаТаблицы, ИспользуемыеРеквизитыСерии);
			КонецЕсли;
		Иначе
			ЗаполнитьЗначенияСвойств(СправочникОбъект, СтрокаТаблицы, ИспользуемыеРеквизитыСерии);
		КонецЕсли;
	КонецЕсли;
	
	#Вставка
	//Сквозное штрихкодирование
	Если СправочникОбъект <> Неопределено Тогда
		СправочникОбъект.КАНАТ_Номенклатура			= ЗначенияПолейСвязи.Номенклатура;
		СправочникОбъект.КАНАТ_Характеристика		= ЗначенияПолейСвязи.Характеристика;
		СправочникОбъект.КАНАТ_ВесЕдиницаИзмерения	= ПолучитьЕдиницуИзмеренияНоменклатуры(ЗначенияПолейСвязи.Номенклатура);
		СправочникОбъект.КАНАТ_Вес					= СтрокаТаблицы.Количество;
	КонецЕсли;
	#КонецВставки
	
	Если СправочникОбъект <> Неопределено Тогда
		СправочникОбъект.Записать();
		СтрокаТаблицы.Серия = СправочникОбъект.Ссылка;
	КонецЕсли;

КонецПроцедуры
// <-БИТ> Руденков_Е.И. 22.07.2024
