//++Бит Трейгер П.М. 24.12.2024 Блок Качества. Переделка.

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	Если не ЗначениеЗаполнено(Объект.Ссылка) Тогда
	Объект.автор = Пользователи.ТекущийПользователь();	
	конецЕсли;
КонецПроцедуры
#Область ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры


#КонецОбласти

&НаСервере
Процедура ПродукцияПриИзмененииНаСервере()
	ЗаполнитьТЧРезультатИспытаний();
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияПриИзменении(Элемент)
	ПродукцияПриИзмененииНаСервере();
	//ЗаполнитьСертификат();
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьТЧРезультатИспытаний()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НоменклатураКАНАТ_ПоказателиНТД.Показатель КАК Показатель,
		|	НоменклатураКАНАТ_ПоказателиНТД.Размерность КАК ЕдИзм,
		|	НоменклатураКАНАТ_ПоказателиНТД.Значение КАК Норма,
		|	НоменклатураКАНАТ_ПоказателиНТД.Отклонение КАК ДопустимоеОтклонение,
		|	Истина КАК ВыводитьВПФ
		|ИЗ
		|	Справочник.Номенклатура.КАНАТ_ПоказателиНТД КАК НоменклатураКАНАТ_ПоказателиНТД
		|ГДЕ
		|	НоменклатураКАНАТ_ПоказателиНТД.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Продукция);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Объект.РезультатИспытаний.Загрузить(РезультатЗапроса);
	
КонецПроцедуры
//--Бит Трейгер П.М. 24.12.2024 Блок Качества. Переделка.

