
//&Вместо("ЗаполнитьПоЗаказуКлиента")
//Процедура КАНАТ_ЗаполнитьПоЗаказуКлиента(ДанныеЗаполнения)
//	ЗаказКлиента = ДанныеЗаполнения.Основание;
//	Запрос = Новый Запрос(
//		"ВЫБРАТЬ
//		|	ЗаказКлиента.Приоритет          КАК Приоритет,
//		|	ЗаказКлиента.Организация        КАК Организация,
//		|	ЗаказКлиента.НалогообложениеНДС КАК НалогообложениеНДС,
//		|	ВЫБОР 
//		|		КОГДА ЗаказКлиента.НаправлениеДеятельности.УчетЗатрат
//		|			ТОГДА ЗаказКлиента.НаправлениеДеятельности
//		|	КОНЕЦ КАК НаправлениеДеятельности
//		|ИЗ
//		|	Документ.ЗаказКлиента КАК ЗаказКлиента
//		|ГДЕ
//		|	ЗаказКлиента.Ссылка = &ЗаказКлиента");
//	
//	Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);
//	
//	Реквизиты = Запрос.Выполнить().Выбрать();
//	Реквизиты.Следующий();
//	
//	// Заполнение шапки
//	Организация             = Реквизиты.Организация;
//	ДокументОснование       = ЗаказКлиента;
//	ЗаказПодДеятельность    = Реквизиты.НалогообложениеНДС;
//	Приоритет               = Реквизиты.Приоритет;
//	НаправлениеДеятельности = Реквизиты.НаправлениеДеятельности;
//	НачатьНеРанее     = ТекущаяДатаСеанса();
//	
//	
//	// Заполнение табличной части.
//	ТаблицаТоваров = ПолучитьИзВременногоХранилища(ДанныеЗаполнения.АдресТовары); // ТаблицаЗначений
//	УдалитьИзВременногоХранилища(ДанныеЗаполнения.АдресТовары);
//	
//	Для Каждого Строка Из ТаблицаТоваров Цикл
//		
//		ДатаОтгрузки = Строка.ДатаОтгрузки;
//		Если ЗначениеЗаполнено(ДатаОтгрузки) Тогда
//			ДатаПотребности = ?(ЗначениеЗаполнено(ДатаПотребности), Мин(ДатаПотребности, ДатаОтгрузки), ДатаОтгрузки);
//		КонецЕсли;
//		
//	КонецЦикла;
//	
//	Продукция.Загрузить(ТаблицаТоваров);
//	
//	ЗаполнитьДанныеСпецификацииВСтроках();
//КонецПроцедуры

&ИзменениеИКонтроль("ЗаполнитьПоЗаказуКлиента")
Процедура КАНАТ_ЗаполнитьПоЗаказуКлиента(ДанныеЗаполнения)

	ЗаказКлиента = ДанныеЗаполнения.Основание;
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЗаказКлиента.Приоритет          КАК Приоритет,
	|	ЗаказКлиента.Организация        КАК Организация,
	|	ЗаказКлиента.НалогообложениеНДС КАК НалогообложениеНДС,
	|	ВЫБОР 
	|		КОГДА ЗаказКлиента.НаправлениеДеятельности.УчетЗатрат
	|			ТОГДА ЗаказКлиента.НаправлениеДеятельности
	|	КОНЕЦ КАК НаправлениеДеятельности
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Ссылка = &ЗаказКлиента");

	Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);

	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();

	// Заполнение шапки
	Организация             = Реквизиты.Организация;
	ДокументОснование       = ЗаказКлиента;
	ЗаказПодДеятельность    = Реквизиты.НалогообложениеНДС;
	Приоритет               = Реквизиты.Приоритет;
	НаправлениеДеятельности = Реквизиты.НаправлениеДеятельности; 
	#Вставка     
	НачатьНеРанее     = ТекущаяДатаСеанса();
	#КонецВставки
    #Удаление
	// Заполнение табличной части
	ЗаполнитьПоТаблицеТоварыИзХранилища(ДанныеЗаполнения.АдресТовары, "ДатаОтгрузки");
    #КонецУдаления
	#Вставка     
	ТаблицаТоваров = ПолучитьИзВременногоХранилища(ДанныеЗаполнения.АдресТовары); // ТаблицаЗначений
	УдалитьИзВременногоХранилища(ДанныеЗаполнения.АдресТовары);
	
	Для Каждого Строка Из ТаблицаТоваров Цикл
		
		ДатаОтгрузки = Строка.ДатаОтгрузки;
		Если ЗначениеЗаполнено(ДатаОтгрузки) Тогда
			ДатаПотребности = ?(ЗначениеЗаполнено(ДатаПотребности), Мин(ДатаПотребности, ДатаОтгрузки), ДатаОтгрузки);
		КонецЕсли;
		
	КонецЦикла;
	
	Продукция.Загрузить(ТаблицаТоваров);
	
	ЗаполнитьДанныеСпецификацииВСтроках();
	#КонецВставки
КонецПроцедуры
