//БИТ_Гурьев_ЧТЗ_2.16_17.05.24++
Функция ПолучитьТипЗаполнения(Ссылка, Поддон = Неопределено) Экспорт
	
	Если Не ТипЗнч(Ссылка) = Тип("СправочникСсылка.КАНАТ_ГрупповыеУпаковки") Тогда
		Возврат Перечисления.КАНАТ_ТипЗаполненияГрупповойУпаковки.ПустаяСсылка();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Поддон) Тогда
		
		Поддон = Ссылка.Поддон;
		
	КонецЕсли;
	
	Если Поддон.Вес = 25 Тогда
		Возврат Перечисления.КАНАТ_ТипЗаполненияГрупповойУпаковки.Россыпь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КАНАТ_СоответствиеГрупповыхУпаковокСериямНоменклатурыОстатки.Номенклатура КАК Номенклатура
		|ИЗ
		|	РегистрНакопления.КАНАТ_СоответствиеГрупповыхУпаковокСериямНоменклатуры.Остатки КАК КАНАТ_СоответствиеГрупповыхУпаковокСериямНоменклатурыОстатки
		|ГДЕ
		|	КАНАТ_СоответствиеГрупповыхУпаковокСериямНоменклатурыОстатки.ГрупповаяУпаковка = &ГрупповаяУпаковка";
	
	Запрос.УстановитьПараметр("ГрупповаяУпаковка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выгрузка = РезультатЗапроса.Выгрузить();
	
	Если Выгрузка.Количество() = 1 Тогда
		Возврат Перечисления.КАНАТ_ТипЗаполненияГрупповойУпаковки.Несборный;
	ИначеЕсли Выгрузка.Количество() > 1 Тогда
		Возврат Перечисления.КАНАТ_ТипЗаполненияГрупповойУпаковки.Сборный;
	КонецЕсли;
	
	Возврат Перечисления.КАНАТ_ТипЗаполненияГрупповойУпаковки.ПустаяСсылка();
	
КонецФункции //БИТ_Гурьев_ЧТЗ_2.16_17.05.24--