 //++Бит Трейгер П.М. 24.12.2024 Блок Качества. Переделка.
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.МенеджерПечати = "Обработка.КАНАТКач_ПечатьРезультатИспытания";
	//КомандаПечати.Идентификатор = "ПротоколРезультатовИспытаний";
	//КомандаПечати.Представление = "Протокол результатов испытаний";
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	//
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.МенеджерПечати = "Обработка.КАНАТКач_ПечатьРезультатИспытания";
	//КомандаПечати.Идентификатор = "ПротоколРезультатовИспытанийДляМорскогоРегистра";
	//КомандаПечати.Представление = "Протокол результатов испытаний для морского регистра";
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	//
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.МенеджерПечати = "Обработка.КАНАТКач_ПечатьРезультатИспытания";
	//КомандаПечати.Идентификатор = "АктОтбораОбразцов";
	//КомандаПечати.Представление = "Акт отбора образцов";
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Обработка.КАНАТКач_ПечатьРезультатИспытания";
	КомандаПечати.Идентификатор = "СертификатКачества";
	КомандаПечати.Представление = "Сертификат качества";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Обработка.КАНАТКач_ПечатьРезультатИспытания";
	КомандаПечати.Идентификатор = "СертификатКачестваМЧС";
	КомандаПечати.Представление = "Сертификат качества Страховочно-Спасательного со знаком МЧС";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Обработка.КАНАТКач_ПечатьРезультатИспытания";
	КомандаПечати.Идентификатор = "СертификатКачестваБезМЧС";
	КомандаПечати.Представление = "Сертификат качества Страховочно-Спасательного без знака МЧС";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Обработка.КАНАТКач_ПечатьРезультатИспытания";
	КомандаПечати.Идентификатор = "СертификатКачестваРМРС";
	КомандаПечати.Представление = "Сертификат качества для Российского Морского Регистра Судоходства(сорт)";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.МенеджерПечати = "Обработка.КАНАТКач_ПечатьРезультатИспытания";
	//КомандаПечати.Идентификатор = "СертификатКачестваРРР";
	//КомандаПечати.Представление = "Сертификат качества для Речного Регистра (РРР)";
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Обработка.КАНАТКач_ПечатьРезультатИспытания";
	КомандаПечати.Идентификатор = "СертификатКачестваРКО";
	КомандаПечати.Представление = "Сертификат качества для Российского Классификационного Общества (РКО)";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	//++Бит Трейгер П.М. 24.12.2024 Блок Качества. Переделка.
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Обработка.КАНАТКач_ПечатьРезультатИспытания";
	КомандаПечати.Идентификатор = "МорскойРегистрСудоходства";
	КомандаПечати.Представление = "Сертификат качества для Российского Морского Регистра Судоходства(без сорта)";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	//--Бит Трейгер П.М. 24.12.2024 Блок Качества. Переделка.
КонецПроцедуры

Функция ДобавитьКомандуСоздатьНаОснованииСертефикатКачества(КомандыСоздатьНаОсновании) Экспорт
	
	//Если ПравоДоступа("Добавление", Метаданные.Документы.МойДокумент) Тогда
		
		КомандаСоздатьНаОсновании = КомандыСоздатьНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.КАНАТ_СертификатКачества.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = ОбщегоНазначенияУТ.ПредставлениеОбъекта(Метаданные.Документы.МойДокумент);
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		
		Возврат КомандаСоздатьНаОсновании;
		
	//КонецЕсли; 
		
	//Возврат Неопределено;
	
КонецФункции 
 //--Бит Трейгер П.М. 24.12.2024 Блок Качества. Переделка.
