 //++Бит Трейгер П.М. 24.12.2024 Блок Качества. Переделка.
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КАНАТ_РезультатИспытаний") Тогда
		// Заполнение шапки
		ЗаказКлиента = ДанныеЗаполнения.ЗаказКлиента;
		ЗаказНаПроизводство = ДанныеЗаполнения.ЗаказНаПроизводство;
		Примечание = ДанныеЗаполнения.Примечание;
		Продукция = ДанныеЗаполнения.Продукция;
		ДокументОснования = ДанныеЗаполнения.Ссылка;
		НомерБухты =  ДанныеЗаполнения.НомерБухты;
		Для Каждого ТекСтрокаРезультатИспытаний Из ДанныеЗаполнения.РезультатИспытаний Цикл
			НоваяСтрока = РезультатИспытаний.Добавить();
			НоваяСтрока.ДопустимоеОтклонение = ТекСтрокаРезультатИспытаний.ДопустимоеОтклонение;
			НоваяСтрока.ЕдИзм = ТекСтрокаРезультатИспытаний.ЕдИзм;
			НоваяСтрока.Норма = ТекСтрокаРезультатИспытаний.Норма;
			НоваяСтрока.Показатель = ТекСтрокаРезультатИспытаний.Показатель;
			НоваяСтрока.Факт = ТекСтрокаРезультатИспытаний.Факт;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
 //--Бит Трейгер П.М. 24.12.2024 Блок Качества. Переделка.
