
&После("ПриОпределенииОбъектовСКомандамиПечати")
Процедура КАНАТКач_ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов)
	//++ Гурьев 10.10.23 ЧТЗ_К3
	СписокОбъектов.Добавить(Документы.КАНАТ_РезультатИспытаний); 
	//-- Гурьев 10.10.23 ЧТЗ_К3
	СписокОбъектов.Добавить(Обработки.КАНАТ_ПечатьПрайсЛиста);
	//++ Гурьев 13.11.23 ЧТЗ_2.3
	СписокОбъектов.Добавить(Документы.КАНАТ_СпецификацияКДоговору); 
	//-- Гурьев 13.11.23 ЧТЗ_2.3
	//++ Гурьев 15.11.23 ЧТЗ_2.10
	СписокОбъектов.Добавить(Документы.КАНАТ_РаспоряжениеНаОтгрузку); 
	//-- Гурьев 15.11.23 ЧТЗ_2.10
	//++ Гурьев 17.11.23 ЧТЗ_2.10
	СписокОбъектов.Добавить(Документы.КАНАТ_ПропускНаВыезд); 
	//-- Гурьев 17.11.23 ЧТЗ_2.10
	//++Бит Трейгер П.М. 20.12.2024 Блок Качества. Переделка. 
    СписокОбъектов.Добавить(Документы.КАНАТ_СертификатКачества);
	//++Бит Трейгер П.М. 20.12.2024 Блок Качества. Переделка. 
КонецПроцедуры
