
&НаСервере
Процедура КАНАТ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//БИТ_Шамсиев++ Добавили реквизит Запрет отгружать серию частично
	НовыйЭлемент = Элементы.Добавить("Канат_ЗапретНаОтгрузкуЧастями", Тип("ПолеФормы"), Элементы.ГруппаГруппыВидаНоменклатуры); 
	НовыйЭлемент.Заголовок = "Запрет отгружать серию частично"; 
	НовыйЭлемент.ПутьКДанным = "Объект.Канат_ЗапретНаОтгрузкуЧастями";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;      
	//БИТ_Шамсиев-- Добавили реквизит Запрет отгружать серию частично
КонецПроцедуры
