
&НаСервере
Процедура КАНАТ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//БИТ_Шамсиев++ Добавили реквизит Запрет отгружать серию частично
	НовыйЭлемент = Элементы.Добавить("Канат_ЗапретНаОтгрузкуЧастями", Тип("ПолеФормы"), Элементы.ГруппаГруппыВидаНоменклатуры); 
	НовыйЭлемент.Заголовок = "Запрет отгружать серию частично"; 
	НовыйЭлемент.ПутьКДанным = "Объект.Канат_ЗапретНаОтгрузкуЧастями";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;    
	Если Не Объект.ИспользоватьСерии тогда
		НовыйЭлемент.Доступность = ложь;
	КонецЕсли;	
	//БИТ_Шамсиев-- Добавили реквизит Запрет отгружать серию частично  
	
КонецПроцедуры

&НаСервере
Процедура КАНАТ_ИспользоватьСерииПриИзмененииПослеНаСервере()
	Если Объект.ИспользоватьСерии = Ложь Тогда
		Объект.Канат_ЗапретНаОтгрузкуЧастями = Ложь;
		Элементы.Канат_ЗапретНаОтгрузкуЧастями.Доступность = ложь;  
	Иначе
		Элементы.Канат_ЗапретНаОтгрузкуЧастями.Доступность = Истина;  
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура КАНАТ_ИспользоватьСерииПриИзмененииПосле(Элемент)
	КАНАТ_ИспользоватьСерииПриИзмененииПослеНаСервере();
КонецПроцедуры
