Функция ПолучитьСотрудникаПоДолжности(Должность, Дата = Неопределено) Экспорт
	
	Если Дата = Неопределено Тогда
		
		Дата = ТекущаяДата();
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КАНАТ_ЛицаПодписывающиеЗаПодразделения.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрСведений.КАНАТ_ЛицаПодписывающиеЗаПодразделения КАК КАНАТ_ЛицаПодписывающиеЗаПодразделения
		|ГДЕ
		|	КАНАТ_ЛицаПодписывающиеЗаПодразделения.РольРуководителя.Ссылка = &Должность
		|	И КАНАТ_ЛицаПодписывающиеЗаПодразделения.ДатаНачала <= &Дата
		|	И КАНАТ_ЛицаПодписывающиеЗаПодразделения.ДатаОкончания > &Дата";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Должность", Должность);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Сотрудник;
	Иначе
		Возврат Справочники.Сотрудники.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции