
Процедура ПередЗаписью(Отказ, Замещение)
	//++ Гурьев 28.09.23 ЧТЗ_К2_v_6.3
	Для Каждого Строка Из ЭтотОбъект Цикл
		
		Если Строка.ДатаНачала > Строка.ДатаОкончания Тогда
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю("В введенных записях неправильно задан период. Дата начала должна быть меньше даты окончания.");
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Таблица = ЭтотОбъект.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ 
	|	*
	|ПОМЕСТИТЬ ВТ
	|ИЗ 
	|	&Таблица КАК Таблица;
	|
	|ВЫБРАТЬ 
	|	ЛицаПодписывающиеЗаПодразделения.Сотрудник,
	|	ЛицаПодписывающиеЗаПодразделения.ДатаНачала,
	|	ЛицаПодписывающиеЗаПодразделения.ДатаОкончания
	|ИЗ
	|	РегистрСведений.КАНАТ_ЛицаПодписывающиеЗаПодразделения КАК ЛицаПодписывающиеЗаПодразделения
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ КАК ВТ 
	|	По ВТ.РольРуководителя = ЛицаПодписывающиеЗаПодразделения.РольРуководителя 
	|	   И ВТ.Замещающий = ЛицаПодписывающиеЗаПодразделения.Замещающий
	|ГДЕ
	|	НЕ ((ВТ.ДатаОкончания < ЛицаПодписывающиеЗаПодразделения.ДатаНачала) 
	|		ИЛИ (ВТ.ДатаНачала > ЛицаПодписывающиеЗаПодразделения.ДатаОкончания))";
	
	Запрос.УстановитьПараметр("Таблица", Таблица);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("%1 Сотрудник: %2 Период с %3 по %4",
											  "Период добавляемых записей пересекается с периодом уже существующих. Запись невозможна.", 
											  Выборка.Сотрудник,
											  Выборка.ДатаНачала,
											  Выборка.ДатаОкончания));
		
	КонецЕсли;
	//-- Гурьев 28.09.23 ЧТЗ_К2_v_6.3
КонецПроцедуры
