
//&Вместо("ПолучитьДанныеДляПечатнойФормыТОРГ12")
//Функция КАНАТ_ПолучитьДанныеДляПечатнойФормыТОРГ12(ПараметрыПечати, МассивОбъектов)
//	КолонкаКодов = ФормированиеПечатныхФорм.ДополнительнаяКолонкаПечатныхФормДокументов().ИмяКолонки;
//	Если Не ЗначениеЗаполнено(КолонкаКодов) Тогда
//		КолонкаКодов = "Код";
//	КонецЕсли;
//	
//	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
//	
//	Запрос = Новый Запрос;
//	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
//	Запрос.Текст = "
//	|ВЫБРАТЬ
//	|	ДанныеДокументов.Ссылка  КАК Ссылка,
//	|	ДанныеДокументов.Валюта  КАК Валюта,
//	|	ДанныеДокументов.Организация.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета
//	|
//	|ПОМЕСТИТЬ ТаблицаДанныхДокументов
//	|ИЗ
//	|	Документ.РеализацияТоваровУслуг КАК ДанныеДокументов
//	|
//	|ГДЕ
//	|	ДанныеДокументов.Ссылка В (&МассивОбъектов)
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	Ссылка
//	|;";
//	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
//	
//	Запрос.Выполнить();
//	
//	ПараметрыЗаполнения = ПродажиСервер.ПараметрыЗаполненияВременнойТаблицыТоваров();
//	Если ПараметрыПечати.Свойство("ВыводитьГТД") Тогда
//		ПараметрыЗаполнения.ВключаяНомераГТД = ПараметрыПечати.ВыводитьГТД;
//	КонецЕсли;
//	ПараметрыЗаполнения.ОбработатьНастройкиПечатиНаборов = Истина;
//	ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц, ПараметрыЗаполнения);
//	
//	ПродажиСервер.ПоместитьВременнуюТаблицуКоэффициентыУпаковок(МенеджерВременныхТаблиц, "РеализацияТоваровУслугТаблицаТоваров");
//	ОтветственныеЛицаСервер.СформироватьВременнуюТаблицуОтветственныхЛицДокументов(МассивОбъектов, МенеджерВременныхТаблиц);
//	
//	Запрос.Текст =
//	"ВЫБРАТЬ
//	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
//	|	РеализацияТоваровУслуг.Номер КАК Номер,
//	|	РеализацияТоваровУслуг.Дата КАК Дата,
//	|	РеализацияТоваровУслуг.Статус КАК Статус,
//	|	РеализацияТоваровУслуг.Партнер КАК Партнер,
//	|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
//	|	ВЫБОР
//	|		КОГДА РеализацияТоваровУслуг.Организация.ОбособленноеПодразделение
//	|			ТОГДА РеализацияТоваровУслуг.Организация.ГоловнаяОрганизация
//	|		ИНАЧЕ РеализацияТоваровУслуг.Организация
//	|	КОНЕЦ КАК Организация,
//	|	ТаблицаОтветственныеЛица.РуководительНаименование КАК Руководитель,
//	|	ТаблицаОтветственныеЛица.РуководительДолжность КАК ДолжностьРуководителя,
//	|	ТаблицаОтветственныеЛица.ГлавныйБухгалтерНаименование КАК ГлавныйБухгалтер,
//	|	РеализацияТоваровУслуг.Отпустил КАК Кладовщик,
//	|	РеализацияТоваровУслуг.ОтпустилДолжность КАК ДолжностьКладовщика,
//	|	РеализацияТоваровУслуг.Организация.Префикс КАК Префикс,
//	|	РеализацияТоваровУслуг.Основание КАК Основание,
//	|	РеализацияТоваровУслуг.ОснованиеДата КАК ОснованиеДата,
//	|	РеализацияТоваровУслуг.ОснованиеНомер КАК ОснованиеНомер,
//	|	ВЫБОР
//	|		КОГДА РеализацияТоваровУслуг.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
//	|			ТОГДА РеализацияТоваровУслуг.Контрагент
//	|		ИНАЧЕ РеализацияТоваровУслуг.Грузополучатель
//	|	КОНЕЦ КАК Грузополучатель,
//	|	ВЫБОР
//	|		КОГДА РеализацияТоваровУслуг.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
//	|			ТОГДА РеализацияТоваровУслуг.Организация
//	|		ИНАЧЕ РеализацияТоваровУслуг.Грузоотправитель
//	|	КОНЕЦ КАК Грузоотправитель,
//	|	РеализацияТоваровУслуг.БанковскийСчетОрганизации КАК БанковскийСчетОрганизации,
//	|	РеализацияТоваровУслуг.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента,
//	|	РеализацияТоваровУслуг.БанковскийСчетГрузоотправителя КАК БанковскийСчетГрузоотправителя,
//	|	РеализацияТоваровУслуг.БанковскийСчетГрузополучателя КАК БанковскийСчетГрузополучателя,
//	|	РеализацияТоваровУслуг.АдресДоставки КАК АдресДоставки,
//	|	НЕОПРЕДЕЛЕНО КАК Подразделение,
//	|	РеализацияТоваровУслуг.Валюта КАК Валюта,
//	|	РеализацияТоваровУслуг.НалогообложениеНДС КАК НалогообложениеНДС,
//	|	РеализацияТоваровУслуг.ДоверенностьНомер КАК ДоверенностьНомер,
//	|	РеализацияТоваровУслуг.ДоверенностьДата КАК ДоверенностьДата,
//	|	РеализацияТоваровУслуг.ДоверенностьВыдана КАК ДоверенностьВыдана,
//	|	РеализацияТоваровУслуг.ДоверенностьЛицо КАК ДоверенностьЛицо,
//	|	&ЕдиницаИзмеренияВеса КАК ЕдиницаИзмеренияВеса
//	|ИЗ
//	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокументов КАК ДанныеДокументов
//	|		ПО РеализацияТоваровУслуг.Ссылка = ДанныеДокументов.Ссылка
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтветственныеЛица КАК ТаблицаОтветственныеЛица
//	|		ПО РеализацияТоваровУслуг.Ссылка = ТаблицаОтветственныеЛица.Ссылка
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	Ссылка
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ТаблицаТоваров.Ссылка КАК Ссылка,
//	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
//	|	ВЫБОР
//	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
//	|			ТОГДА ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения
//	|		ИНАЧЕ &ТекстЗапросаЕдиницаИзмерения
//	|	КОНЕЦ КАК ЕдиницаИзмерения,
//	|	ВЫБОР
//	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
//	|			ТОГДА ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.Представление
//	|		ИНАЧЕ &ТекстЗапросаНаименованиеЕдиницыИзмерения1
//	|	КОНЕЦ КАК ЕдиницаИзмеренияНаименование,
//	|	ВЫБОР
//	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
//	|			ТОГДА ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.Код
//	|		ИНАЧЕ &ТекстЗапросаКодЕдиницыИзмерения
//	|	КОНЕЦ КАК ЕдиницаИзмеренияКод,
//	|	ТаблицаТоваров.Упаковка КАК Упаковка,
//	|	ВЫБОР
//	|		КОГДА ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1) = 1
//	|			ТОГДА """"
//	|		ИНАЧЕ ТаблицаТоваров.Упаковка.Наименование
//	|	КОНЕЦ КАК УпаковкаНаименование,
//	|	ВЫБОР
//	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
//	|			ТОГДА &ТекстЗапросаНаименованиеЕдиницыИзмерения1
//	|		ИНАЧЕ &ТекстЗапросаНаименованиеЕдиницыИзмерения2
//	|	КОНЕЦ КАК ВидУпаковки,
//	|	ВЫБОР
//	|		КОГДА НЕ &ВыводитьБазовыеЕдиницыИзмерения
//	|			ТОГДА ТаблицаТоваров.КоличествоУпаковок
//	|		ИНАЧЕ ТаблицаТоваров.Количество
//	|	КОНЕЦ КАК Количество,
//	|	ВЫБОР
//	|		КОГДА НЕ &ВыводитьБазовыеЕдиницыИзмерения
//	|		И НЕ ТаблицаТоваров.ЭтоНабор
//	|			ТОГДА ВЫБОР
//	|				КОГДА КоэффициентыУпаковок.Количество < КоэффициентыУпаковок.КоэффициентВложеннойУпаковки
//	|				ИЛИ ТаблицаТоваров.Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
//	|				И ((ТаблицаТоваров.Номенклатура.ВесИспользовать
//	|				И ТаблицаТоваров.Номенклатура.ВесМожноУказыватьВДокументах
//	|				И ТаблицаТоваров.Упаковка = ТаблицаТоваров.Номенклатура.ВесЕдиницаИзмерения)
//	|				ИЛИ (ТаблицаТоваров.Номенклатура.ОбъемИспользовать
//	|				И ТаблицаТоваров.Номенклатура.ОбъемМожноУказыватьВДокументах
//	|				И ТаблицаТоваров.Упаковка = ТаблицаТоваров.Номенклатура.ОбъемЕдиницаИзмерения)
//	|				ИЛИ (ТаблицаТоваров.Номенклатура.ДлинаИспользовать
//	|				И ТаблицаТоваров.Номенклатура.ДлинаМожноУказыватьВДокументах
//	|				И ТаблицаТоваров.Упаковка = ТаблицаТоваров.Номенклатура.ДлинаЕдиницаИзмерения)
//	|				ИЛИ (ТаблицаТоваров.Номенклатура.ПлощадьИспользовать
//	|				И ТаблицаТоваров.Номенклатура.ПлощадьМожноУказыватьВДокументах
//	|				И ТаблицаТоваров.Упаковка = ТаблицаТоваров.Номенклатура.ПлощадьЕдиницаИзмерения))
//	|					ТОГДА КоэффициентыУпаковок.КоличествоУпаковок
//	|				ИНАЧЕ ТаблицаТоваров.Количество / КоэффициентыУпаковок.КоэффициентВложеннойУпаковки
//	|			КОНЕЦ
//	|		ИНАЧЕ ВЫБОР
//	|			КОГДА ТаблицаТоваров.Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
//	|			И &ВыводитьБазовыеЕдиницыИзмерения
//	|			И ((ТаблицаТоваров.Номенклатура.ВесИспользовать
//	|			И ТаблицаТоваров.Номенклатура.ВесМожноУказыватьВДокументах
//	|			И ТаблицаТоваров.Упаковка = ТаблицаТоваров.Номенклатура.ВесЕдиницаИзмерения)
//	|			ИЛИ (ТаблицаТоваров.Номенклатура.ОбъемИспользовать
//	|			И ТаблицаТоваров.Номенклатура.ОбъемМожноУказыватьВДокументах
//	|			И ТаблицаТоваров.Упаковка = ТаблицаТоваров.Номенклатура.ОбъемЕдиницаИзмерения)
//	|			ИЛИ (ТаблицаТоваров.Номенклатура.ДлинаИспользовать
//	|			И ТаблицаТоваров.Номенклатура.ДлинаМожноУказыватьВДокументах
//	|			И ТаблицаТоваров.Упаковка = ТаблицаТоваров.Номенклатура.ДлинаЕдиницаИзмерения)
//	|			ИЛИ (ТаблицаТоваров.Номенклатура.ПлощадьИспользовать
//	|			И ТаблицаТоваров.Номенклатура.ПлощадьМожноУказыватьВДокументах
//	|			И ТаблицаТоваров.Упаковка = ТаблицаТоваров.Номенклатура.ПлощадьЕдиницаИзмерения))
//	|				ТОГДА ТаблицаТоваров.КоличествоУпаковок
//	|			КОГДА ТаблицаТоваров.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
//	|			ИЛИ ТаблицаТоваров.Упаковка = (ВЫБОР
//	|				КОГДА &ВыводитьБазовыеЕдиницыИзмерения
//	|					ТОГДА ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения
//	|				ИНАЧЕ &ТекстЗапросаЕдиницаИзмерения
//	|			КОНЕЦ)
//	|				ТОГДА ТаблицаТоваров.Количество
//	|			ИНАЧЕ ТаблицаТоваров.Количество / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1)
//	|		КОНЕЦ
//	|	КОНЕЦ КАК КоличествоМестДробное,
//	|	ВЫБОР
//	|		КОГДА НЕ &ВыводитьБазовыеЕдиницыИзмерения
//	|		И Не ТаблицаТоваров.ЭтоНабор
//	|			ТОГДА ВЫБОР
//	|				КОГДА ТаблицаТоваров.Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
//	|				И ТаблицаТоваров.Упаковка = &ТекстЗапросаЕдиницаИзмерения
//	|					ТОГДА 1
//	|				ИНАЧЕ КоэффициентыУпаковок.КоэффициентВложеннойУпаковки
//	|			КОНЕЦ
//	|		ИНАЧЕ ВЫБОР
//	|			КОГДА ТаблицаТоваров.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
//	|			ИЛИ ТаблицаТоваров.Упаковка = (ВЫБОР
//	|				КОГДА &ВыводитьБазовыеЕдиницыИзмерения
//	|					ТОГДА ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения
//	|				ИНАЧЕ &ТекстЗапросаЕдиницаИзмерения
//	|			КОНЕЦ)
//	|				ТОГДА 1
//	|			ИНАЧЕ &ТекстЗапросаКоэффициентУпаковки
//	|		КОНЕЦ
//	|	КОНЕЦ КАК КоличествоВОдномМесте,
//	|	ВЫБОР
//	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
//	|			ТОГДА &ТекстЗапросаВесУпаковки
//	|		ИНАЧЕ &ТекстЗапросаВесВидаУпаковки
//	|	КОНЕЦ КАК МассаБруттоОдногоМеста,
//	|	ЕСТЬNULL(КоэффициентыУпаковок.КоэффициентУпаковки, 1) * ТаблицаТоваров.МассаНеттоНоменклатуры КАК
//	|		МассаНеттоОднойУпаковки,
//	|	ТаблицаТоваров.НомерГТД КАК НомерГТД,
//	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
//	|	ТаблицаТоваров.Характеристика КАК Характеристика,
//	|	1 КАК КоэффициентУпаковки
//	|ПОМЕСТИТЬ РасчитанныеДанныеУпаковокЕдиницИзмерения
//	|ИЗ
//	|	РеализацияТоваровУслугТаблицаТоваров КАК ТаблицаТоваров
//	|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыУпаковок КАК КоэффициентыУпаковок
//	|		ПО ТаблицаТоваров.Ссылка = КоэффициентыУпаковок.Ссылка
//	|		И ТаблицаТоваров.НомерСтроки = КоэффициентыУпаковок.НомерСтроки
//	|		И ТаблицаТоваров.Номенклатура = КоэффициентыУпаковок.Номенклатура
//	|		И ТаблицаТоваров.КоличествоУпаковок = КоэффициентыУпаковок.КоличествоУпаковок
//	|		И (НЕ &ВыводитьБазовыеЕдиницыИзмерения)
//	|ГДЕ
//	|	(ТаблицаТоваров.ЭтоТовар
//	|	ИЛИ &ВыводитьУслуги)
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	Ссылка,
//	|	НомерСтроки,
//	|	Номенклатура,
//	|	Характеристика,
//	|	НомерГТД
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ТаблицаТоваров.Ссылка КАК Ссылка,
//	|	ТаблицаТоваров.ВариантПредставленияНабораВПечатныхФормах КАК ВариантПредставленияНабораВПечатныхФормах,
//	|	ТаблицаТоваров.ВариантРасчетаЦеныНабора КАК ВариантРасчетаЦеныНабора,
//	|	ТаблицаТоваров.НоменклатураНабора КАК НоменклатураНабора,
//	//БИТ_Гурьев__02.05.24++
//	|	максимум("""") КАК ХарактеристикаНабора,
//	//БИТ_Гурьев__02.05.24--
//	|	ТаблицаТоваров.ЭтоКомплектующие КАК ЭтоКомплектующие,
//	|	ТаблицаТоваров.ЭтоНабор КАК ЭтоНабор,
//	|	ТаблицаТоваров.ПолныйНабор КАК ПолныйНабор,
//	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
//	|	ТаблицаТоваров.Номенклатура.НаименованиеПолное КАК НоменклатураНаименование,
//	|	ТаблицаТоваров.Номенклатура.Наименование КАК НоменклатураНаименованиеКраткое,
//	|	ВЫБОР
//	|		КОГДА &КолонкаКодов = ""Артикул""
//	|			ТОГДА ТаблицаТоваров.Номенклатура.Артикул
//	|		ИНАЧЕ ТаблицаТоваров.Номенклатура.Код
//	|	КОНЕЦ КАК НоменклатураКод,
//	|	ДанныеУпаковок.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
//	//БИТ_Гурьев__02.05.24++
//	|	максимум(ДанныеУпаковок.ЕдиницаИзмерения.Наименование) КАК ЕдиницаИзмеренияНаименование,
//	//БИТ_Гурьев__02.05.24--
//	|	ДанныеУпаковок.ЕдиницаИзмеренияКод КАК ЕдиницаИзмеренияКод,
//	//БИТ_Гурьев__02.05.24++
//	|	максимум("""") КАК Характеристика,
//	|	максимум("""") КАК ХарактеристикаНаименование,
//	//БИТ_Гурьев__02.05.24--
//	|	ТаблицаТоваров.Серия.Наименование КАК СерияНаименование,
//	|	ДанныеУпаковок.Упаковка КАК Упаковка,
//	|	ДанныеУпаковок.УпаковкаНаименование КАК УпаковкаНаименование,
//	|	ДанныеУпаковок.ВидУпаковки КАК ВидУпаковки,
//	|	ТаблицаТоваров.СтавкаНДС КАК СтавкаНДС,
//	|	ТаблицаТоваров.НомерГТД КАК НомерГТД,
//	|	ТаблицаТоваров.НомерГТД.СтранаПроисхождения КАК СтранаПроисхождения,
//	//БИТ_Гурьев__02.05.24++
//	|	сумма(ДанныеУпаковок.Количество) КАК Количество,
//	|	сумма(ВЫБОР
//	|		КОГДА ДанныеУпаковок.КоличествоМестДробное = (ВЫРАЗИТЬ(ДанныеУпаковок.КоличествоМестДробное КАК ЧИСЛО(12, 0)))
//	|			ТОГДА ДанныеУпаковок.КоличествоМестДробное
//	|		ИНАЧЕ ВЫРАЗИТЬ(ДанныеУпаковок.КоличествоМестДробное + 0.5 КАК ЧИСЛО(12, 0))
//	|	КОНЕЦ) КАК КоличествоМест,
//	|	сумма(ВЫБОР
//	|		КОГДА ДанныеУпаковок.ЕдиницаИзмерения = ДанныеУпаковок.Упаковка.ЕдиницаИзмерения
//	|			ТОГДА 1
//	|		ИНАЧЕ ДанныеУпаковок.КоличествоВОдномМесте
//	|	КОНЕЦ) КАК КоличествоВОдномМесте,
//	//БИТ_Гурьев__02.05.24--
//	|	ВЫБОР
//	|		КОГДА НЕ &ВыводитьБазовыеЕдиницыИзмерения
//	|			ТОГДА ВЫБОР
//	|				КОГДА НЕ ТаблицаТоваров.КоличествоУпаковок = 0
//	|					ТОГДА ТаблицаТоваров.СуммаБезНДС / ТаблицаТоваров.КоличествоУпаковок
//	|				ИНАЧЕ 0
//	|			КОНЕЦ
//	|		ИНАЧЕ ВЫБОР
//	|			КОГДА НЕ ТаблицаТоваров.Количество = 0
//	|				ТОГДА ТаблицаТоваров.СуммаБезНДС / ТаблицаТоваров.Количество
//	|			ИНАЧЕ 0
//	|		КОНЕЦ
//	|	КОНЕЦ КАК Цена,
//	//БИТ_Гурьев__02.05.24++
//	|	сумма(ТаблицаТоваров.СуммаБезНДС) КАК СуммаБезНДС,
//	|	сумма(ТаблицаТоваров.СуммаНДС) КАК СуммаНДС,
//	|	сумма(ТаблицаТоваров.СуммаБезНДС + ТаблицаТоваров.СуммаНДС) КАК СуммаСНДС,
//	|	сумма(ТаблицаТоваров.МассаНетто) КАК МассаНетто,
//	|	сумма(ВЫБОР
//	|		КОГДА ДанныеУпаковок.КоличествоМестДробное = (ВЫРАЗИТЬ(ДанныеУпаковок.КоличествоМестДробное КАК ЧИСЛО(12, 0)))
//	|			ТОГДА ДанныеУпаковок.КоличествоМестДробное
//	|		ИНАЧЕ ВЫРАЗИТЬ(ДанныеУпаковок.КоличествоМестДробное + 0.5 КАК ЧИСЛО(12, 0))
//	|	КОНЕЦ * ЕСТЬNULL(ДанныеУпаковок.МассаБруттоОдногоМеста, 0) - (ВЫБОР
//	|		КОГДА ДанныеУпаковок.КоличествоМестДробное = (ВЫРАЗИТЬ(ДанныеУпаковок.КоличествоМестДробное КАК ЧИСЛО(12, 0)))
//	|			ТОГДА ДанныеУпаковок.КоличествоМестДробное
//	|		ИНАЧЕ ВЫРАЗИТЬ(ДанныеУпаковок.КоличествоМестДробное + 0.5 КАК ЧИСЛО(12, 0))
//	|	КОНЕЦ * ЕСТЬNULL(ДанныеУпаковок.КоличествоВОдномМесте, 1) - ВЫБОР
//	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
//	|			ТОГДА ТаблицаТоваров.Количество
//	|		ИНАЧЕ ТаблицаТоваров.КоличествоУпаковок * ЕСТЬNULL(ДанныеУпаковок.КоличествоВОдномМесте, 1)
//	|	КОНЕЦ) * ДанныеУпаковок.МассаНеттоОднойУпаковки / ВЫБОР
//	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
//	|			ТОГДА 1
//	|		ИНАЧЕ ЕСТЬNULL(ДанныеУпаковок.КоличествоВОдномМесте, 1)
//	|	КОНЕЦ) КАК МассаБрутто,
//	|	максимум(ТаблицаТоваров.НомерСтроки) КАК НомерСтроки,
//	|	максимум(ТаблицаТоваров.НомерСтрокиНаборы) КАК НомерСтрокиНаборы,
//	//БИТ_Гурьев__02.05.24--
//	|	ВЫБОР
//	|		КОГДА ТаблицаТоваров.Ссылка.ВернутьМногооборотнуюТару
//	|		И ТаблицаТоваров.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
//	|			ТОГДА ИСТИНА
//	|		ИНАЧЕ ЛОЖЬ
//	|	КОНЕЦ КАК ЭтоВозвратнаяТара
//	|ИЗ
//	|	РеализацияТоваровУслугТаблицаТоваров КАК ТаблицаТоваров
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РасчитанныеДанныеУпаковокЕдиницИзмерения КАК ДанныеУпаковок
//	|		ПО ТаблицаТоваров.Ссылка = ДанныеУпаковок.Ссылка
//	|		И ТаблицаТоваров.НомерСтроки = ДанныеУпаковок.НомерСтроки
//	|		И ТаблицаТоваров.Номенклатура = ДанныеУпаковок.Номенклатура
//	|		И ТаблицаТоваров.Характеристика = ДанныеУпаковок.Характеристика
//	|		И ТаблицаТоваров.НомерГТД = ДанныеУпаковок.НомерГТД
//	|ГДЕ
//	|	(ТаблицаТоваров.ЭтоТовар
//	|	ИЛИ &ВыводитьУслуги)
//	|
//	//БИТ_Гурьев__02.05.24++
//	|СГРУППИРОВАТЬ ПО
//	|	ТаблицаТоваров.Ссылка,
//	|	ТаблицаТоваров.ВариантПредставленияНабораВПечатныхФормах,
//	|	ТаблицаТоваров.ВариантРасчетаЦеныНабора,
//	|	ТаблицаТоваров.НоменклатураНабора,
//	|	ТаблицаТоваров.ЭтоКомплектующие,
//	|	ТаблицаТоваров.ЭтоНабор,
//	|	ТаблицаТоваров.ПолныйНабор,
//	|	ТаблицаТоваров.Номенклатура,
//	|	ТаблицаТоваров.Номенклатура.НаименованиеПолное,
//	|	ТаблицаТоваров.Номенклатура.Наименование,
//	|	ВЫБОР
//	|		КОГДА &КолонкаКодов = ""Артикул""
//	|			ТОГДА ТаблицаТоваров.Номенклатура.Артикул
//	|		ИНАЧЕ ТаблицаТоваров.Номенклатура.Код
//	|	КОНЕЦ,
//	|	ДанныеУпаковок.ЕдиницаИзмерения,
//	//|	ДанныеУпаковок.ЕдиницаИзмеренияНаименование,
//	|	ДанныеУпаковок.ЕдиницаИзмеренияКод,
//	|	ТаблицаТоваров.Серия.Наименование,
//	|	ДанныеУпаковок.Упаковка,
//	|	ДанныеУпаковок.УпаковкаНаименование,
//	|	ДанныеУпаковок.ВидУпаковки,
//	|	ТаблицаТоваров.СтавкаНДС,
//	|	ТаблицаТоваров.НомерГТД,
//	|	ТаблицаТоваров.НомерГТД.СтранаПроисхождения,
//	|	ВЫБОР
//	|		КОГДА НЕ &ВыводитьБазовыеЕдиницыИзмерения
//	|			ТОГДА ВЫБОР
//	|				КОГДА НЕ ТаблицаТоваров.КоличествоУпаковок = 0
//	|					ТОГДА ТаблицаТоваров.СуммаБезНДС / ТаблицаТоваров.КоличествоУпаковок
//	|				ИНАЧЕ 0
//	|			КОНЕЦ
//	|		ИНАЧЕ ВЫБОР
//	|			КОГДА НЕ ТаблицаТоваров.Количество = 0
//	|				ТОГДА ТаблицаТоваров.СуммаБезНДС / ТаблицаТоваров.Количество
//	|			ИНАЧЕ 0
//	|		КОНЕЦ
//	|	КОНЕЦ,
//	|	ВЫБОР
//	|		КОГДА ТаблицаТоваров.Ссылка.ВернутьМногооборотнуюТару
//	|		И ТаблицаТоваров.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
//	|			ТОГДА ИСТИНА
//	|		ИНАЧЕ ЛОЖЬ
//	|	КОНЕЦ
//	//|	ТаблицаТоваров.ХарактеристикаНабора,
//	//|	ТаблицаТоваров.Характеристика,
//	//|	ТаблицаТоваров.Характеристика.НаименованиеПолное
//	//БИТ_Гурьев__02.05.24--
//	|УПОРЯДОЧИТЬ ПО
//	|	Ссылка,
//	|	НомерСтрокиНаборы,
//	|	ЭтоНабор УБЫВ,
//	|	НомерСтроки
//	|ИТОГИ
//	|ПО
//	|	Ссылка";
//	
//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаКоэффициентУпаковки",
//		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
//			"ТаблицаТоваров.Упаковка",
//			"ТаблицаТоваров.Номенклатура"));
//			
//	Запрос.Текст = СтрЗаменить(
//		Запрос.Текст, 
//		"&ТекстЗапросаВесУпаковки",
//		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки(
//			"ТаблицаТоваров.Упаковка",
//			"ТаблицаТоваров.Номенклатура"));

//	Запрос.Текст = СтрЗаменить(
//		Запрос.Текст, 
//		"&ТекстЗапросаВесВидаУпаковки",
//		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки(
//			"КоэффициентыУпаковок.ВидУпаковки",
//			"ТаблицаТоваров.Номенклатура"));

//	Запрос.Текст = СтрЗаменить(
//		Запрос.Текст,
//		"&ТекстЗапросаЕдиницаИзмерения",
//		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаЗначениеРеквизитаЕдиницыИзмерения(
//			"Ссылка",
//			"ТаблицаТоваров.Упаковка",
//			"ТаблицаТоваров.Номенклатура"));
//			
//	Запрос.Текст = СтрЗаменить(
//		Запрос.Текст,
//		"&ТекстЗапросаНаименованиеЕдиницыИзмерения1",
//		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаЗначениеРеквизитаЕдиницыИзмерения(
//			"Наименование",
//			"ТаблицаТоваров.Упаковка",
//			"ТаблицаТоваров.Номенклатура"));
//			
//	Запрос.Текст = СтрЗаменить(
//		Запрос.Текст,
//		"&ТекстЗапросаНаименованиеЕдиницыИзмерения2",
//		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаЗначениеРеквизитаЕдиницыИзмерения(
//			"Наименование",
//			"КоэффициентыУпаковок.ВидУпаковки",
//			"ТаблицаТоваров.Номенклатура"));
//	
//	Запрос.Текст = СтрЗаменить(
//		Запрос.Текст,
//		"&ТекстЗапросаКодЕдиницыИзмерения",
//		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаЗначениеРеквизитаЕдиницыИзмерения(
//			"Код",
//			"ТаблицаТоваров.Упаковка",
//			"ТаблицаТоваров.Номенклатура"));
//			
//	Запрос.УстановитьПараметр("ВыводитьУслуги",                  ПараметрыПечати.ВыводитьУслуги);
//	Запрос.УстановитьПараметр("КолонкаКодов",                    КолонкаКодов);
//	Запрос.УстановитьПараметр("ЕдиницаИзмеренияВеса",            Константы.ЕдиницаИзмеренияВеса.Получить());
//	Запрос.УстановитьПараметр("ЗаполненаЕдиницаИзмеренияВеса",   ЗначениеЗаполнено(Константы.ЕдиницаИзмеренияВеса.Получить()));
//	Запрос.УстановитьПараметр("ВыводитьБазовыеЕдиницыИзмерения",
//		Константы.ВыводитьБазовыеЕдиницыИзмерения.Получить() ИЛИ ПараметрыЗаполнения.ВключаяНомераГТД);
//	
//	МассивРезультатов         = Запрос.ВыполнитьПакет();
//	РезультатПоШапке          = МассивРезультатов[0];
//	РезультатПоТабличнойЧасти = МассивРезультатов[МассивРезультатов.ВГраница()];
//	
//	СтруктураДанныхДляПечати 	= Новый Структура("РезультатПоШапке, РезультатПоТабличнойЧасти",
//	                                               РезультатПоШапке, РезультатПоТабличнойЧасти);
//	
//	Возврат СтруктураДанныхДляПечати;
//	
//КонецФункции

&ИзменениеИКонтроль("ПолучитьДанныеДляПечатнойФормыТОРГ12")
Функция КАНАТ_ПолучитьДанныеДляПечатнойФормыТОРГ12(ПараметрыПечати, МассивОбъектов)

	КолонкаКодов = ФормированиеПечатныхФорм.ДополнительнаяКолонкаПечатныхФормДокументов().ИмяКолонки;
	Если Не ЗначениеЗаполнено(КолонкаКодов) Тогда
		КолонкаКодов = "Код";
	КонецЕсли;

	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДанныеДокументов.Ссылка  КАК Ссылка,
	|	ДанныеДокументов.Валюта  КАК Валюта,
	|	ДанныеДокументов.Организация.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета
	|
	|ПОМЕСТИТЬ ТаблицаДанныхДокументов
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК ДанныеДокументов
	|
	|ГДЕ
	|	ДанныеДокументов.Ссылка В (&МассивОбъектов)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);

	Запрос.Выполнить();

	ПараметрыЗаполнения = ПродажиСервер.ПараметрыЗаполненияВременнойТаблицыТоваров();
	Если ПараметрыПечати.Свойство("ВыводитьГТД") Тогда
		ПараметрыЗаполнения.ВключаяНомераГТД = ПараметрыПечати.ВыводитьГТД;
	КонецЕсли;
	ПараметрыЗаполнения.ОбработатьНастройкиПечатиНаборов = Истина;
	ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц, ПараметрыЗаполнения);

	ПродажиСервер.ПоместитьВременнуюТаблицуКоэффициентыУпаковок(МенеджерВременныхТаблиц, "РеализацияТоваровУслугТаблицаТоваров");
	ОтветственныеЛицаСервер.СформироватьВременнуюТаблицуОтветственныхЛицДокументов(МассивОбъектов, МенеджерВременныхТаблиц);
    #Удаление
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслуг.Номер КАК Номер,
	|	РеализацияТоваровУслуг.Дата КАК Дата,
	|	РеализацияТоваровУслуг.Статус КАК Статус,
	|	РеализацияТоваровУслуг.Партнер КАК Партнер,
	|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Организация.ОбособленноеПодразделение
	|			ТОГДА РеализацияТоваровУслуг.Организация.ГоловнаяОрганизация
	|		ИНАЧЕ РеализацияТоваровУслуг.Организация
	|	КОНЕЦ КАК Организация,
	|	ТаблицаОтветственныеЛица.РуководительНаименование КАК Руководитель,
	|	ТаблицаОтветственныеЛица.РуководительДолжность КАК ДолжностьРуководителя,
	|	ТаблицаОтветственныеЛица.ГлавныйБухгалтерНаименование КАК ГлавныйБухгалтер,
	|	РеализацияТоваровУслуг.Отпустил КАК Кладовщик,
	|	РеализацияТоваровУслуг.ОтпустилДолжность КАК ДолжностьКладовщика,
	|	РеализацияТоваровУслуг.Организация.Префикс КАК Префикс,
	|	РеализацияТоваровУслуг.Основание КАК Основание,
	|	РеализацияТоваровУслуг.ОснованиеДата КАК ОснованиеДата,
	|	РеализацияТоваровУслуг.ОснованиеНомер КАК ОснованиеНомер,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслуг.Контрагент
	|		ИНАЧЕ РеализацияТоваровУслуг.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслуг.Организация
	|		ИНАЧЕ РеализацияТоваровУслуг.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	РеализацияТоваровУслуг.БанковскийСчетОрганизации КАК БанковскийСчетОрганизации,
	|	РеализацияТоваровУслуг.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента,
	|	РеализацияТоваровУслуг.БанковскийСчетГрузоотправителя КАК БанковскийСчетГрузоотправителя,
	|	РеализацияТоваровУслуг.БанковскийСчетГрузополучателя КАК БанковскийСчетГрузополучателя,
	|	РеализацияТоваровУслуг.АдресДоставки КАК АдресДоставки,
	|	НЕОПРЕДЕЛЕНО КАК Подразделение,
	|	РеализацияТоваровУслуг.Валюта КАК Валюта,
	|	РеализацияТоваровУслуг.НалогообложениеНДС КАК НалогообложениеНДС,
	|	РеализацияТоваровУслуг.ДоверенностьНомер КАК ДоверенностьНомер,
	|	РеализацияТоваровУслуг.ДоверенностьДата КАК ДоверенностьДата,
	|	РеализацияТоваровУслуг.ДоверенностьВыдана КАК ДоверенностьВыдана,
	|	РеализацияТоваровУслуг.ДоверенностьЛицо КАК ДоверенностьЛицо,
	|	&ЕдиницаИзмеренияВеса КАК ЕдиницаИзмеренияВеса
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокументов КАК ДанныеДокументов
	|		ПО РеализацияТоваровУслуг.Ссылка = ДанныеДокументов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтветственныеЛица КАК ТаблицаОтветственныеЛица
	|		ПО РеализацияТоваровУслуг.Ссылка = ТаблицаОтветственныеЛица.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Ссылка КАК Ссылка,
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ &ТекстЗапросаЕдиницаИзмерения
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.Представление
	|		ИНАЧЕ &ТекстЗапросаНаименованиеЕдиницыИзмерения1
	|	КОНЕЦ КАК ЕдиницаИзмеренияНаименование,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.Код
	|		ИНАЧЕ &ТекстЗапросаКодЕдиницыИзмерения
	|	КОНЕЦ КАК ЕдиницаИзмеренияКод,
	|	ТаблицаТоваров.Упаковка КАК Упаковка,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1) = 1
	|			ТОГДА """"
	|		ИНАЧЕ ТаблицаТоваров.Упаковка.Наименование
	|	КОНЕЦ КАК УпаковкаНаименование,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА &ТекстЗапросаНаименованиеЕдиницыИзмерения1
	|		ИНАЧЕ &ТекстЗапросаНаименованиеЕдиницыИзмерения2
	|	КОНЕЦ КАК ВидУпаковки,
	|	ВЫБОР
	|		КОГДА НЕ &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаТоваров.КоличествоУпаковок
	|		ИНАЧЕ ТаблицаТоваров.Количество
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА НЕ &ВыводитьБазовыеЕдиницыИзмерения
	|		И НЕ ТаблицаТоваров.ЭтоНабор
	|			ТОГДА ВЫБОР
	|				КОГДА ТаблицаТоваров.Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|				И ((ТаблицаТоваров.Номенклатура.ВесИспользовать
	|				И ТаблицаТоваров.Номенклатура.ВесМожноУказыватьВДокументах
	|				И ТаблицаТоваров.Упаковка = ТаблицаТоваров.Номенклатура.ВесЕдиницаИзмерения)
	|				ИЛИ (ТаблицаТоваров.Номенклатура.ОбъемИспользовать
	|				И ТаблицаТоваров.Номенклатура.ОбъемМожноУказыватьВДокументах
	|				И ТаблицаТоваров.Упаковка = ТаблицаТоваров.Номенклатура.ОбъемЕдиницаИзмерения)
	|				ИЛИ (ТаблицаТоваров.Номенклатура.ДлинаИспользовать
	|				И ТаблицаТоваров.Номенклатура.ДлинаМожноУказыватьВДокументах
	|				И ТаблицаТоваров.Упаковка = ТаблицаТоваров.Номенклатура.ДлинаЕдиницаИзмерения)
	|				ИЛИ (ТаблицаТоваров.Номенклатура.ПлощадьИспользовать
	|				И ТаблицаТоваров.Номенклатура.ПлощадьМожноУказыватьВДокументах
	|				И ТаблицаТоваров.Упаковка = ТаблицаТоваров.Номенклатура.ПлощадьЕдиницаИзмерения))
	|					ТОГДА КоэффициентыУпаковок.КоличествоУпаковок
	|				ИНАЧЕ ТаблицаТоваров.Количество / КоэффициентыУпаковок.КоэффициентВложеннойУпаковки
	|			КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|			КОГДА ТаблицаТоваров.Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			И &ВыводитьБазовыеЕдиницыИзмерения
	|			И ((ТаблицаТоваров.Номенклатура.ВесИспользовать
	|			И ТаблицаТоваров.Номенклатура.ВесМожноУказыватьВДокументах
	|			И ТаблицаТоваров.Упаковка = ТаблицаТоваров.Номенклатура.ВесЕдиницаИзмерения)
	|			ИЛИ (ТаблицаТоваров.Номенклатура.ОбъемИспользовать
	|			И ТаблицаТоваров.Номенклатура.ОбъемМожноУказыватьВДокументах
	|			И ТаблицаТоваров.Упаковка = ТаблицаТоваров.Номенклатура.ОбъемЕдиницаИзмерения)
	|			ИЛИ (ТаблицаТоваров.Номенклатура.ДлинаИспользовать
	|			И ТаблицаТоваров.Номенклатура.ДлинаМожноУказыватьВДокументах
	|			И ТаблицаТоваров.Упаковка = ТаблицаТоваров.Номенклатура.ДлинаЕдиницаИзмерения)
	|			ИЛИ (ТаблицаТоваров.Номенклатура.ПлощадьИспользовать
	|			И ТаблицаТоваров.Номенклатура.ПлощадьМожноУказыватьВДокументах
	|			И ТаблицаТоваров.Упаковка = ТаблицаТоваров.Номенклатура.ПлощадьЕдиницаИзмерения))
	|				ТОГДА ТаблицаТоваров.КоличествоУпаковок
	|			КОГДА ТаблицаТоваров.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ИЛИ ТаблицаТоваров.Упаковка = (ВЫБОР
	|				КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|					ТОГДА ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения
	|				ИНАЧЕ &ТекстЗапросаЕдиницаИзмерения
	|			КОНЕЦ)
	|				ТОГДА ТаблицаТоваров.Количество
	|			ИНАЧЕ ТаблицаТоваров.Количество / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1)
	|		КОНЕЦ
	|	КОНЕЦ КАК КоличествоМестДробное,
	|	ВЫБОР
	|		КОГДА НЕ &ВыводитьБазовыеЕдиницыИзмерения
	|		И Не ТаблицаТоваров.ЭтоНабор
	|			ТОГДА ВЫБОР
	|				КОГДА ТаблицаТоваров.Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|				И ТаблицаТоваров.Упаковка = &ТекстЗапросаЕдиницаИзмерения
	|					ТОГДА 1
	|				ИНАЧЕ КоэффициентыУпаковок.КоэффициентВложеннойУпаковки
	|			КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|			КОГДА ТаблицаТоваров.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ИЛИ ТаблицаТоваров.Упаковка = (ВЫБОР
	|				КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|					ТОГДА ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения
	|				ИНАЧЕ &ТекстЗапросаЕдиницаИзмерения
	|			КОНЕЦ)
	|				ТОГДА 1
	|			ИНАЧЕ &ТекстЗапросаКоэффициентУпаковки
	|		КОНЕЦ
	|	КОНЕЦ КАК КоличествоВОдномМесте,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА &ТекстЗапросаВесУпаковки
	|		ИНАЧЕ &ТекстЗапросаВесВидаУпаковки
	|	КОНЕЦ КАК МассаБруттоОдногоМеста,
	|	ЕСТЬNULL(КоэффициентыУпаковок.КоэффициентУпаковки, 1) * ТаблицаТоваров.МассаНеттоНоменклатуры КАК
	|		МассаНеттоОднойУпаковки,
	|	ТаблицаТоваров.НомерГТД КАК НомерГТД,
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	1 КАК КоэффициентУпаковки
	|ПОМЕСТИТЬ РасчитанныеДанныеУпаковокЕдиницИзмерения
	|ИЗ
	|	РеализацияТоваровУслугТаблицаТоваров КАК ТаблицаТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыУпаковок КАК КоэффициентыУпаковок
	|		ПО ТаблицаТоваров.Ссылка = КоэффициентыУпаковок.Ссылка
	|		И ТаблицаТоваров.НомерСтроки = КоэффициентыУпаковок.НомерСтроки
	|		И ТаблицаТоваров.Номенклатура = КоэффициентыУпаковок.Номенклатура
	|		И ТаблицаТоваров.КоличествоУпаковок = КоэффициентыУпаковок.КоличествоУпаковок
	|		И (НЕ &ВыводитьБазовыеЕдиницыИзмерения)
	|ГДЕ
	|	(ТаблицаТоваров.ЭтоТовар
	|	ИЛИ &ВыводитьУслуги)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	НомерСтроки,
	|	Номенклатура,
	|	Характеристика,
	|	НомерГТД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Ссылка КАК Ссылка,
	|	ТаблицаТоваров.ВариантПредставленияНабораВПечатныхФормах КАК ВариантПредставленияНабораВПечатныхФормах,
	|	ТаблицаТоваров.ВариантРасчетаЦеныНабора КАК ВариантРасчетаЦеныНабора,
	|	ТаблицаТоваров.НоменклатураНабора КАК НоменклатураНабора,
	|	ТаблицаТоваров.ХарактеристикаНабора КАК ХарактеристикаНабора,
	|	ТаблицаТоваров.ЭтоКомплектующие КАК ЭтоКомплектующие,
	|	ТаблицаТоваров.ЭтоНабор КАК ЭтоНабор,
	|	ТаблицаТоваров.ПолныйНабор КАК ПолныйНабор,
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.Номенклатура.НаименованиеПолное КАК НоменклатураНаименование,
	|	ТаблицаТоваров.Номенклатура.Наименование КАК НоменклатураНаименованиеКраткое,
	|	ВЫБОР
	|		КОГДА &КолонкаКодов = ""Артикул""
	|			ТОГДА ТаблицаТоваров.Номенклатура.Артикул
	|		ИНАЧЕ ТаблицаТоваров.Номенклатура.Код
	|	КОНЕЦ КАК НоменклатураКод,
	|	ДанныеУпаковок.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ДанныеУпаковок.ЕдиницаИзмеренияНаименование КАК ЕдиницаИзмеренияНаименование,
	|	ДанныеУпаковок.ЕдиницаИзмеренияКод КАК ЕдиницаИзмеренияКод,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	ТаблицаТоваров.Характеристика.НаименованиеПолное КАК ХарактеристикаНаименование,
	|	ТаблицаТоваров.Серия.Наименование КАК СерияНаименование,
	|	ДанныеУпаковок.Упаковка КАК Упаковка,
	|	ДанныеУпаковок.УпаковкаНаименование КАК УпаковкаНаименование,
	|	ДанныеУпаковок.ВидУпаковки КАК ВидУпаковки,
	|	ТаблицаТоваров.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаТоваров.НомерГТД КАК НомерГТД,
	|	ТаблицаТоваров.НомерГТД.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ДанныеУпаковок.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА ДанныеУпаковок.КоличествоМестДробное = (ВЫРАЗИТЬ(ДанныеУпаковок.КоличествоМестДробное КАК ЧИСЛО(12, 0)))
	|			ТОГДА ДанныеУпаковок.КоличествоМестДробное
	|		ИНАЧЕ ВЫРАЗИТЬ(ДанныеУпаковок.КоличествоМестДробное + 0.5 КАК ЧИСЛО(12, 0))
	|	КОНЕЦ КАК КоличествоМест,
	|	ВЫБОР
	|		КОГДА ДанныеУпаковок.ЕдиницаИзмерения = ДанныеУпаковок.Упаковка.ЕдиницаИзмерения
	|			ТОГДА 1
	|		ИНАЧЕ ДанныеУпаковок.КоличествоВОдномМесте
	|	КОНЕЦ КАК КоличествоВОдномМесте,
	|	ВЫБОР
	|		КОГДА НЕ &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ВЫБОР
	|				КОГДА НЕ ТаблицаТоваров.КоличествоУпаковок = 0
	|					ТОГДА ТаблицаТоваров.СуммаБезНДС / ТаблицаТоваров.КоличествоУпаковок
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|			КОГДА НЕ ТаблицаТоваров.Количество = 0
	|				ТОГДА ТаблицаТоваров.СуммаБезНДС / ТаблицаТоваров.Количество
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	КОНЕЦ КАК Цена,
	|	ТаблицаТоваров.СуммаБезНДС КАК СуммаБезНДС,
	|	ТаблицаТоваров.СуммаНДС КАК СуммаНДС,
	|	ТаблицаТоваров.СуммаБезНДС + ТаблицаТоваров.СуммаНДС КАК СуммаСНДС,
	|	ТаблицаТоваров.МассаНетто КАК МассаНетто,
	|	ВЫБОР
	|		КОГДА ДанныеУпаковок.КоличествоМестДробное = (ВЫРАЗИТЬ(ДанныеУпаковок.КоличествоМестДробное КАК ЧИСЛО(12, 0)))
	|			ТОГДА ДанныеУпаковок.КоличествоМестДробное
	|		ИНАЧЕ ВЫРАЗИТЬ(ДанныеУпаковок.КоличествоМестДробное + 0.5 КАК ЧИСЛО(12, 0))
	|	КОНЕЦ * ЕСТЬNULL(ДанныеУпаковок.МассаБруттоОдногоМеста, 0) - (ВЫБОР
	|		КОГДА ДанныеУпаковок.КоличествоМестДробное = (ВЫРАЗИТЬ(ДанныеУпаковок.КоличествоМестДробное КАК ЧИСЛО(12, 0)))
	|			ТОГДА ДанныеУпаковок.КоличествоМестДробное
	|		ИНАЧЕ ВЫРАЗИТЬ(ДанныеУпаковок.КоличествоМестДробное + 0.5 КАК ЧИСЛО(12, 0))
	|	КОНЕЦ * ЕСТЬNULL(ДанныеУпаковок.КоличествоВОдномМесте, 1) - ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаТоваров.Количество
	|		ИНАЧЕ (ВЫБОР 
	|				КОГДА ТаблицаТоваров.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|				ТОГДА (ВЫБОР
	|						КОГДА ДанныеУпаковок.КоличествоМестДробное = (ВЫРАЗИТЬ(ДанныеУпаковок.КоличествоМестДробное КАК ЧИСЛО(12, 0)))
	|							ТОГДА ДанныеУпаковок.КоличествоМестДробное
	|						ИНАЧЕ ВЫРАЗИТЬ(ДанныеУпаковок.КоличествоМестДробное + 0.5 КАК ЧИСЛО(12, 0))
	|						КОНЕЦ) * ЕСТЬNULL(ДанныеУпаковок.КоличествоВОдномМесте, 1)
	|				ИНАЧЕ ТаблицаТоваров.КоличествоУпаковок * ЕСТЬNULL(ДанныеУпаковок.КоличествоВОдномМесте, 1)
	|			КОНЕЦ)
	|	КОНЕЦ) * ДанныеУпаковок.МассаНеттоОднойУпаковки / ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(ДанныеУпаковок.КоличествоВОдномМесте, 1)
	|	КОНЕЦ КАК МассаБрутто,
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТоваров.НомерСтрокиНаборы КАК НомерСтрокиНаборы,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.Ссылка.ВернутьМногооборотнуюТару
	|		И ТаблицаТоваров.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоВозвратнаяТара
	|ИЗ
	|	РеализацияТоваровУслугТаблицаТоваров КАК ТаблицаТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ РасчитанныеДанныеУпаковокЕдиницИзмерения КАК ДанныеУпаковок
	|		ПО ТаблицаТоваров.Ссылка = ДанныеУпаковок.Ссылка
	|		И ТаблицаТоваров.НомерСтроки = ДанныеУпаковок.НомерСтроки
	|		И ТаблицаТоваров.Номенклатура = ДанныеУпаковок.Номенклатура
	|		И ТаблицаТоваров.Характеристика = ДанныеУпаковок.Характеристика
	|		И ТаблицаТоваров.НомерГТД = ДанныеУпаковок.НомерГТД
	|ГДЕ
	|	(ТаблицаТоваров.ЭтоТовар
	|	ИЛИ &ВыводитьУслуги)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтрокиНаборы,
	|	ЭтоНабор УБЫВ,
	|	НомерСтроки
	|ИТОГИ
	|ПО
	|	Ссылка";    
	#КонецУдаления
	#Вставка 
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслуг.Номер КАК Номер,
	|	РеализацияТоваровУслуг.Дата КАК Дата,
	|	РеализацияТоваровУслуг.Статус КАК Статус,
	|	РеализацияТоваровУслуг.Партнер КАК Партнер,
	|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Организация.ОбособленноеПодразделение
	|			ТОГДА РеализацияТоваровУслуг.Организация.ГоловнаяОрганизация
	|		ИНАЧЕ РеализацияТоваровУслуг.Организация
	|	КОНЕЦ КАК Организация,
	|	ТаблицаОтветственныеЛица.РуководительНаименование КАК Руководитель,
	|	ТаблицаОтветственныеЛица.РуководительДолжность КАК ДолжностьРуководителя,
	|	ТаблицаОтветственныеЛица.ГлавныйБухгалтерНаименование КАК ГлавныйБухгалтер,
	|	РеализацияТоваровУслуг.Отпустил КАК Кладовщик,
	|	РеализацияТоваровУслуг.ОтпустилДолжность КАК ДолжностьКладовщика,
	|	РеализацияТоваровУслуг.Организация.Префикс КАК Префикс,
	|	РеализацияТоваровУслуг.Основание КАК Основание,
	|	РеализацияТоваровУслуг.ОснованиеДата КАК ОснованиеДата,
	|	РеализацияТоваровУслуг.ОснованиеНомер КАК ОснованиеНомер,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслуг.Контрагент
	|		ИНАЧЕ РеализацияТоваровУслуг.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслуг.Организация
	|		ИНАЧЕ РеализацияТоваровУслуг.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	РеализацияТоваровУслуг.БанковскийСчетОрганизации КАК БанковскийСчетОрганизации,
	|	РеализацияТоваровУслуг.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента,
	|	РеализацияТоваровУслуг.БанковскийСчетГрузоотправителя КАК БанковскийСчетГрузоотправителя,
	|	РеализацияТоваровУслуг.БанковскийСчетГрузополучателя КАК БанковскийСчетГрузополучателя,
	|	РеализацияТоваровУслуг.АдресДоставки КАК АдресДоставки,
	|	НЕОПРЕДЕЛЕНО КАК Подразделение,
	|	РеализацияТоваровУслуг.Валюта КАК Валюта,
	|	РеализацияТоваровУслуг.НалогообложениеНДС КАК НалогообложениеНДС,
	|	РеализацияТоваровУслуг.ДоверенностьНомер КАК ДоверенностьНомер,
	|	РеализацияТоваровУслуг.ДоверенностьДата КАК ДоверенностьДата,
	|	РеализацияТоваровУслуг.ДоверенностьВыдана КАК ДоверенностьВыдана,
	|	РеализацияТоваровУслуг.ДоверенностьЛицо КАК ДоверенностьЛицо,
	|	&ЕдиницаИзмеренияВеса КАК ЕдиницаИзмеренияВеса
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокументов КАК ДанныеДокументов
	|		ПО РеализацияТоваровУслуг.Ссылка = ДанныеДокументов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтветственныеЛица КАК ТаблицаОтветственныеЛица
	|		ПО РеализацияТоваровУслуг.Ссылка = ТаблицаОтветственныеЛица.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Ссылка КАК Ссылка,
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ &ТекстЗапросаЕдиницаИзмерения
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.Представление
	|		ИНАЧЕ &ТекстЗапросаНаименованиеЕдиницыИзмерения1
	|	КОНЕЦ КАК ЕдиницаИзмеренияНаименование,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения.Код
	|		ИНАЧЕ &ТекстЗапросаКодЕдиницыИзмерения
	|	КОНЕЦ КАК ЕдиницаИзмеренияКод,
	|	ТаблицаТоваров.Упаковка КАК Упаковка,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1) = 1
	|			ТОГДА """"
	|		ИНАЧЕ ТаблицаТоваров.Упаковка.Наименование
	|	КОНЕЦ КАК УпаковкаНаименование,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА &ТекстЗапросаНаименованиеЕдиницыИзмерения1
	|		ИНАЧЕ &ТекстЗапросаНаименованиеЕдиницыИзмерения2
	|	КОНЕЦ КАК ВидУпаковки,
	|	ВЫБОР
	|		КОГДА НЕ &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаТоваров.КоличествоУпаковок
	|		ИНАЧЕ ТаблицаТоваров.Количество
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА НЕ &ВыводитьБазовыеЕдиницыИзмерения
	|		И НЕ ТаблицаТоваров.ЭтоНабор
	|			ТОГДА ВЫБОР
	|				КОГДА КоэффициентыУпаковок.Количество < КоэффициентыУпаковок.КоэффициентВложеннойУпаковки
	|				ИЛИ ТаблицаТоваров.Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|				И ((ТаблицаТоваров.Номенклатура.ВесИспользовать
	|				И ТаблицаТоваров.Номенклатура.ВесМожноУказыватьВДокументах
	|				И ТаблицаТоваров.Упаковка = ТаблицаТоваров.Номенклатура.ВесЕдиницаИзмерения)
	|				ИЛИ (ТаблицаТоваров.Номенклатура.ОбъемИспользовать
	|				И ТаблицаТоваров.Номенклатура.ОбъемМожноУказыватьВДокументах
	|				И ТаблицаТоваров.Упаковка = ТаблицаТоваров.Номенклатура.ОбъемЕдиницаИзмерения)
	|				ИЛИ (ТаблицаТоваров.Номенклатура.ДлинаИспользовать
	|				И ТаблицаТоваров.Номенклатура.ДлинаМожноУказыватьВДокументах
	|				И ТаблицаТоваров.Упаковка = ТаблицаТоваров.Номенклатура.ДлинаЕдиницаИзмерения)
	|				ИЛИ (ТаблицаТоваров.Номенклатура.ПлощадьИспользовать
	|				И ТаблицаТоваров.Номенклатура.ПлощадьМожноУказыватьВДокументах
	|				И ТаблицаТоваров.Упаковка = ТаблицаТоваров.Номенклатура.ПлощадьЕдиницаИзмерения))
	|					ТОГДА КоэффициентыУпаковок.КоличествоУпаковок
	|				ИНАЧЕ ТаблицаТоваров.Количество / КоэффициентыУпаковок.КоэффициентВложеннойУпаковки
	|			КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|			КОГДА ТаблицаТоваров.Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			И &ВыводитьБазовыеЕдиницыИзмерения
	|			И ((ТаблицаТоваров.Номенклатура.ВесИспользовать
	|			И ТаблицаТоваров.Номенклатура.ВесМожноУказыватьВДокументах
	|			И ТаблицаТоваров.Упаковка = ТаблицаТоваров.Номенклатура.ВесЕдиницаИзмерения)
	|			ИЛИ (ТаблицаТоваров.Номенклатура.ОбъемИспользовать
	|			И ТаблицаТоваров.Номенклатура.ОбъемМожноУказыватьВДокументах
	|			И ТаблицаТоваров.Упаковка = ТаблицаТоваров.Номенклатура.ОбъемЕдиницаИзмерения)
	|			ИЛИ (ТаблицаТоваров.Номенклатура.ДлинаИспользовать
	|			И ТаблицаТоваров.Номенклатура.ДлинаМожноУказыватьВДокументах
	|			И ТаблицаТоваров.Упаковка = ТаблицаТоваров.Номенклатура.ДлинаЕдиницаИзмерения)
	|			ИЛИ (ТаблицаТоваров.Номенклатура.ПлощадьИспользовать
	|			И ТаблицаТоваров.Номенклатура.ПлощадьМожноУказыватьВДокументах
	|			И ТаблицаТоваров.Упаковка = ТаблицаТоваров.Номенклатура.ПлощадьЕдиницаИзмерения))
	|				ТОГДА ТаблицаТоваров.КоличествоУпаковок
	|			КОГДА ТаблицаТоваров.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ИЛИ ТаблицаТоваров.Упаковка = (ВЫБОР
	|				КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|					ТОГДА ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения
	|				ИНАЧЕ &ТекстЗапросаЕдиницаИзмерения
	|			КОНЕЦ)
	|				ТОГДА ТаблицаТоваров.Количество
	|			ИНАЧЕ ТаблицаТоваров.Количество / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1)
	|		КОНЕЦ
	|	КОНЕЦ КАК КоличествоМестДробное,
	|	ВЫБОР
	|		КОГДА НЕ &ВыводитьБазовыеЕдиницыИзмерения
	|		И Не ТаблицаТоваров.ЭтоНабор
	|			ТОГДА ВЫБОР
	|				КОГДА ТаблицаТоваров.Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|				И ТаблицаТоваров.Упаковка = &ТекстЗапросаЕдиницаИзмерения
	|					ТОГДА 1
	|				ИНАЧЕ КоэффициентыУпаковок.КоэффициентВложеннойУпаковки
	|			КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|			КОГДА ТаблицаТоваров.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ИЛИ ТаблицаТоваров.Упаковка = (ВЫБОР
	|				КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|					ТОГДА ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения
	|				ИНАЧЕ &ТекстЗапросаЕдиницаИзмерения
	|			КОНЕЦ)
	|				ТОГДА 1
	|			ИНАЧЕ &ТекстЗапросаКоэффициентУпаковки
	|		КОНЕЦ
	|	КОНЕЦ КАК КоличествоВОдномМесте,
	|	ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА &ТекстЗапросаВесУпаковки
	|		ИНАЧЕ &ТекстЗапросаВесВидаУпаковки
	|	КОНЕЦ КАК МассаБруттоОдногоМеста,
	|	ЕСТЬNULL(КоэффициентыУпаковок.КоэффициентУпаковки, 1) * ТаблицаТоваров.МассаНеттоНоменклатуры КАК
	|		МассаНеттоОднойУпаковки,
	|	ТаблицаТоваров.НомерГТД КАК НомерГТД,
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	1 КАК КоэффициентУпаковки
	|ПОМЕСТИТЬ РасчитанныеДанныеУпаковокЕдиницИзмерения
	|ИЗ
	|	РеализацияТоваровУслугТаблицаТоваров КАК ТаблицаТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыУпаковок КАК КоэффициентыУпаковок
	|		ПО ТаблицаТоваров.Ссылка = КоэффициентыУпаковок.Ссылка
	|		И ТаблицаТоваров.НомерСтроки = КоэффициентыУпаковок.НомерСтроки
	|		И ТаблицаТоваров.Номенклатура = КоэффициентыУпаковок.Номенклатура
	|		И ТаблицаТоваров.КоличествоУпаковок = КоэффициентыУпаковок.КоличествоУпаковок
	|		И (НЕ &ВыводитьБазовыеЕдиницыИзмерения)
	|ГДЕ
	|	(ТаблицаТоваров.ЭтоТовар
	|	ИЛИ &ВыводитьУслуги)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	НомерСтроки,
	|	Номенклатура,
	|	Характеристика,
	|	НомерГТД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Ссылка КАК Ссылка,
	|	ТаблицаТоваров.ВариантПредставленияНабораВПечатныхФормах КАК ВариантПредставленияНабораВПечатныхФормах,
	|	ТаблицаТоваров.ВариантРасчетаЦеныНабора КАК ВариантРасчетаЦеныНабора,
	|	ТаблицаТоваров.НоменклатураНабора КАК НоменклатураНабора,
	//БИТ_Гурьев__02.05.24++
	|	максимум("""") КАК ХарактеристикаНабора,
	//БИТ_Гурьев__02.05.24--
	|	ТаблицаТоваров.ЭтоКомплектующие КАК ЭтоКомплектующие,
	|	ТаблицаТоваров.ЭтоНабор КАК ЭтоНабор,
	|	ТаблицаТоваров.ПолныйНабор КАК ПолныйНабор,
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.Номенклатура.НаименованиеПолное КАК НоменклатураНаименование,
	|	ТаблицаТоваров.Номенклатура.Наименование КАК НоменклатураНаименованиеКраткое,
	|	ВЫБОР
	|		КОГДА &КолонкаКодов = ""Артикул""
	|			ТОГДА ТаблицаТоваров.Номенклатура.Артикул
	|		ИНАЧЕ ТаблицаТоваров.Номенклатура.Код
	|	КОНЕЦ КАК НоменклатураКод,
	|	ДанныеУпаковок.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	//БИТ_Гурьев__02.05.24++
	|	максимум(ДанныеУпаковок.ЕдиницаИзмерения.Наименование) КАК ЕдиницаИзмеренияНаименование,
	//БИТ_Гурьев__02.05.24--
	|	ДанныеУпаковок.ЕдиницаИзмеренияКод КАК ЕдиницаИзмеренияКод,
	//БИТ_Гурьев__02.05.24++
	|	максимум("""") КАК Характеристика,
	|	максимум("""") КАК ХарактеристикаНаименование,
	//БИТ_Гурьев__02.05.24--
	|	ТаблицаТоваров.Серия.Наименование КАК СерияНаименование,
	|	ДанныеУпаковок.Упаковка КАК Упаковка,
	|	ДанныеУпаковок.УпаковкаНаименование КАК УпаковкаНаименование,
	|	ДанныеУпаковок.ВидУпаковки КАК ВидУпаковки,
	|	ТаблицаТоваров.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаТоваров.НомерГТД КАК НомерГТД,
	|	ТаблицаТоваров.НомерГТД.СтранаПроисхождения КАК СтранаПроисхождения,
	//БИТ_Гурьев__02.05.24++
	|	сумма(ДанныеУпаковок.Количество) КАК Количество,
	|	сумма(ВЫБОР
	|		КОГДА ДанныеУпаковок.КоличествоМестДробное = (ВЫРАЗИТЬ(ДанныеУпаковок.КоличествоМестДробное КАК ЧИСЛО(12, 0)))
	|			ТОГДА ДанныеУпаковок.КоличествоМестДробное
	|		ИНАЧЕ ВЫРАЗИТЬ(ДанныеУпаковок.КоличествоМестДробное + 0.5 КАК ЧИСЛО(12, 0))
	|	КОНЕЦ) КАК КоличествоМест,
	|	сумма(ВЫБОР
	|		КОГДА ДанныеУпаковок.ЕдиницаИзмерения = ДанныеУпаковок.Упаковка.ЕдиницаИзмерения
	|			ТОГДА 1
	|		ИНАЧЕ ДанныеУпаковок.КоличествоВОдномМесте
	|	КОНЕЦ) КАК КоличествоВОдномМесте,
	//БИТ_Гурьев__02.05.24--
	|	ВЫБОР
	|		КОГДА НЕ &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ВЫБОР
	|				КОГДА НЕ ТаблицаТоваров.КоличествоУпаковок = 0
	|					ТОГДА ТаблицаТоваров.СуммаБезНДС / ТаблицаТоваров.КоличествоУпаковок
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|			КОГДА НЕ ТаблицаТоваров.Количество = 0
	|				ТОГДА ТаблицаТоваров.СуммаБезНДС / ТаблицаТоваров.Количество
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	КОНЕЦ КАК Цена,
	//БИТ_Гурьев__02.05.24++
	|	сумма(ТаблицаТоваров.СуммаБезНДС) КАК СуммаБезНДС,
	|	сумма(ТаблицаТоваров.СуммаНДС) КАК СуммаНДС,
	|	сумма(ТаблицаТоваров.СуммаБезНДС + ТаблицаТоваров.СуммаНДС) КАК СуммаСНДС,
	|	сумма(ТаблицаТоваров.МассаНетто) КАК МассаНетто,
	|	сумма(ВЫБОР
	|		КОГДА ДанныеУпаковок.КоличествоМестДробное = (ВЫРАЗИТЬ(ДанныеУпаковок.КоличествоМестДробное КАК ЧИСЛО(12, 0)))
	|			ТОГДА ДанныеУпаковок.КоличествоМестДробное
	|		ИНАЧЕ ВЫРАЗИТЬ(ДанныеУпаковок.КоличествоМестДробное + 0.5 КАК ЧИСЛО(12, 0))
	|	КОНЕЦ * ЕСТЬNULL(ДанныеУпаковок.МассаБруттоОдногоМеста, 0) - (ВЫБОР
	|		КОГДА ДанныеУпаковок.КоличествоМестДробное = (ВЫРАЗИТЬ(ДанныеУпаковок.КоличествоМестДробное КАК ЧИСЛО(12, 0)))
	|			ТОГДА ДанныеУпаковок.КоличествоМестДробное
	|		ИНАЧЕ ВЫРАЗИТЬ(ДанныеУпаковок.КоличествоМестДробное + 0.5 КАК ЧИСЛО(12, 0))
	|	КОНЕЦ * ЕСТЬNULL(ДанныеУпаковок.КоличествоВОдномМесте, 1) - ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ТаблицаТоваров.Количество
	|		ИНАЧЕ ТаблицаТоваров.КоличествоУпаковок * ЕСТЬNULL(ДанныеУпаковок.КоличествоВОдномМесте, 1)
	|	КОНЕЦ) * ДанныеУпаковок.МассаНеттоОднойУпаковки / ВЫБОР
	|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(ДанныеУпаковок.КоличествоВОдномМесте, 1)
	|	КОНЕЦ) КАК МассаБрутто,
	|	максимум(ТаблицаТоваров.НомерСтроки) КАК НомерСтроки,
	|	максимум(ТаблицаТоваров.НомерСтрокиНаборы) КАК НомерСтрокиНаборы,
	//БИТ_Гурьев__02.05.24--
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.Ссылка.ВернутьМногооборотнуюТару
	|		И ТаблицаТоваров.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоВозвратнаяТара
	|ИЗ
	|	РеализацияТоваровУслугТаблицаТоваров КАК ТаблицаТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ РасчитанныеДанныеУпаковокЕдиницИзмерения КАК ДанныеУпаковок
	|		ПО ТаблицаТоваров.Ссылка = ДанныеУпаковок.Ссылка
	|		И ТаблицаТоваров.НомерСтроки = ДанныеУпаковок.НомерСтроки
	|		И ТаблицаТоваров.Номенклатура = ДанныеУпаковок.Номенклатура
	|		И ТаблицаТоваров.Характеристика = ДанныеУпаковок.Характеристика
	|		И ТаблицаТоваров.НомерГТД = ДанныеУпаковок.НомерГТД
	|ГДЕ
	|	(ТаблицаТоваров.ЭтоТовар
	|	ИЛИ &ВыводитьУслуги)
	|
	//БИТ_Гурьев__02.05.24++
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.Ссылка,
	|	ТаблицаТоваров.ВариантПредставленияНабораВПечатныхФормах,
	|	ТаблицаТоваров.ВариантРасчетаЦеныНабора,
	|	ТаблицаТоваров.НоменклатураНабора,
	|	ТаблицаТоваров.ЭтоКомплектующие,
	|	ТаблицаТоваров.ЭтоНабор,
	|	ТаблицаТоваров.ПолныйНабор,
	|	ТаблицаТоваров.Номенклатура,
	|	ТаблицаТоваров.Номенклатура.НаименованиеПолное,
	|	ТаблицаТоваров.Номенклатура.Наименование,
	|	ВЫБОР
	|		КОГДА &КолонкаКодов = ""Артикул""
	|			ТОГДА ТаблицаТоваров.Номенклатура.Артикул
	|		ИНАЧЕ ТаблицаТоваров.Номенклатура.Код
	|	КОНЕЦ,
	|	ДанныеУпаковок.ЕдиницаИзмерения,
	//|	ДанныеУпаковок.ЕдиницаИзмеренияНаименование,
	|	ДанныеУпаковок.ЕдиницаИзмеренияКод,
	|	ТаблицаТоваров.Серия.Наименование,
	|	ДанныеУпаковок.Упаковка,
	|	ДанныеУпаковок.УпаковкаНаименование,
	|	ДанныеУпаковок.ВидУпаковки,
	|	ТаблицаТоваров.СтавкаНДС,
	|	ТаблицаТоваров.НомерГТД,
	|	ТаблицаТоваров.НомерГТД.СтранаПроисхождения,
	|	ВЫБОР
	|		КОГДА НЕ &ВыводитьБазовыеЕдиницыИзмерения
	|			ТОГДА ВЫБОР
	|				КОГДА НЕ ТаблицаТоваров.КоличествоУпаковок = 0
	|					ТОГДА ТаблицаТоваров.СуммаБезНДС / ТаблицаТоваров.КоличествоУпаковок
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|			КОГДА НЕ ТаблицаТоваров.Количество = 0
	|				ТОГДА ТаблицаТоваров.СуммаБезНДС / ТаблицаТоваров.Количество
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.Ссылка.ВернутьМногооборотнуюТару
	|		И ТаблицаТоваров.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	//|	ТаблицаТоваров.ХарактеристикаНабора,
	//|	ТаблицаТоваров.Характеристика,
	//|	ТаблицаТоваров.Характеристика.НаименованиеПолное
	//БИТ_Гурьев__02.05.24--
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтрокиНаборы,
	|	ЭтоНабор УБЫВ,
	|	НомерСтроки
	|ИТОГИ
	|ПО
	|	Ссылка";
	
	#КонецВставки

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаКоэффициентУпаковки",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
	"ТаблицаТоваров.Упаковка",
	"ТаблицаТоваров.Номенклатура"));

	Запрос.Текст = СтрЗаменить(
	Запрос.Текст, 
	"&ТекстЗапросаВесУпаковки",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки(
	"ТаблицаТоваров.Упаковка",
	"ТаблицаТоваров.Номенклатура"));

	Запрос.Текст = СтрЗаменить(
	Запрос.Текст, 
	"&ТекстЗапросаВесВидаУпаковки",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки(
	"КоэффициентыУпаковок.ВидУпаковки",
	"ТаблицаТоваров.Номенклатура"));

	Запрос.Текст = СтрЗаменить(
	Запрос.Текст,
	"&ТекстЗапросаЕдиницаИзмерения",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаЗначениеРеквизитаЕдиницыИзмерения(
	"Ссылка",
	"ТаблицаТоваров.Упаковка",
	"ТаблицаТоваров.Номенклатура"));

	Запрос.Текст = СтрЗаменить(
	Запрос.Текст,
	"&ТекстЗапросаНаименованиеЕдиницыИзмерения1",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаЗначениеРеквизитаЕдиницыИзмерения(
	"Наименование",
	"ТаблицаТоваров.Упаковка",
	"ТаблицаТоваров.Номенклатура"));

	Запрос.Текст = СтрЗаменить(
	Запрос.Текст,
	"&ТекстЗапросаНаименованиеЕдиницыИзмерения2",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаЗначениеРеквизитаЕдиницыИзмерения(
	"Наименование",
	"КоэффициентыУпаковок.ВидУпаковки",
	"ТаблицаТоваров.Номенклатура"));

	Запрос.Текст = СтрЗаменить(
	Запрос.Текст,
	"&ТекстЗапросаКодЕдиницыИзмерения",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаЗначениеРеквизитаЕдиницыИзмерения(
	"Код",
	"ТаблицаТоваров.Упаковка",
	"ТаблицаТоваров.Номенклатура"));

	Запрос.УстановитьПараметр("ВыводитьУслуги",                  ПараметрыПечати.ВыводитьУслуги);
	Запрос.УстановитьПараметр("КолонкаКодов",                    КолонкаКодов);
	Запрос.УстановитьПараметр("ЕдиницаИзмеренияВеса",            Константы.ЕдиницаИзмеренияВеса.Получить());
	Запрос.УстановитьПараметр("ЗаполненаЕдиницаИзмеренияВеса",   ЗначениеЗаполнено(Константы.ЕдиницаИзмеренияВеса.Получить()));
	Запрос.УстановитьПараметр("ВыводитьБазовыеЕдиницыИзмерения",
	Константы.ВыводитьБазовыеЕдиницыИзмерения.Получить() ИЛИ ПараметрыЗаполнения.ВключаяНомераГТД);

	МассивРезультатов         = Запрос.ВыполнитьПакет();
	РезультатПоШапке          = МассивРезультатов[0];
	РезультатПоТабличнойЧасти = МассивРезультатов[МассивРезультатов.ВГраница()];

	СтруктураДанныхДляПечати 	= Новый Структура("РезультатПоШапке, РезультатПоТабличнойЧасти",
	РезультатПоШапке, РезультатПоТабличнойЧасти);

	Возврат СтруктураДанныхДляПечати;

КонецФункции
