
//&Вместо("ПредставлениеУсловийПоставкиДляПечати")
//Функция КАНАТ_ПредставлениеУсловийПоставкиДляПечати(УсловияОплаты, УсловияДоставки, ПрочиеУсловия)
//	ПредставлениеУсловийПоставки = "";
//	//·++·Гурьев·18.08.23·#2.9·Убрал слово "Оплата"
//	Если Не ПустаяСтрока(УсловияОплаты) Тогда
//		УсловияОплаты = СтрШаблон(НСтр("ru = '%1';
//										|en = 'Payment: %1'"), УсловияОплаты);
//		ПредставлениеУсловийПоставки = УсловияОплаты;
//	КонецЕсли;
//	//·-- Гурьев
//	
//	Если Не ПустаяСтрока(УсловияДоставки) Тогда
//		
//		УсловияДоставки = СтрШаблон(НСтр("ru = 'Доставка: %1';
//										|en = 'Delivery: %1'"), УсловияДоставки);
//		ПредставлениеУсловийПоставки = ПредставлениеУсловийПоставки 
//		                              + ?(ПустаяСтрока(ПредставлениеУсловийПоставки), "", Символы.ПС)
//		                              + УсловияДоставки;
//		
//	КонецЕсли;
//	
//	Если Не ПустаяСтрока(ПрочиеУсловия) Тогда
//		
//		Если ПустаяСтрока(ПредставлениеУсловийПоставки) Тогда
//			ПрочиеУсловия = ПрочиеУсловия;
//		Иначе
//			ПрочиеУсловия = СтрШаблон(НСтр("ru = 'Прочее: %1';
//											|en = 'Other: %1'"), ПрочиеУсловия);
//		КонецЕсли;
//		
//		ПредставлениеУсловийПоставки = ПредставлениеУсловийПоставки 
//		                              + ?(ПустаяСтрока(ПредставлениеУсловийПоставки), "", Символы.ПС)
//		                              + ПрочиеУсловия;
//		
//	КонецЕсли;
//	
//	Возврат ПредставлениеУсловийПоставки;
//КонецФункции

//&ИзменениеИКонтроль("ПредставлениеУсловийПоставкиДляПечати")
//Функция КАНАТ_ПредставлениеУсловийПоставкиДляПечати1(УсловияОплаты, УсловияДоставки, ПрочиеУсловия)

//	ПредставлениеУсловийПоставки = "";

//	Если Не ПустаяСтрока(УсловияОплаты) Тогда
//		УсловияОплаты = СтрШаблон(НСтр("ru = 'Оплата: %1';
//		|en = 'Payment: %1'"), УсловияОплаты);
//		ПредставлениеУсловийПоставки = УсловияОплаты;
//	КонецЕсли;

//	Если Не ПустаяСтрока(УсловияДоставки) Тогда

//		УсловияДоставки = СтрШаблон(НСтр("ru = 'Доставка: %1';
//		|en = 'Delivery: %1'"), УсловияДоставки);
//		ПредставлениеУсловийПоставки = ПредставлениеУсловийПоставки 
//		+ ?(ПустаяСтрока(ПредставлениеУсловийПоставки), "", Символы.ПС)
//		+ УсловияДоставки;

//	КонецЕсли;

//	Если Не ПустаяСтрока(ПрочиеУсловия) Тогда

//		Если ПустаяСтрока(ПредставлениеУсловийПоставки) Тогда
//			ПрочиеУсловия = ПрочиеУсловия;
//		Иначе
//			ПрочиеУсловия = СтрШаблон(НСтр("ru = 'Прочее: %1';
//			|en = 'Other: %1'"), ПрочиеУсловия);
//		КонецЕсли;

//		ПредставлениеУсловийПоставки = ПредставлениеУсловийПоставки 
//		+ ?(ПустаяСтрока(ПредставлениеУсловийПоставки), "", Символы.ПС)
//		+ ПрочиеУсловия;

//	КонецЕсли;

//	Возврат ПредставлениеУсловийПоставки;

//КонецФункции
