//++ Гурьев_ЧТЗ_2.10

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	
	ОбновитьВидимостьТранспорт();
	ИзменениеВыбораВодителя();
КонецПроцедуры

&НаКлиенте
Процедура Перезаполнить(Команда)
	ПерезаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьНаСервере()
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗаказКлиента.Грузополучатель КАК Грузополучатель,
			|	ЗаказКлиента.Партнер КАК Партнер,
			|	ЗаказКлиента.АдресДоставки КАК Адрес,
			|	ЗаказКлиента.СпособДоставки КАК СпособДоставки,
			|	ЗаказКлиента.ПеревозчикПартнер КАК Перевозчик,
			|	ЗаказКлиента.КАНАТ_НомерИДатаДоверенности КАК НомерИДатаДоверенности,
			|	ЗаказКлиента.КАНАТ_ФИОСопроводителя КАК ФИОСопроводителя,
			|	ЗаказКлиента.КАНАТ_Водитель КАК Водитель,
			|	ЗаказКлиента.КАНАТ_ВодительСсылка КАК КАНАТ_ВодительСсылка,
			|	ЗаказКлиента.КАНАТ_ГосНомер КАК ГосНомер,
			|	ЗаказКлиента.КАНАТ_АвтомобильМарка КАК АвтомобильМарка,
			|	ЗаказКлиента.КАНАТ_Транспорт КАК КАНАТ_Транспорт,
			|	ЗаказКлиента.Номер КАК Номер
			|ИЗ
			|	Документ.ЗаказКлиента КАК ЗаказКлиента
			|ГДЕ
			|	ЗаказКлиента.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
			|	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
			|	Сумма(ЗаказКлиентаТовары.Количество) КАК Количество,
			|	ЗаказКлиентаТовары.Цена КАК Цена,
			|	СУММА(ЗаказКлиентаТовары.Сумма) КАК СуммаБезНДС,
			|	ЗаказКлиентаТовары.СтавкаНДС КАК СтавкаНДС,
			|	СУММА(ЗаказКлиентаТовары.СуммаНДС) КАК СуммаНДС,
			|	СУММА(ЗаказКлиентаТовары.СуммаСНДС) КАК СуммаСНДС,
			|	ЗаказКлиентаТовары.КАНАТ_КомментарийКЗаказу КАК КАНАТ_КомментарийКЗаказу,
			|	ЗаказКлиентаТовары.КАНАТ_Сертификат КАК КАНАТ_Сертификат,
			|	ЗаказКлиентаТовары.Номенклатура.ЕдиницаИзмерения КАК Упаковка,
			|	СУММА(ЗаказыКлиентовОстатки.КОтгрузкеОстаток) КАК КОтгрузкеОстаток
			|ИЗ
			|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКОтгрузке.Остатки КАК ЗаказыКлиентовОстатки
			|		ПО ЗаказКлиентаТовары.Ссылка = ЗаказыКлиентовОстатки.ДокументОтгрузки
			|			И ЗаказКлиентаТовары.Номенклатура = ЗаказыКлиентовОстатки.Номенклатура  
			|			И ЗаказКлиентаТовары.Характеристика = ЗаказыКлиентовОстатки.Характеристика
			|			И ЗаказКлиентаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
			|ГДЕ
			|	ЗаказКлиентаТовары.Ссылка = &Ссылка
			|	И ЗаказыКлиентовОстатки.КОформлениюОстаток > 0
			|
			|СГРУППИРОВАТЬ ПО
			|	ЗаказКлиентаТовары.Номенклатура,
			|	ЗаказКлиентаТовары.Характеристика, 
			|	ЗаказКлиентаТовары.КАНАТ_КомментарийКЗаказу, 
			|	ЗаказКлиентаТовары.Цена,
			|	ЗаказКлиентаТовары.СтавкаНДС,
			|	ЗаказКлиентаТовары.КАНАТ_Сертификат,
			|	ЗаказКлиентаТовары.Номенклатура.ЕдиницаИзмерения
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	КАНАТ_РаспоряжениеНаОтгрузку.ПорядковыйНомер КАК ПорядковыйНомер
			|ИЗ
			|	Документ.КАНАТ_РаспоряжениеНаОтгрузку КАК КАНАТ_РаспоряжениеНаОтгрузку
			|ГДЕ
			|	КАНАТ_РаспоряжениеНаОтгрузку.ДокументОснование = &Ссылка
			|
			|УПОРЯДОЧИТЬ ПО
			|	ПорядковыйНомер УБЫВ";		
		Запрос.УстановитьПараметр("Ссылка", Объект.ДокументОснование);
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		ВыборкаРеквизиты = РезультатЗапроса[0].Выбрать();
		
		Если ВыборкаРеквизиты.Следующий() Тогда
			
			ЗаполнитьЗначенияСвойств(Объект, ВыборкаРеквизиты);
			
			Если Не ЗначениеЗаполнено(Объект.Перевозчик) Тогда
				
				Объект.Перевозчик = ВыборкаРеквизиты.Партнер;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ВыборкаТовары = РезультатЗапроса[1].Выбрать();
		
		Объект.Товары.Очистить();
		
		Пока ВыборкаТовары.Следующий() Цикл
			
			СтрокаТовары = Объект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТовары, ВыборкаТовары);
			
		КонецЦикла;
		
		ВыборкаНомер = РезультатЗапроса[2].Выбрать();
		
		//Если ВыборкаНомер.Следующий() Тогда
		//	
		//	Объект.ПорядковыйНомер = ВыборкаНомер.ПорядковыйНомер + 1;
		//	
		//Иначе
		//	
		//	Объект.ПорядковыйНомер = 1;
		//	
		//КонецЕсли;
		
		Объект.Номер = СтрШаблон("%1-%2", Объект.Номер, Объект.ПорядковыйНомер);
		Объект.Дата = ТекущаяДата();
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьТранспорт()
	
	 //Выбора транспорта из спарвочника, в зависимости от способа доставки
	Если Объект.СпособДоставки = Перечисления.СпособыДоставки.ДоКлиента
		ИЛИ Объект.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу Тогда
		
		Элементы.КАНАТ_Транспорт.Видимость = Истина;
		Элементы.Группа1.ТолькоПросмотр = Истина;
		
		Объект.ГосНомер = Объект.КАНАТ_Транспорт.Код;
		Объект.АвтомобильМарка = Объект.КАНАТ_Транспорт.Марка;
		
	Иначе
		
		Элементы.КАНАТ_Транспорт.Видимость = Ложь;
		Элементы.Группа1.ТолькоПросмотр = Ложь;
		
	КонецЕсли;
	
	Если Объект.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчика 
		ИЛИ Объект.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу Тогда
		
		Элементы.Перевозчик.Видимость = Истина;
		
	Иначе
		
		Элементы.Перевозчик.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СпособДоставкиПриИзмененииНаСервере()
	ОбновитьВидимостьТранспорт();
КонецПроцедуры

&НаКлиенте
Процедура СпособДоставкиПриИзменении(Элемент)
	СпособДоставкиПриИзмененииНаСервере();
	ИзменениеВыбораВодителя();
КонецПроцедуры

&НаСервере
Процедура ИзменениеВыбораВодителя()
	
	Если Объект.СпособДоставки = Перечисления.СпособыДоставки.ДоКлиента
		ИЛИ Объект.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу Тогда 
		
		Элементы.Водитель.Видимость = Ложь;
		Элементы.КАНАТ_ВодительСсылка.Видимость = Истина;
	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ФизическиеЛица.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.ФизическиеЛица КАК ФизическиеЛица
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица1
		               |		ПО ФизическиеЛица.Родитель = ФизическиеЛица1.Ссылка
		               |ГДЕ
		               |	ФизическиеЛица1.Наименование = ""Водители""";
					   
		Выборка = Запрос.Выполнить().Выбрать();
		
		ДоступныеФизЛица = Новый Массив;
		
		Пока Выборка.Следующий() Цикл
			
			ДоступныеФизЛица.Добавить(Выборка.Ссылка);
			
		КонецЦикла; 
		
		Параметр = Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(ДоступныеФизЛица));
		мПараметрыВыбора = Новый Массив;
		мПараметрыВыбора.Добавить(Параметр);
		
		//ЭтаФорма.Элементы.Продукция.ПараметрыВыбора = Новый ФиксированныйМассив(мПараметрыВыбора);
		ЭтаФорма.Элементы.КАНАТ_ВодительСсылка.ПараметрыВыбора = Новый ФиксированныйМассив(мПараметрыВыбора);
			
	Иначе 
		
		Элементы.Водитель.Видимость = Истина;
		Элементы.КАНАТ_ВодительСсылка.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура КАНАТ_ТранспортПриИзмененииНаСервере()
	Объект.ГосНомер = Объект.КАНАТ_Транспорт.Код;
	Объект.АвтомобильМарка = Объект.КАНАТ_Транспорт.Марка;
КонецПроцедуры

&НаКлиенте
Процедура КАНАТ_ТранспортПриИзменении(Элемент)
	КАНАТ_ТранспортПриИзмененииНаСервере();
КонецПроцедуры
