//БИТ_Гурьев_ЧТЗ_3.2_11.04.24++
// Заполняет список команд создания на основании.
//
// Параметры:
//  КомандыСоздатьНаОсновании - ТаблицаЗначений - описание в СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании
// Возвращаемое значение:
// 	СтрокаТаблицыЗначений - описание в СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании 
Функция КАНАТ_ДобавитьКомандуСоздатьНаОсновании(КомандыСоздатьНаОсновании) Экспорт

	Если ПравоДоступа("Добавление", Метаданные.Справочники.РесурсныеСпецификации) Тогда
		
		КомандаСоздатьНаОсновании = КомандыСоздатьНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Идентификатор = Метаданные.Справочники.РесурсныеСпецификации.ПолноеИмя();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Справочники.РесурсныеСпецификации.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = ОбщегоНазначенияУТ.ПредставлениеОбъекта(Метаданные.Справочники.РесурсныеСпецификации);
        КомандаСоздатьНаОсновании.Порядок = 2;
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции //БИТ_Гурьев_Чтз_3.2_11.04.24--

&После("ДобавитьКомандыСозданияНаОсновании")
Процедура КАНАТ_ДобавитьКомандыСозданияНаОсновании(КомандыСоздатьНаОсновании, Параметры)
	//БИТ_Гурьев_ЧТЗ_3.2_11.04.24++
	
	ВидимостьВФормах = "ФормаЭлемента";
	
	Команда = Справочники.РесурсныеСпецификации.КАНАТ_ДобавитьКомандуСоздатьНаОсновании(КомандыСоздатьНаОсновании);
	Если Команда <> Неопределено Тогда
		Команда.РежимЗаписи = "Запись";
		Команда.ВидимостьВФормах = ВидимостьВФормах;
	КонецЕсли;
	//БИТ_Гурьев_ЧТЗ_3.2_11.04.24--
КонецПроцедуры

&После("ДобавитьКомандыПечати")
Процедура КАНАТ_ДобавитьКомандыПечати(КомандыПечати)
	//БИТ_Гурьев_ЧТЗ_3.2_15.04.24++
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ТехнологическийПроцесс";
	КомандаПечати.Представление = "Технологический процесс/Заправочная карта";
	КомандаПечати.СписокФорм = "ФормаЭлемента";
	КомандаПечати.Порядок = 1;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ДокладнаяЗаписка";
	КомандаПечати.Представление = "Докладная записка";
	КомандаПечати.СписокФорм = "ФормаЭлемента";
	КомандаПечати.Порядок = 2;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "РасходСырьяМатериалов";
	КомандаПечати.Представление = "Расход сырья и комплектующих материалов";
	КомандаПечати.СписокФорм = "ФормаЭлемента";
	КомандаПечати.Порядок = 3;

	//БИТ_Гурьев_ЧТЗ_3.2_15.04.24--
КонецПроцедуры

//БИТ_Гурьев_ЧТЗ_3.2_15.04.24++
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Для Каждого Документ Из МассивОбъектов Цикл
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТехнологическийПроцесс") Тогда
			СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
				КоллекцияПечатныхФорм,
				"ТехнологическийПроцесс",
				"Технологический процесс/Заправочная карта",
				СформироватьПФТехнологическийПроцессКорректировки(Документ)); //++Бит Трейгер П.М. 15.11.2024 поменял процедуру
		КонецЕсли;
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ДокладнаяЗаписка") Тогда
			СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
				КоллекцияПечатныхФорм,
				"ДокладнаяЗаписка",
				"Докладная записка",
				СформироватьПФДокладнаяЗаписка(Документ));
		КонецЕсли;
			
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РасходСырьяМатериалов") Тогда
			СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
				КоллекцияПечатныхФорм,
				"РасходСырьяМатериалов",
				"Расход сырья и комплектующих материалов",
				СформироватьПФРасходСырьяМатериалов(Документ));
		КонецЕсли;
	КонецЦикла;
	ФормированиеПечатныхФорм.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);

КонецПроцедуры //БИТ_Гурьев_ЧТЗ_3.2_15.04.24--

//БИТ_Гурьев_ЧТЗ_3.2_15.04.24++
Функция СформироватьПФТехнологическийПроцесс(Документ)
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Справочник.РесурсныеСпецификации.КАНАТ_ПФ_MXL_ТехнологическийПроцесс");
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭтапыПроизводства.Ссылка КАК Ссылка,
		|	ЭтапыПроизводства.Наименование КАК Наименование,
		|	ЭтапыПроизводства.КАНАТ_Оборудование КАК КАНАТ_Оборудование,
		|	ЭтапыПроизводства.Описание КАК Описание,
		|	ЭтапыПроизводства.КАНАТ_ЗаправочныеПараметры КАК КАНАТ_ЗаправочныеПараметры,
		|	ЭтапыПроизводстваКАНАТ_Показатели.Показатель КАК Показатель,
		|	ЭтапыПроизводстваКАНАТ_Показатели.Значение КАК Значение
		|ИЗ
		|	Справочник.ЭтапыПроизводства КАК ЭтапыПроизводства
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭтапыПроизводства.КАНАТ_Показатели КАК ЭтапыПроизводстваКАНАТ_Показатели
		|		ПО ЭтапыПроизводстваКАНАТ_Показатели.Ссылка = ЭтапыПроизводства.Ссылка
		|ГДЕ
		|	ЭтапыПроизводства.Владелец = &Владелец
		|	И ЭтапыПроизводства.ПометкаУдаления = Ложь
		|ИТОГИ
		|ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЭтапыПроизводства.Ссылка КАК ЭтапПроизводстваСсылка,
		|	ТехнологическиеОперации.Ссылка КАК ТехнологическаяОперацияСсылка,
		|	ТехнологическиеОперации.Наименование КАК ТехнологическаяОперацияНаименование,
		|	ТехнологическиеОперации.КАНАТ_Оборудование КАК КАНАТ_Оборудование,
		|	ТехнологическиеОперации.КАНАТ_ЗаправочныеПараметры КАК КАНАТ_ЗаправочныеПараметры,
		|	ТехнологическиеОперацииКАНАТ_Показатели.Показатель КАК Показатель,
		|	ТехнологическиеОперацииКАНАТ_Показатели.Значение КАК Значение,
		|	ТехнологическиеОперации.Описание КАК Описание,
		|	ТехнологическиеОперации.ПометкаУдаления КАК ПометкаУдаления
		|ИЗ
		|	Справочник.ЭтапыПроизводства КАК ЭтапыПроизводства
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТехнологическиеОперации КАК ТехнологическиеОперации
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТехнологическиеОперации.КАНАТ_Показатели КАК ТехнологическиеОперацииКАНАТ_Показатели
		|			ПО ТехнологическиеОперации.Ссылка = ТехнологическиеОперацииКАНАТ_Показатели.Ссылка
		|		ПО ЭтапыПроизводства.Ссылка = ТехнологическиеОперации.Владелец
		|ГДЕ
		|	ЭтапыПроизводства.Владелец = &Владелец
		|	И ЭтапыПроизводства.ПометкаУдаления = Ложь
		//|	И (ТехнологическиеОперации.ПометкаУдаления = Ложь ИЛИ ТехнологическиеОперации.Ссылка ЕСТЬ NULL)
		|УПОРЯДОЧИТЬ ПО
		|	ЭтапыПроизводства.НомерЭтапа,
		|	ТехнологическиеОперации.НомерОперации
		|ИТОГИ
		|ПО
		|	ЭтапПроизводстваСсылка,
		|	ТехнологическаяОперацияСсылка";
	
	Запрос.УстановитьПараметр("Владелец", Документ);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаЭтапы = РезультатЗапроса[0].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Этапы = Новый Соответствие;
	
	Пока ВыборкаЭтапы.Следующий() Цикл
		
		Этап = Новый Соответствие;
		Этап.Вставить("Наименование", ВыборкаЭтапы.Наименование);
		Этап.Вставить("Оборудование", ВыборкаЭтапы.КАНАТ_Оборудование);
		Этап.Вставить("ЗаправочныеПараметры", ВыборкаЭтапы.КАНАТ_ЗаправочныеПараметры);
		Этап.Вставить("Описание", ВыборкаЭтапы.Описание);
		
		ВыборкаДетальныеЗаписи = ВыборкаЭтапы.Выбрать();
		
		Показатели = Новый ТаблицаЗначений;
		Показатели.Колонки.Добавить("Показатель", Новый ОписаниеТипов("СправочникСсылка.КАНАТ_ПоказателиОборудования"));
		Показатели.Колонки.Добавить("Значение", Новый ОписаниеТипов("Строка"));
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			НоваяСтрока = Показатели.Добавить();
			НоваяСтрока.Показатель = ВыборкаДетальныеЗаписи.Показатель;
			НоваяСтрока.Значение = ВыборкаДетальныеЗаписи.Значение;
			
		КонецЦикла;
		
		Этап.Вставить("Показатели", Показатели);
		
		Этапы.Вставить(ВыборкаЭтапы.Ссылка, Этап);
		
	КонецЦикла;
	
	ДанныеДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Документ,"Наименование, ОсновноеИзделиеНоменклатура, КАНАТ_Примечание, НачалоДействия");
	
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	ОбластьШапка.Параметры.НаименованиеСпецификации = ДанныеДокумента.Наименование;
	//ОбластьШапка.Параметры.НаименованиеСпецификации =  ДанныеДокумента.ОсновноеИзделиеНоменклатура;
	ТабДок.Вывести(ОбластьШапка);
	
	//Заполнение таблички с этапами и операциями
	ВыборкаЭтапы = РезультатЗапроса[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ТабДокЭтапы = Новый ТабличныйДокумент;
	МассивРучныеОперации = Новый Массив;
	
	Пока ВыборкаЭтапы.Следующий() Цикл
		
		ОбластьЭтап = Макет.ПолучитьОбласть("ОбластьЭтап");
		ОбластьЭтап.Параметры.Этап = ВыборкаЭтапы.ЭтапПроизводстваСсылка;
		
		ВыборкаОперации = ВыборкаЭтапы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		МассивСтрокиОпераций = Новый Массив;
		
		Счетчик = 1;
		
		Пока ВыборкаОперации.Следующий() Цикл
			
			Если ЗначениеЗаполнено(ВыборкаОперации.ТехнологическаяОперацияСсылка) Тогда
				
				Если ВыборкаОперации.ПометкаУдаления Тогда
					
					Продолжить;
					
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(ВыборкаОперации.КАНАТ_Оборудование) Тогда
					
					МассивРучныеОперации.Добавить(ВыборкаОперации.ТехнологическаяОперацияНаименование);
					Продолжить;
					
				КонецЕсли;
				
				Если Счетчик = 1 Тогда
					
					ТабДокОперацииСтрока = Новый ТабличныйДокумент;
					
				КонецЕсли;
				
				ТабДокОперация = Новый ТабличныйДокумент;
				
				ОбластьОперацияШапка = Макет.ПолучитьОбласть("ОбластьОперацияШапка");
				ОбластьОперацияШапка.Параметры.Операция = ВыборкаОперации.ТехнологическаяОперацияСсылка;
				//ОбластьОперацияШапка.Параметры.Этап = ВыборкаОперации.ЭтапПроизводстваСсылка;
				
				ТабДокОперация.Вывести(ОбластьОперацияШапка);
				
				ПоказателиТекст = "";
				
				ВыборкаДетальныеЗаписи = ВыборкаОперации.Выбрать();
				
				//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				//	
				//	ПоказателиТекст = СтрШаблон("%1%2 %3%4",
				//								ПоказателиТекст,
				//								ВыборкаДетальныеЗаписи.Показатель,
				//								ВыборкаДетальныеЗаписи.Значение,
				//								Символы.ПС);
				//	
				//КонецЦикла;
				
				ОперацияТекст = СтрШаблон("%1%2%3%4%5",
										  ВыборкаОперации.Описание,
										  ?(ЗначениеЗаполнено(ВыборкаОперации.Описание), Символы.ПС, ""),
										  ВыборкаОперации.КАНАТ_Оборудование,
										  Символы.ПС,
										  ВыборкаОперации.КАНАТ_ЗаправочныеПараметры);
				
				ОбластьОперация = Макет.ПолучитьОбласть("ОбластьОперация");
				ОбластьОперация.Параметры.ОперацияТекст = ОперацияТекст;
				
				ТабДокОперация.Вывести(ОбластьОперация);
				ТабДокОперацииСтрока.Присоединить(ТабДокОперация);
				
				Счетчик = Счетчик + 1;
				
				Если Счетчик > 4 Тогда
					
					Счетчик = 1;
					МассивСтрокиОпераций.Добавить(ТабДокОперацииСтрока);
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ТабДокЭтапы.Вывести(ОбластьЭтап);
		
		Если ЗначениеЗаполнено(Этапы[ВыборкаЭтапы.ЭтапПроизводстваСсылка]["Описание"])
			ИЛИ ЗначениеЗаполнено(Этапы[ВыборкаЭтапы.ЭтапПроизводстваСсылка]["Оборудование"])
			ИЛИ ЗначениеЗаполнено(Этапы[ВыборкаЭтапы.ЭтапПроизводстваСсылка]["ЗаправочныеПараметры"]) Тогда
			
			ОбластьЭтапТекст = Макет.ПолучитьОбласть("ОбластьЭтапТекст");
			ОбластьЭтапТекст.Параметры.ЭтапТекст = СтрШаблон("%1%2%3%4%5",
									  Этапы[ВыборкаЭтапы.ЭтапПроизводстваСсылка]["Описание"],
									  ?(ЗначениеЗаполнено(Этапы[ВыборкаЭтапы.ЭтапПроизводстваСсылка]["Описание"]), Символы.ПС, ""),
									  Этапы[ВыборкаЭтапы.ЭтапПроизводстваСсылка]["Оборудование"],
									  Символы.ПС,
									  Этапы[ВыборкаЭтапы.ЭтапПроизводстваСсылка]["ЗаправочныеПараметры"]);
			ТабДокЭтапы.Вывести(ОбластьЭтапТекст);
			
		КонецЕсли;
		
		Для Каждого Строка Из МассивСтрокиОпераций Цикл
			
			ТабДокЭтапы.Вывести(Строка);
			
		КонецЦикла;
		
		Если Счетчик > 1 Тогда
			
			ТабДокЭтапы.Вывести(ТабДокОперацииСтрока);
			
		КонецЕсли;
	КонецЦикла;
	
	//Номенклатура
	
	ТабДокНоменклатура = Новый ТабличныйДокумент;
	
	ОбластьНоменклатураШапка = Макет.ПолучитьОбласть("ОбластьНоменклатураШапка");
	ТабДокНоменклатура.Вывести(ОбластьНоменклатураШапка);
	ТабДокНоменклатура.Присоединить(ТабДокЭтапы);

	ТабДокНоменклатура.Область(3, 1, ТабДокЭтапы.ВысотаТаблицы, 2).Объединить();
	ОбластьНоменклатура = ТабДокНоменклатура.Область(3, 1, ТабДокЭтапы.ВысотаТаблицы, 2);
	
	
	Если ЗначениеЗаполнено(ДанныеДокумента.ОсновноеИзделиеНоменклатура) Тогда
		ОбластьНоменклатура.Текст = СтрШаблон("%1%2%3",
											  ДанныеДокумента.ОсновноеИзделиеНоменклатура,
											  Символы.ПС,
											  ДанныеДокумента.ОсновноеИзделиеНоменклатура.Артикул);
	КонецЕсли; 
	
	ОбластьНоменклатура.Шрифт = Новый Шрифт("Arial", 12, Ложь);
	ОбластьНоменклатура.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
	ОбластьНоменклатура.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	ОбластьНоменклатура.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
	ОбластьНоменклатура.ГраницаСлева = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
	ОбластьНоменклатура.ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
	
	ТабДокНоменклатура.Область(1, ТабДокНоменклатура.ШиринаТаблицы, ТабДокНоменклатура.ВысотаТаблицы, ТабДокНоменклатура.ШиринаТаблицы).ГраницаСправа = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
	ТабДокНоменклатура.Область(ТабДокНоменклатура.ВысотаТаблицы, 1, ТабДокНоменклатура.ВысотаТаблицы, ТабДокНоменклатура.ШиринаТаблицы).ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
	
	ТабДок.Вывести(ТабДокНоменклатура);
	
	//Ручные операции
	Для Каждого Строка Из МассивРучныеОперации Цикл
		
		ОбластьРучнаяОперация = Макет.ПолучитьОбласть("ОбластьРучнаяОперация");
		ОбластьРучнаяОперация.Параметры.ОперацияТекст = Строка;
		ТабДок.Вывести(ОбластьРучнаяОперация);
		
	КонецЦикла;
	
	//Подвал
	ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодвал");
	ОбластьПодвал.Параметры.Примечание = ДанныеДокумента.КАНАТ_Примечание;
	ОбластьПодвал.Параметры.Дата = ДанныеДокумента.НачалоДействия;
	ОбластьПодвал.Параметры.Подписант = РегистрыСведений.КАНАТ_ЛицаПодписывающиеЗаПодразделения.ПолучитьСотрудникаПоДолжности(Перечисления.КАНАТ_РолиПодписантов.ВедИнженерТехнолог, ДанныеДокумента.НачалоДействия);
	
	ТабДок.Вывести(ОбластьПодвал);
	
	Возврат ТабДок;
	
КонецФункции //БИТ_Гурьев_ЧТЗ_3.2_15.04.24--

//БИТ_Гурьев_ЧТЗ_3.2_16.04.24++
Функция СформироватьПФДокладнаяЗаписка(Документ)
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	Макет = УправлениеПечатью.МакетПечатнойФормы("Справочник.РесурсныеСпецификации.КАНАТ_ПФ_MXL_ДокладнаяЗаписка");
	
	//Получаем данные
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭтапыПроизводства.Ссылка КАК Ссылка,
		|	ЭтапыПроизводства.Наименование КАК Наименование,
		|	ЭтапыПроизводства.КАНАТ_Оборудование КАК КАНАТ_Оборудование,
		|	ЭтапыПроизводства.КАНАТ_ЗаправочныеПараметры КАК КАНАТ_ЗаправочныеПараметры,
		|	ЭтапыПроизводстваКАНАТ_Показатели.Показатель КАК Показатель,
		|	ЭтапыПроизводстваКАНАТ_Показатели.Значение КАК Значение,
		|	ЭтапыПроизводстваКАНАТ_Показатели.Показатель.ЕдиницаИзмерения КАК ПоказательЕдИзм
		|ИЗ
		|	Справочник.ЭтапыПроизводства КАК ЭтапыПроизводства
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭтапыПроизводства.КАНАТ_Показатели КАК ЭтапыПроизводстваКАНАТ_Показатели
		|		ПО ЭтапыПроизводстваКАНАТ_Показатели.Ссылка = ЭтапыПроизводства.Ссылка
		|ГДЕ
		|	ЭтапыПроизводства.Владелец = &Ссылка
		|	И ЭтапыПроизводства.ПометкаУдаления = Ложь
		|УПОРЯДОЧИТЬ ПО
		|	ЭтапыПроизводстваКАНАТ_Показатели.НомерСтроки
		|ИТОГИ
		|ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЭтапыПроизводства.Ссылка КАК ЭтапПроизводстваСсылка,
		|	ЭтапыПроизводства.НомерЭтапа КАК НомерЭтапа,
		|	ТехнологическиеОперации.Ссылка КАК ТехнологическаяОперацияСсылка,
		|	ТехнологическиеОперации.НомерОперации КАК НомерОперации,
		|	ТехнологическиеОперации.Наименование КАК ТехнологическаяОперацияНаименование,
		|	ТехнологическиеОперации.КАНАТ_Оборудование КАК КАНАТ_Оборудование,
		|	ТехнологическиеОперации.КАНАТ_ЗаправочныеПараметры КАК КАНАТ_ЗаправочныеПараметры,
		|	ТехнологическиеОперацииКАНАТ_Показатели.Показатель КАК Показатель,
		|	ТехнологическиеОперацииКАНАТ_Показатели.Значение КАК Значение,
		|	ТехнологическиеОперации.ПометкаУдаления КАК ПометкаУдаления,
		|	ТехнологическиеОперацииКАНАТ_Показатели.Показатель.ЕдиницаИзмерения КАК ПоказательЕдИзм
		|ИЗ
		|	Справочник.ЭтапыПроизводства КАК ЭтапыПроизводства
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТехнологическиеОперации КАК ТехнологическиеОперации
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТехнологическиеОперации.КАНАТ_Показатели КАК ТехнологическиеОперацииКАНАТ_Показатели
		|			ПО ТехнологическиеОперации.Ссылка = ТехнологическиеОперацииКАНАТ_Показатели.Ссылка
		|		ПО ЭтапыПроизводства.Ссылка = ТехнологическиеОперации.Владелец
		|ГДЕ
		|	ЭтапыПроизводства.Владелец = &Ссылка
		|	И ЭтапыПроизводства.ПометкаУдаления = Ложь
		//|	И ТехнологическиеОперации.ПометкаУдаления = Ложь
		|УПОРЯДОЧИТЬ ПО
		|	ЭтапыПроизводства.НомерЭтапа,
		|	ТехнологическиеОперации.НомерОперации,
		|	ТехнологическиеОперацииКАНАТ_Показатели.НомерСтроки
		|ИТОГИ
		|ПО
		|	ЭтапПроизводстваСсылка,
		|	ТехнологическаяОперацияСсылка
		|;
		|
		|//////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РесурсныеСпецификацииМатериалыИУслуги.Номенклатура КАК Номенклатура,
		|	РесурсныеСпецификацииМатериалыИУслуги.СтатьяКалькуляции.ИдентификаторДляФормул КАК СтатьяКалькуляцииИдентификатор,
		|	РесурсныеСпецификацииМатериалыИУслуги.Упаковка КАК ЕдИзм,
		|	РесурсныеСпецификацииМатериалыИУслуги.КоличествоУпаковок КАК Количество
		|ИЗ
		|	Справочник.РесурсныеСпецификации.МатериалыИУслуги КАК РесурсныеСпецификацииМатериалыИУслуги
		|ГДЕ
		|	РесурсныеСпецификацииМатериалыИУслуги.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Документ);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаЭтапы = РезультатЗапроса[0].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Этапы = Новый Соответствие;
	
	Пока ВыборкаЭтапы.Следующий() Цикл
		
		Этап = Новый Соответствие;
		Этап.Вставить("Наименование", ВыборкаЭтапы.Наименование);
		Этап.Вставить("Оборудование", ВыборкаЭтапы.КАНАТ_Оборудование);
		Этап.Вставить("ЗаправочныеПараметры", ВыборкаЭтапы.КАНАТ_ЗаправочныеПараметры);
		
		ВыборкаДетальныеЗаписи = ВыборкаЭтапы.Выбрать();
		
		Показатели = Новый ТаблицаЗначений;
		Показатели.Колонки.Добавить("Показатель", Новый ОписаниеТипов("СправочникСсылка.КАНАТ_ПоказателиОборудования"));
		Показатели.Колонки.Добавить("Значение", Новый ОписаниеТипов("Строка"));
		Показатели.Колонки.Добавить("ПоказательЕдИзм", Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Показатель) ИЛИ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Значение) Тогда
			
				НоваяСтрока = Показатели.Добавить();
				НоваяСтрока.Показатель = ВыборкаДетальныеЗаписи.Показатель;
				НоваяСтрока.Значение = ВыборкаДетальныеЗаписи.Значение;
				НоваяСтрока.ПоказательЕдИзм = ВыборкаДетальныеЗаписи.ПоказательЕдИзм;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Этап.Вставить("Показатели", Показатели);
		
		Этапы.Вставить(ВыборкаЭтапы.Ссылка, Этап);
		
	КонецЦикла;
	
	ДанныеДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Документ,"Наименование, КАНАТ_ДокладнаяЗаписка, НачалоДействия, ОсновноеИзделиеНоменклатура, ОсновноеИзделиеУпаковка, ОсновноеИзделиеКоличествоУпаковок, ОтветственноеПодразделение");
	
	//Шапка
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	ОбластьШапка.Параметры.Дата = ДанныеДокумента.НачалоДействия;
	ОбластьШапка.Параметры.ДокладнаяЗаписка = ДанныеДокумента.КАНАТ_ДокладнаяЗаписка;
	//ОбластьШапка.Параметры.Начальник = ДанныеДокумента.ОтветственноеПодразделение.ТекущийРуководитель;
	ТабДок.Вывести(ОбластьШапка);
	
	//Сырье
	ТабДокСырье = Новый ТабличныйДокумент;
	
	Счетчик = 0;
	ВыборкаСырье = РезультатЗапроса[2].Выбрать();
	
	Пока ВыборкаСырье.Следующий() Цикл
		
		Если ВыборкаСырье.СтатьяКалькуляцииИдентификатор <> "РасходСырья" Тогда
			Продолжить;
		КонецЕсли;
		
		Счетчик = Счетчик + 1;
		
		ОбластьСырье = Макет.ПолучитьОбласть("ОбластьСырье");
		ОбластьСырье.Параметры.НомерСырья = Счетчик;
		ОбластьСырье.Параметры.Сырье = ВыборкаСырье.Номенклатура;
		
		ТабДокСырье.Вывести(ОбластьСырье);
		
	КонецЦикла;
	
	ТабДокСырьеПолное = Новый ТабличныйДокумент;
	
	ОбластьНадписьСырье = Макет.ПолучитьОбласть("ОбластьНадписьСырье");
	
	ТабДокСырьеПолное.Вывести(ОбластьНадписьСырье);
	ТабДокСырьеПолное.Присоединить(ТабДокСырье);
	
	ТабДок.Вывести(ТабДокСырьеПолное);
	
	ОбластьПустаяСтрока = Макет.ПолучитьОбласть("ОбластьПустаяСтрока");
	ТабДок.Вывести(ОбластьПустаяСтрока);
	
	//ОсновнаяТабличка
	ВыборкаЭтапы = РезультатЗапроса[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	СчетчикЭтап = 0;
	Пока ВыборкаЭтапы.Следующий() Цикл
		
		СчетчикЭтап = СчетчикЭтап + 1;
		ОбластьЭтап = Макет.ПолучитьОбласть("ОбластьЭтап");
		ОбластьЭтап.Параметры.НомерСтрокиЭтап = СчетчикЭтап;
		ОбластьЭтап.Параметры.Этап = ВыборкаЭтапы.ЭтапПроизводстваСсылка;
		//ОбластьЭтап.Параметры.НомерЭтапа = СчетчикЭтап;
		
		ТабДок.Вывести(ОбластьЭтап);
		
		//ВывестиПустуюСтроку = Ложь;
		
		Для Каждого СтрокаПоказатели Из Этапы[ВыборкаЭтапы.ЭтапПроизводстваСсылка]["Показатели"]Цикл
			
			//ВывестиПустуюСтроку = Истина;
			
			ОбластьПараметр = Макет.ПолучитьОбласть("ОбластьПараметр");
			ОбластьПараметр.Параметры.Параметр = СтрокаПоказатели.Показатель;
			ОбластьПараметр.Параметры.Значение = СтрокаПоказатели.Значение;
			ОбластьПараметр.Параметры.ЕдИзм = ?(ЗначениеЗаполнено(СтрокаПоказатели.ПоказательЕдИзм),
												", " + Строка(СтрокаПоказатели.ПоказательЕдИзм),
												"");
			
			ТабДок.Вывести(ОбластьПараметр);
			
		КонецЦикла;
		
		//Если ВывестиПустуюСтроку Тогда
		//	
		//	ОбластьПустаяСтрока = Макет.ПолучитьОбласть("ОбластьПустаяСтрока");
		//	ТабДок.Вывести(ОбластьПустаяСтрока);
		//	
		//КонецЕсли;
		
		СчетчикОперация = 0;
		
		ВыборкаОперации = ВыборкаЭтапы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаОперации.Следующий() Цикл
			
			Если ЗначениеЗаполнено(ВыборкаОперации.ТехнологическаяОперацияСсылка) Тогда
				
				Если ВыборкаОперации.ПометкаУдаления Тогда
					
					Продолжить;
					
				КонецЕсли;
				
				//ВывестиПустуюСтроку = Ложь;
				СчетчикОперация = СчетчикОперация + 1;
				
				ОбластьОперация = Макет.ПолучитьОбласть("ОбластьОперация");
				ОбластьОперация.Параметры.НомерСтрокиЭтап = СчетчикЭтап;
				ОбластьОперация.Параметры.НомерСтрокиОперация = СчетчикОперация;
				ОбластьОперация.Параметры.Операция = ВыборкаОперации.ТехнологическаяОперацияСсылка;
				//ОбластьОперация.Параметры.НомерОперации = СчетчикОперация;
				Если ЗначениеЗаполнено(ВыборкаОперации.КАНАТ_Оборудование) Тогда
					
					ОбластьОперация.Параметры.Машина = СтрШаблон("на машине %1", ВыборкаОперации.КАНАТ_Оборудование);
					
				КонецЕсли;
				
				ТабДок.Вывести(ОбластьОперация);
				
				ВыборкаДетальныеЗаписи = ВыборкаОперации.Выбрать();
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					
					Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Показатель) ИЛИ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Значение) Тогда
					
						ОбластьПараметр = Макет.ПолучитьОбласть("ОбластьПараметр");
						ОбластьПараметр.Параметры.Параметр = ВыборкаДетальныеЗаписи.Показатель;
						ОбластьПараметр.Параметры.Значение = ВыборкаДетальныеЗаписи.Значение;
						ОбластьПараметр.Параметры.ЕдИзм = ?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПоказательЕдИзм),
															", " + Строка(ВыборкаДетальныеЗаписи.ПоказательЕдИзм),
															"");
						
						ТабДок.Вывести(ОбластьПараметр);
					
					КонецЕсли;
					
				КонецЦикла;
			
			КонецЕсли;
			
		КонецЦикла;
		
		ОбластьПустаяСтрока = Макет.ПолучитьОбласть("ОбластьПустаяСтрока");
		ТабДок.Вывести(ОбластьПустаяСтрока);
		
	КонецЦикла;
	
	СчетчикЭтап = СчетчикЭтап + 1;
	ОбластьНормаРасходаСырья = Макет.ПолучитьОбласть("ОбластьНормаРасходаСырья");
	ОбластьНормаРасходаСырья.Параметры.Номер = СчетчикЭтап;
	ТабДок.Вывести(ОбластьНормаРасходаСырья);
	
	ОбластьПустаяСтрока = Макет.ПолучитьОбласть("ОбластьПустаяСтрока");
	ТабДок.Вывести(ОбластьПустаяСтрока);
	
	СчетчикЭтап = СчетчикЭтап + 1;
	
	Номенклатура = ДанныеДокумента.ОсновноеИзделиеНоменклатура;
	ЕдИзм = ДанныеДокумента.ОсновноеИзделиеУпаковка;
	Колво = ДанныеДокумента.ОсновноеИзделиеКоличествоУпаковок;
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		
		ДанныеНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Номенклатура,СтрШаблон("%1%2%3%4",
																		"ЕдиницаИзмерения, ВесИспользовать, ДлинаИспользовать, ОбъемИспользовать, ",
																		"ДлинаЕдиницаИзмерения, ДлинаЗнаменатель, ДлинаЧислитель, ",
																		"ВесЕдиницаИзмерения, ВесЗнаменатель, ВесЧислитель, ",
																		"ОбъемЕдиницаИзмерения, ОбъемЗнаменатель, ОбъемЧислитель"));
		
		ОбластьНормаРасходаНоменклатуры = Макет.ПолучитьОбласть("ОбластьНормаРасходаНоменклатуры");
		ОбластьНормаРасходаНоменклатуры.Параметры.Номер = СчетчикЭтап;
		ОбластьНормаРасходаНоменклатуры.Параметры.ЕдИзм = ДанныеНоменклатуры.ЕдиницаИзмерения;
		ТабДок.Вывести(ОбластьНормаРасходаНоменклатуры);
		
		Коэф = Неопределено;
		
		Если ЕдИзм = ДанныеНоменклатуры.ЕдиницаИзмерения ИЛИ Не ЗначениеЗаполнено(ЕдИзм) Тогда
			Коэф = 1;
		КонецЕсли;
		
		Если ДанныеНоменклатуры.ДлинаИспользовать Тогда
			
			ОбластьПараметр = Макет.ПолучитьОбласть("ОбластьПараметр");
			ОбластьПараметр.Параметры.Параметр = "- длина";
			ОбластьПараметр.Параметры.Значение = СтрШаблон("%1 %2",
															ДанныеНоменклатуры.ДлинаЧислитель/ДанныеНоменклатуры.ДлинаЗнаменатель,
															ДанныеНоменклатуры.ДлинаЕдиницаИзмерения);
			ТабДок.Вывести(ОбластьПараметр);
			
			Если ЕдИзм = ДанныеНоменклатуры.ДлинаЕдиницаИзмерения Тогда
				Коэф = ДанныеНоменклатуры.ДлинаЗнаменатель/ДанныеНоменклатуры.ДлинаЧислитель;
			КонецЕсли;
		КонецЕсли;
		
		Если ДанныеНоменклатуры.ВесИспользовать Тогда
			
			ОбластьПараметр = Макет.ПолучитьОбласть("ОбластьПараметр");
			ОбластьПараметр.Параметры.Параметр = "- масса";
			ОбластьПараметр.Параметры.Значение = СтрШаблон("%1 %2",
															ДанныеНоменклатуры.ВесЧислитель/ДанныеНоменклатуры.ВесЗнаменатель,
															ДанныеНоменклатуры.ВесЕдиницаИзмерения);
			ТабДок.Вывести(ОбластьПараметр);
			
			Если ЕдИзм = ДанныеНоменклатуры.ВесЕдиницаИзмерения Тогда
				Коэф = ДанныеНоменклатуры.ВесЗнаменатель/ДанныеНоменклатуры.ВесЧислитель;
			КонецЕсли;
		КонецЕсли;
		
		Если ДанныеНоменклатуры.ОбъемИспользовать Тогда
			
			ОбластьПараметр = Макет.ПолучитьОбласть("ОбластьПараметр");
			ОбластьПараметр.Параметры.Параметр = "- объем";
			ОбластьПараметр.Параметры.Значение = СтрШаблон("%1 %2",
															ДанныеНоменклатуры.ОбъемЧислитель/ДанныеНоменклатуры.ОбъемЗнаменатель,
															ДанныеНоменклатуры.ОбъемЕдиницаИзмерения);
			ТабДок.Вывести(ОбластьПараметр);
			
			Если ЕдИзм = ДанныеНоменклатуры.ОбъемЕдиницаИзмерения Тогда
				Коэф = ДанныеНоменклатуры.ОбъемЗнаменатель/ДанныеНоменклатуры.ОбъемЧислитель;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Коэф) Тогда
			
			ВыборкаМатериалы = РезультатЗапроса[2].Выбрать();
			Пока ВыборкаМатериалы.Следующий() Цикл
				
				Если ВыборкаМатериалы.СтатьяКалькуляцииИдентификатор <> "ВспомогательныеМатериалы" Тогда
					Продолжить;
				КонецЕсли;
				
				МатериалЕдИзм = ВыборкаМатериалы.ЕдИзм;
				
				Если Не ЗначениеЗаполнено(МатериалЕдИзм) Тогда
					
					МатериалЕдИзм = ВыборкаМатериалы.Номенклатура.ЕдиницаИзмерения;
					
				КонецЕсли;
				
				ОбластьПараметр = Макет.ПолучитьОбласть("ОбластьПараметр");
				ОбластьПараметр.Параметры.Параметр = "- " + ВыборкаМатериалы.Номенклатура.Наименование;
				ОбластьПараметр.Параметры.Значение = СтрШаблон("%1 %2",
																Формат(ВыборкаМатериалы.Количество/(Колво*Коэф),"ЧДЦ=2"),
																МатериалЕдИзм);
				ТабДок.Вывести(ОбластьПараметр);
				
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
	//Подвал
	ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодвал");
	//ОбластьПодвал.Параметры.ФИОНачальник = РегистрыСведений.КАНАТ_ЛицаПодписывающиеЗаПодразделения.ПолучитьСотрудникаПоДолжности(Перечисления.КАНАТ_РолиПодписантов.РуководительТехОтдела, ДанныеДокумента.НачалоДействия);
	//ОбластьПодвал.Параметры.ФИОИнженер = РегистрыСведений.КАНАТ_ЛицаПодписывающиеЗаПодразделения.ПолучитьСотрудникаПоДолжности(Перечисления.КАНАТ_РолиПодписантов.ВедИнженерТехнолог, ДанныеДокумента.НачалоДействия);
	//VVlarionov_13.09.24_1170  
	ОбластьПодвал.Параметры.ФИОИнженер  = Документ.Ответственный;
	ОбластьПодвал.Параметры.ФИОНачальник = ДанныеДокумента.ОтветственноеПодразделение.ТекущийРуководитель;
	НЗ = РегистрыСведений.ТекущиеКадровыеДанныеСотрудников.СоздатьНаборЗаписей();
	НЗ.Отбор.ФизическоеЛицо.УСтановить(Документ.Ответственный.ФизическоеЛицо);
	НЗ.Прочитать();
	Если НЗ.Количество() <> 0 ТОгда
		ОбластьПодвал.Параметры.ОтветственныйДолжность = НЗ[0].ТекущаяДолжность.НаименованиеКраткое;	
	КонецЕсли; 
	НЗ.Отбор.ФизическоеЛицо.Установить(ДанныеДокумента.ОтветственноеПодразделение.ТекущийРуководитель);
	НЗ.Прочитать();
	Если НЗ.Количество() <> 0 ТОгда   
		ОбластьПодвал.Параметры.НачальникДОлжность = НЗ[0].ТекущаяДолжность.НаименованиеКраткое;	
	КонецЕсли;
	  
	
	//VVLarionov
	ТабДок.Вывести(ОбластьПодвал);
	
	Возврат ТабДок;
	
КонецФункции //БИТ_Гурьев_ЧТЗ_3.2_16.04.24--

//БИТ_Гурьев_ЧТЗ_3.2_17.04.24++
Функция СформироватьПФРасходСырьяМатериалов(Документ)
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	Макет = УправлениеПечатью.МакетПечатнойФормы("Справочник.РесурсныеСпецификации.КАНАТ_ПФ_MXL_РасходСырьяМатериалов");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РесурсныеСпецификацииВозвратныеОтходы.НомерСтроки КАК НомерСтроки,
		|	РесурсныеСпецификацииВозвратныеОтходы.Номенклатура КАК ВыходНоменклатура,
		|	РесурсныеСпецификацииВозвратныеОтходы.Упаковка КАК ВыходУпаковка,
		|	РесурсныеСпецификацииВозвратныеОтходы.КоличествоУпаковок КАК ВыходКоличество,
		|	РесурсныеСпецификацииМатериалыИУслуги.Номенклатура КАК МатериалыНоменклатура,
		|	РесурсныеСпецификацииМатериалыИУслуги.НомерСтроки КАК МатериалыНомерСтроки,
		|	РесурсныеСпецификацииМатериалыИУслуги.Упаковка КАК МатериалыУпаковка,
		|	РесурсныеСпецификацииМатериалыИУслуги.КоличествоУпаковок КАК МатериалыКоличество
		|ИЗ
		|	Справочник.РесурсныеСпецификации.ВозвратныеОтходы КАК РесурсныеСпецификацииВозвратныеОтходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РесурсныеСпецификации.МатериалыИУслуги КАК РесурсныеСпецификацииМатериалыИУслуги
		|		ПО (РесурсныеСпецификацииВозвратныеОтходы.Этап = РесурсныеСпецификацииМатериалыИУслуги.Этап
		|			И РесурсныеСпецификацииМатериалыИУслуги.СтатьяКалькуляции.ИдентификаторДляФормул = ""РасходСырья"")
		|ГДЕ
		|	РесурсныеСпецификацииВозвратныеОтходы.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|ИТОГИ
		|	МАКСИМУМ(ВыходНоменклатура),
		|	МАКСИМУМ(ВыходУпаковка),
		|	МАКСИМУМ(ВыходКоличество)
		|ПО
		|	НомерСтроки";
	
	Запрос.УстановитьПараметр("Ссылка", Документ);
	РезультатЗапроса = Запрос.Выполнить();
	
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	ОбластьШапка.Параметры.Артикул = Документ.ОсновноеИзделиеНоменклатура.Артикул;
	ОбластьШапка.Параметры.Номенклатура = Документ.ОсновноеИзделиеНоменклатура;
	ТабДок.Вывести(ОбластьШапка);
	
	Если ЗначениеЗаполнено(Документ.ОсновноеИзделиеУпаковка) Тогда
		ЕдИзм = Документ.ОсновноеИзделиеУпаковка;
	Иначе
		ЕдИзм = Документ.ОсновноеИзделиеНоменклатура.ЕдиницаИзмерения;
	КонецЕсли;
	КолВо = Документ.ОсновноеИзделиеКоличествоУпаковок;
	
	ДанныеНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Документ.ОсновноеИзделиеНоменклатура,СтрШаблон("%1%2%3%4",
																	"ЕдиницаИзмерения, ВесИспользовать, ДлинаИспользовать, ОбъемИспользовать, ",
																	"ДлинаЕдиницаИзмерения, ДлинаЗнаменатель, ДлинаЧислитель, ",
																	"ВесЕдиницаИзмерения, ВесЗнаменатель, ВесЧислитель, ",
																	"ОбъемЕдиницаИзмерения, ОбъемЗнаменатель, ОбъемЧислитель"));
	
	КолВоКГ = 0;
	Если ДанныеНоменклатуры.ВесИспользовать Тогда
		
		Если ЕдИзм = ДанныеНоменклатуры.ВесЕдиницаИзмерения Тогда
			КолВоКГ = КолВо;
		ИначеЕсли ЕдИзм = ДанныеНоменклатуры.ЕдиницаИзмерения Тогда
			КолВоКГ = КолВо/ДанныеНоменклатуры.ВесЗнаменатель*ДанныеНоменклатуры.ВесЧислитель;
		ИначеЕсли ДанныеНоменклатуры.ДлинаИспользовать И ЕдИзм = ДанныеНоменклатуры.ДлинаЕдиницаИзмерения Тогда
			КолВоКГ = КолВо/ДанныеНоменклатуры.ДлинаЧислитель*ДанныеНоменклатуры.ДлинаЗнаменатель/ДанныеНоменклатуры.ВесЗнаменатель*ДанныеНоменклатуры.ВесЧислитель;
		ИначеЕсли ДанныеНоменклатуры.ОбъемИспользовать И ЕдИзм = ДанныеНоменклатуры.ОбъемЕдиницаИзмерения Тогда
			КолВоКГ = КолВо/ДанныеНоменклатуры.ОбъемЧислитель*ДанныеНоменклатуры.ОбъемЗнаменатель/ДанныеНоменклатуры.ВесЗнаменатель*ДанныеНоменклатуры.ВесЧислитель;
		КонецЕсли;
		
	КонецЕсли;
	
	ОбластьТаблицаШапка = Макет.ПолучитьОбласть("ОбластьТаблицаШапка");
	ОбластьТаблицаШапка.Параметры.ЕдИзм = ЕдИзм;
	ТабДок.Вывести(ОбластьТаблицаШапка);
	
	ВыборкаНомерСтроки = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаНомерСтроки.Следующий() Цикл
		
		ОбластьТаблицаНоменклатура = Макет.ПолучитьОбласть("ОбластьТаблицаНоменклатура");
		ОбластьТаблицаНоменклатура.Параметры.Номенклатура = ВыборкаНомерСтроки.ВыходНоменклатура;
		Если ДанныеНоменклатуры.ВесИспользовать Тогда
			ОбластьТаблицаНоменклатура.Параметры.ЕдИзм = ДанныеНоменклатуры.ВесЕдиницаИзмерения;
		Иначе
			ОбластьТаблицаНоменклатура.Параметры.ЕдИзм = "кг";
		КонецЕсли;
		ТабДок.Вывести(ОбластьТаблицаНоменклатура);
		
		ВыборкаДетальныеЗаписи = ВыборкаНомерСтроки.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.МатериалыНоменклатура) Тогда
				Продолжить;
			КонецЕсли;
			
			ОбластьТаблицаСтрока = Макет.ПолучитьОбласть("ОбластьТаблицаСтрока");
			ОбластьТаблицаСтрока.Параметры.Номер = ВыборкаДетальныеЗаписи.МатериалыНомерСтроки;
			ОбластьТаблицаСтрока.Параметры.Артикул = ВыборкаДетальныеЗаписи.МатериалыНоменклатура.Артикул;
			ОбластьТаблицаСтрока.Параметры.Номенклатура = ВыборкаДетальныеЗаписи.МатериалыНоменклатура;
			
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.МатериалыУпаковка) Тогда
				МатериалыЕдИзм = ВыборкаДетальныеЗаписи.МатериалыУпаковка;
			Иначе
				МатериалыЕдИзм = ВыборкаДетальныеЗаписи.МатериалыНоменклатура.ЕдиницаИзмерения;
			КонецЕсли;
			
			ОбластьТаблицаСтрока.Параметры.ЕдИзм = МатериалыЕдИзм;
			Если КолВо <> 0 Тогда
				ОбластьТаблицаСтрока.Параметры.Расход = ВыборкаДетальныеЗаписи.МатериалыКоличество*1000/КолВо;
			КонецЕсли;
			Если КолВоКГ <> 0 Тогда
				ОбластьТаблицаСтрока.Параметры.РасходНорма = ВыборкаДетальныеЗаписи.МатериалыКоличество*1000/КолВоКГ;
			КонецЕсли;
			
			
			ТабДок.Вывести(ОбластьТаблицаСтрока);
			
		КонецЦикла;
	КонецЦикла;
	
	ОбластьТаблицаНоменклатура = Макет.ПолучитьОбласть("ОбластьТаблицаНоменклатура");
	ОбластьТаблицаНоменклатура.Параметры.Номенклатура = Документ.ОсновноеИзделиеНоменклатура;
	Если ДанныеНоменклатуры.ВесИспользовать Тогда
		ОбластьТаблицаНоменклатура.Параметры.ЕдИзм = ДанныеНоменклатуры.ВесЕдиницаИзмерения;
	Иначе
		ОбластьТаблицаНоменклатура.Параметры.ЕдИзм = "кг";
	КонецЕсли;
	ТабДок.Вывести(ОбластьТаблицаНоменклатура);
	
	ВыборкаНомерСтроки = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаНомерСтроки.Следующий() Цикл
		
		ОбластьТаблицаСтрока = Макет.ПолучитьОбласть("ОбластьТаблицаСтрока");
		ОбластьТаблицаСтрока.Параметры.Номер = ВыборкаНомерСтроки.НомерСтроки;
		ОбластьТаблицаСтрока.Параметры.Артикул = ВыборкаНомерСтроки.ВыходНоменклатура.Артикул;
		ОбластьТаблицаСтрока.Параметры.Номенклатура = ВыборкаНомерСтроки.ВыходНоменклатура;
		
		Если ЗначениеЗаполнено(ВыборкаНомерСтроки.ВыходУпаковка) Тогда
			ЕдИзм = ВыборкаНомерСтроки.ВыходУпаковка;
		Иначе
			ЕдИзм = ВыборкаНомерСтроки.ВыходНоменклатура.ЕдиницаИзмерения;
		КонецЕсли;
		
		ОбластьТаблицаСтрока.Параметры.ЕдИзм = ЕдИзм;
		Если КолВо <> 0 Тогда
			ОбластьТаблицаСтрока.Параметры.Расход = ВыборкаНомерСтроки.ВыходКоличество*1000/КолВо;
		КонецЕсли;
		Если КолВоКГ <> 0 Тогда
			ОбластьТаблицаСтрока.Параметры.РасходНорма = ВыборкаНомерСтроки.ВыходКоличество*1000/КолВоКГ;
		КонецЕсли;
		
		
		ТабДок.Вывести(ОбластьТаблицаСтрока);
		
	КонецЦикла;
	
	
	Возврат ТабДок;
	
КонецФункции //БИТ_Гурьев_ЧТЗ_3.2_17.04.24--

//Бит Трейгер П.М. 15.11.2024 ++
Функция СформироватьПФТехнологическийПроцессКорректировки(Документ)
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Справочник.РесурсныеСпецификации.КАНАТ_ПФ_MXL_ТехнологическийПроцесс1");
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭтапыПроизводства.Ссылка КАК Ссылка,
		|	ЭтапыПроизводства.Наименование КАК Наименование,
		|	ЭтапыПроизводства.КАНАТ_Оборудование КАК КАНАТ_Оборудование,
		|	ЭтапыПроизводства.Описание КАК Описание,
		|	ЭтапыПроизводства.КАНАТ_ЗаправочныеПараметры КАК КАНАТ_ЗаправочныеПараметры,
		|	ЭтапыПроизводстваКАНАТ_Показатели.Показатель КАК Показатель,
		|	ЭтапыПроизводстваКАНАТ_Показатели.Значение КАК Значение
		|ИЗ
		|	Справочник.ЭтапыПроизводства КАК ЭтапыПроизводства
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭтапыПроизводства.КАНАТ_Показатели КАК ЭтапыПроизводстваКАНАТ_Показатели
		|		ПО ЭтапыПроизводстваКАНАТ_Показатели.Ссылка = ЭтапыПроизводства.Ссылка
		|ГДЕ
		|	ЭтапыПроизводства.Владелец = &Владелец
		|	И ЭтапыПроизводства.ПометкаУдаления = Ложь
		|ИТОГИ
		|ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЭтапыПроизводства.Ссылка КАК ЭтапПроизводстваСсылка,
		|	ТехнологическиеОперации.Ссылка КАК ТехнологическаяОперацияСсылка,
		|	ТехнологическиеОперации.Наименование КАК ТехнологическаяОперацияНаименование,
		|	ТехнологическиеОперации.КАНАТ_Оборудование КАК КАНАТ_Оборудование,
		|	ТехнологическиеОперации.КАНАТ_ЗаправочныеПараметры КАК КАНАТ_ЗаправочныеПараметры,
		|	ТехнологическиеОперацииКАНАТ_Показатели.Показатель КАК Показатель,
		|	ТехнологическиеОперацииКАНАТ_Показатели.Значение КАК Значение,
		|	ТехнологическиеОперации.Описание КАК Описание,
		|	ТехнологическиеОперации.ПометкаУдаления КАК ПометкаУдаления
		|ИЗ
		|	Справочник.ЭтапыПроизводства КАК ЭтапыПроизводства
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТехнологическиеОперации КАК ТехнологическиеОперации
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТехнологическиеОперации.КАНАТ_Показатели КАК ТехнологическиеОперацииКАНАТ_Показатели
		|			ПО ТехнологическиеОперации.Ссылка = ТехнологическиеОперацииКАНАТ_Показатели.Ссылка
		|		ПО ЭтапыПроизводства.Ссылка = ТехнологическиеОперации.Владелец
		|ГДЕ
		|	ЭтапыПроизводства.Владелец = &Владелец
		|	И ЭтапыПроизводства.ПометкаУдаления = Ложь
		//|	И (ТехнологическиеОперации.ПометкаУдаления = Ложь ИЛИ ТехнологическиеОперации.Ссылка ЕСТЬ NULL)
		|УПОРЯДОЧИТЬ ПО
		|	ЭтапыПроизводства.НомерЭтапа,
		|	ТехнологическиеОперации.НомерОперации
		|ИТОГИ
		|ПО
		|	ЭтапПроизводстваСсылка,
		|	ТехнологическаяОперацияСсылка";
	
	Запрос.УстановитьПараметр("Владелец", Документ);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаЭтапы = РезультатЗапроса[0].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Этапы = Новый Соответствие;
	
	Пока ВыборкаЭтапы.Следующий() Цикл
		
		Этап = Новый Соответствие;
		Этап.Вставить("Наименование", ВыборкаЭтапы.Наименование);
		Этап.Вставить("Оборудование", ВыборкаЭтапы.КАНАТ_Оборудование);
		Этап.Вставить("ЗаправочныеПараметры", ВыборкаЭтапы.КАНАТ_ЗаправочныеПараметры);
		Этап.Вставить("Описание", ВыборкаЭтапы.Описание);
		
		ВыборкаДетальныеЗаписи = ВыборкаЭтапы.Выбрать();
		
		Показатели = Новый ТаблицаЗначений;
		Показатели.Колонки.Добавить("Показатель", Новый ОписаниеТипов("СправочникСсылка.КАНАТ_ПоказателиОборудования"));
		Показатели.Колонки.Добавить("Значение", Новый ОписаниеТипов("Строка"));
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			НоваяСтрока = Показатели.Добавить();
			НоваяСтрока.Показатель = ВыборкаДетальныеЗаписи.Показатель;
			НоваяСтрока.Значение = ВыборкаДетальныеЗаписи.Значение;
			
		КонецЦикла;
		
		Этап.Вставить("Показатели", Показатели);
		
		Этапы.Вставить(ВыборкаЭтапы.Ссылка, Этап);
		
	КонецЦикла;
	
	ДанныеДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Документ,"Наименование, ОсновноеИзделиеНоменклатура, КАНАТ_Примечание, НачалоДействия");
	
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	//ОбластьШапка.Параметры.НаименованиеСпецификации = ДанныеДокумента.Наименование;
	ОбластьШапка.Параметры.НаименованиеСпецификации =  ДанныеДокумента.ОсновноеИзделиеНоменклатура;
	ТабДок.Вывести(ОбластьШапка);
	
	//Заполнение таблички с этапами и операциями
	ВыборкаЭтапы = РезультатЗапроса[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ТабДокЭтапы = Новый ТабличныйДокумент;
	МассивРучныеОперации = Новый Массив;
	
	Пока ВыборкаЭтапы.Следующий() Цикл
		
		ОбластьЭтап = Макет.ПолучитьОбласть("ОбластьЭтап");
		ОбластьЭтап.Параметры.Этап = ВыборкаЭтапы.ЭтапПроизводстваСсылка;
		
		ВыборкаОперации = ВыборкаЭтапы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		МассивСтрокиОпераций = Новый Массив;
		
		Счетчик = 1;
		
		Пока ВыборкаОперации.Следующий() Цикл
			
			Если ЗначениеЗаполнено(ВыборкаОперации.ТехнологическаяОперацияСсылка) Тогда
				
				Если ВыборкаОперации.ПометкаУдаления Тогда
					
					Продолжить;
					
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(ВыборкаОперации.КАНАТ_Оборудование) Тогда
					
					МассивРучныеОперации.Добавить(ВыборкаОперации.ТехнологическаяОперацияНаименование);
					Продолжить;
					
				КонецЕсли;
				
				Если Счетчик = 1 Тогда
					
					ТабДокОперацииСтрока = Новый ТабличныйДокумент;
					
				КонецЕсли;
				
				ТабДокОперация = Новый ТабличныйДокумент;
				
				ОбластьОперацияШапка = Макет.ПолучитьОбласть("ОбластьОперацияШапка");
				ОбластьОперацияШапка.Параметры.Операция = ВыборкаОперации.ТехнологическаяОперацияСсылка;
				//ОбластьОперацияШапка.Параметры.Этап = ВыборкаОперации.ЭтапПроизводстваСсылка;
				
				ТабДокОперация.Вывести(ОбластьОперацияШапка);
				
				ПоказателиТекст = "";
				
				ВыборкаДетальныеЗаписи = ВыборкаОперации.Выбрать();
				
				//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				//	
				//	ПоказателиТекст = СтрШаблон("%1%2 %3%4",
				//								ПоказателиТекст,
				//								ВыборкаДетальныеЗаписи.Показатель,
				//								ВыборкаДетальныеЗаписи.Значение,
				//								Символы.ПС);
				//	
				//КонецЦикла;
				
				ОперацияТекст = СтрШаблон("%1%2%3%4%5",
										  ВыборкаОперации.Описание,
										  ?(ЗначениеЗаполнено(ВыборкаОперации.Описание), Символы.ПС, ""),
										  ВыборкаОперации.КАНАТ_Оборудование,
										  Символы.ПС,
										  ВыборкаОперации.КАНАТ_ЗаправочныеПараметры);
				
				ОбластьОперация = Макет.ПолучитьОбласть("ОбластьОперация");
				ОбластьОперация.Параметры.ОперацияТекст = ОперацияТекст;
				
				ТабДокОперация.Вывести(ОбластьОперация);
				ТабДокОперацииСтрока.Присоединить(ТабДокОперация);
				
				Счетчик = Счетчик + 1;
				
				Если Счетчик > 4 Тогда
					
					Счетчик = 1;
					МассивСтрокиОпераций.Добавить(ТабДокОперацииСтрока);
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ТабДокЭтапы.Вывести(ОбластьЭтап);
		
		Если ЗначениеЗаполнено(Этапы[ВыборкаЭтапы.ЭтапПроизводстваСсылка]["Описание"])
			ИЛИ ЗначениеЗаполнено(Этапы[ВыборкаЭтапы.ЭтапПроизводстваСсылка]["Оборудование"])
			ИЛИ ЗначениеЗаполнено(Этапы[ВыборкаЭтапы.ЭтапПроизводстваСсылка]["ЗаправочныеПараметры"]) Тогда
			
			ОбластьЭтапТекст = Макет.ПолучитьОбласть("ОбластьЭтапТекст");
			ОбластьЭтапТекст.Параметры.ЭтапТекст = СтрШаблон("%1%2%3%4%5",
									  Этапы[ВыборкаЭтапы.ЭтапПроизводстваСсылка]["Описание"],
									  ?(ЗначениеЗаполнено(Этапы[ВыборкаЭтапы.ЭтапПроизводстваСсылка]["Описание"]), Символы.ПС, ""),
									  Этапы[ВыборкаЭтапы.ЭтапПроизводстваСсылка]["Оборудование"],
									  Символы.ПС,
									  Этапы[ВыборкаЭтапы.ЭтапПроизводстваСсылка]["ЗаправочныеПараметры"]);
			ТабДокЭтапы.Вывести(ОбластьЭтапТекст);
			
		КонецЕсли;
		
		Для Каждого Строка Из МассивСтрокиОпераций Цикл
			
			ТабДокЭтапы.Вывести(Строка);
			
		КонецЦикла;
		
		Если Счетчик > 1 Тогда
			
			ТабДокЭтапы.Вывести(ТабДокОперацииСтрока);
			
		КонецЕсли;
	КонецЦикла;
	ТабДок.Вывести(ТабДокЭтапы);
	//Номенклатура
	
	//ТабДокНоменклатура = Новый ТабличныйДокумент;
	//
	//ОбластьНоменклатураШапка = Макет.ПолучитьОбласть("ОбластьНоменклатураШапка");
	//ТабДокНоменклатура.Вывести(ОбластьНоменклатураШапка);
	//ТабДокНоменклатура.Присоединить(ТабДокЭтапы);

	//ТабДокНоменклатура.Область(3, 1, ТабДокЭтапы.ВысотаТаблицы, 2).Объединить();
	//ОбластьНоменклатура = ТабДокНоменклатура.Область(3, 1, ТабДокЭтапы.ВысотаТаблицы, 2);
	//
	//
	//Если ЗначениеЗаполнено(ДанныеДокумента.ОсновноеИзделиеНоменклатура) Тогда
	//	ОбластьНоменклатура.Текст = СтрШаблон("%1%2%3",
	//										  ДанныеДокумента.ОсновноеИзделиеНоменклатура,
	//										  Символы.ПС,
	//										  ДанныеДокумента.ОсновноеИзделиеНоменклатура.Артикул);
	//КонецЕсли; 
	//
	//ОбластьНоменклатура.Шрифт = Новый Шрифт("Arial", 12, Ложь);
	//ОбластьНоменклатура.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
	//ОбластьНоменклатура.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	//ОбластьНоменклатура.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
	//ОбластьНоменклатура.ГраницаСлева = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
	//ОбластьНоменклатура.ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
	//
	//ТабДокНоменклатура.Область(1, ТабДокНоменклатура.ШиринаТаблицы, ТабДокНоменклатура.ВысотаТаблицы, ТабДокНоменклатура.ШиринаТаблицы).ГраницаСправа = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
	//ТабДокНоменклатура.Область(ТабДокНоменклатура.ВысотаТаблицы, 1, ТабДокНоменклатура.ВысотаТаблицы, ТабДокНоменклатура.ШиринаТаблицы).ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
	//
	//ТабДок.Вывести(ТабДокНоменклатура);
	
	//Ручные операции
	Для Каждого Строка Из МассивРучныеОперации Цикл
		
		ОбластьРучнаяОперация = Макет.ПолучитьОбласть("ОбластьРучнаяОперация");
		ОбластьРучнаяОперация.Параметры.ОперацияТекст = Строка;
		ТабДок.Вывести(ОбластьРучнаяОперация);
		
	КонецЦикла;
	
	//Подвал
	ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодвал");
	ОбластьПодвал.Параметры.Примечание = ДанныеДокумента.КАНАТ_Примечание;
	ОбластьПодвал.Параметры.Дата = ДанныеДокумента.НачалоДействия;
	ОбластьПодвал.Параметры.Подписант = РегистрыСведений.КАНАТ_ЛицаПодписывающиеЗаПодразделения.ПолучитьСотрудникаПоДолжности(Перечисления.КАНАТ_РолиПодписантов.ВедИнженерТехнолог, ДанныеДокумента.НачалоДействия);
	
	ТабДок.Вывести(ОбластьПодвал);
	
	Возврат ТабДок;
	
КонецФункции

//--Бит Трейгер П.М. 15.11.2024