
&После("ОбработкаЗаполнения")
Процедура КАНАТ_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	//БИТ_Гурьев_ЧТЗ_3.2_08.04.24++
	Если ЗначениеЗаполнено(ДанныеЗаполнения) И ЭтоГруппа Тогда
		//++Бит Трейгер П.М. 14.11.2024 ++ Доработки.Ошибка создания групп. Письмо от 01.11.24
		Если ДанныеЗаполнения.Свойство("Родитель") Тогда
		Если ЗначениеЗаполнено(ДанныеЗаполнения.Родитель) Тогда
		КАНАТ_ТехнологическаяСпецификация = ДанныеЗаполнения.Родитель.КАНАТ_ТехнологическаяСпецификация;
	    КонецЕсли;
	     КонецЕсли
	    //++Бит Трейгер П.М. 14.11.2024 ++ Доработки.Ошибка создания групп. Письмо от 01.11.24
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения)
		И Не ЭтоГруппа
		И ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
		И ДанныеЗаполнения.Свойство("КАНАТ_ТехнологическаяСпецификация") Тогда
		
		КАНАТ_ТехнологическаяСпецификация = ДанныеЗаполнения.КАНАТ_ТехнологическаяСпецификация;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения) 
		И ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.РесурсныеСпецификации") 
		И Не ЭтоГруппа Тогда
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РесурсныеСпецификации.Наименование КАК Наименование,
		|	РесурсныеСпецификации.НачалоДействия КАК НачалоДействия,
		|	РесурсныеСпецификации.КонецДействия КАК КонецДействия,
		|	РесурсныеСпецификации.МинимальнаяПартияВыпуска КАК МинимальнаяПартияВыпуска,
		|	РесурсныеСпецификации.МногоэтапныйПроизводственныйПроцесс КАК МногоэтапныйПроизводственныйПроцесс,
		|	РесурсныеСпецификации.ВыпускПроизвольнымиПорциями КАК ВыпускПроизвольнымиПорциями,
		|	РесурсныеСпецификации.ТипПроизводственногоПроцесса КАК ТипПроизводственногоПроцесса,
		|	РесурсныеСпецификации.СпособРаспределенияЗатратНаВыходныеИзделия КАК СпособРаспределенияЗатратНаВыходныеИзделия,
		|	РесурсныеСпецификации.Описание КАК Описание,
		|	РесурсныеСпецификации.ОптимальнаяПартияВыпуска КАК ОптимальнаяПартияВыпуска,
		|	РесурсныеСпецификации.ОграниченСрокПролеживанияВыходныхИзделий КАК ОграниченСрокПролеживанияВыходныхИзделий,
		|	РесурсныеСпецификации.МаксимальныйСрокПролеживанияВыходныхИзделий КАК МаксимальныйСрокПролеживанияВыходныхИзделий,
		|	РесурсныеСпецификации.ОптимальноеКоличествоПередачиМеждуЭтапами КАК ОптимальноеКоличествоПередачиМеждуЭтапами,
		|	РесурсныеСпецификации.ПечатьМаршрутнойКарты КАК ПечатьМаршрутнойКарты,
		|	РесурсныеСпецификации.ОсновноеИзделиеВидНоменклатуры КАК ОсновноеИзделиеВидНоменклатуры,
		|	РесурсныеСпецификации.ОсновноеИзделиеНоменклатура КАК ОсновноеИзделиеНоменклатура,
		|	РесурсныеСпецификации.ОсновноеИзделиеХарактеристика КАК ОсновноеИзделиеХарактеристика,
		|	РесурсныеСпецификации.ОсновноеИзделиеУпаковка КАК ОсновноеИзделиеУпаковка,
		|	РесурсныеСпецификации.ОсновноеИзделиеКоличествоУпаковок КАК ОсновноеИзделиеКоличествоУпаковок,
		|	РесурсныеСпецификации.ОсновноеИзделиеЭтап КАК ОсновноеИзделиеЭтап,
		|	РесурсныеСпецификации.ДопустимоеПревышениеОптимальнойПартииВыпуска КАК ДопустимоеПревышениеОптимальнойПартииВыпуска,
		|	РесурсныеСпецификации.ВариантНазначения КАК ВариантНазначения,
		|	РесурсныеСпецификации.ЕстьУточняемоеОсновноеИзделие КАК ЕстьУточняемоеОсновноеИзделие,
		|	РесурсныеСпецификации.ЕстьПараметризацияРесурсов КАК ЕстьПараметризацияРесурсов,
		|	РесурсныеСпецификации.ЕстьВложенныеСпецификации КАК ЕстьВложенныеСпецификации,
		|	РесурсныеСпецификации.ЕстьРасчетВероятности КАК ЕстьРасчетВероятности,
		|	РесурсныеСпецификации.ЕстьНекратныеНормативыВРЦ КАК ЕстьНекратныеНормативыВРЦ,
		|	РесурсныеСпецификации.ОписаниеУточненияПрименения КАК ОписаниеУточненияПрименения,
		|	РесурсныеСпецификации.ОтветственноеПодразделение КАК ОтветственноеПодразделение,
		|	РесурсныеСпецификации.РазрешитьВыборДляИзделийПобочногоВыхода КАК РазрешитьВыборДляИзделийПобочногоВыхода,
		|	РесурсныеСпецификации.ИдентификаторВерсииДанных КАК ИдентификаторВерсииДанных,
		|	РесурсныеСпецификации.КАНАТ_ТехнологическаяСпецификация КАК КАНАТ_ТехнологическаяСпецификация,
		|	РесурсныеСпецификации.КАНАТ_Примечание КАК КАНАТ_Примечание,
		|	РесурсныеСпецификации.КАНАТ_ДокладнаяЗаписка КАК КАНАТ_ДокладнаяЗаписка
		|ИЗ
		|	Справочник.РесурсныеСпецификации КАК РесурсныеСпецификации
		|ГДЕ
		|	РесурсныеСпецификации.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РесурсныеСпецификацииВыходныеИзделия.ВидНоменклатуры КАК ВидНоменклатуры,
		|	РесурсныеСпецификацииВыходныеИзделия.Номенклатура КАК Номенклатура,
		|	РесурсныеСпецификацииВыходныеИзделия.Характеристика КАК Характеристика,
		|	РесурсныеСпецификацииВыходныеИзделия.Упаковка КАК Упаковка,
		|	РесурсныеСпецификацииВыходныеИзделия.КоличествоУпаковок КАК КоличествоУпаковок,
		|	РесурсныеСпецификацииВыходныеИзделия.ДоляСтоимости КАК ДоляСтоимости,
		|	РесурсныеСпецификацииВыходныеИзделия.ТребуетсяУказыватьСерии КАК ТребуетсяУказыватьСерии,
		|	РесурсныеСпецификацииВыходныеИзделия.ПроцентБрака КАК ПроцентБрака,
		|	РесурсныеСпецификацииВыходныеИзделия.ОбработатьПоСпецификации КАК ОбработатьПоСпецификации,
		|	РесурсныеСпецификацииВыходныеИзделия.Спецификация КАК Спецификация,
		|	РесурсныеСпецификацииВыходныеИзделия.СпособАвтовыбораНоменклатуры КАК СпособАвтовыбораНоменклатуры,
		|	РесурсныеСпецификацииВыходныеИзделия.СпособАвтовыбораХарактеристики КАК СпособАвтовыбораХарактеристики,
		|	РесурсныеСпецификацииВыходныеИзделия.СвойствоСодержащееНоменклатуру КАК СвойствоСодержащееНоменклатуру,
		|	РесурсныеСпецификацииВыходныеИзделия.АлгоритмРасчетаКоличества КАК АлгоритмРасчетаКоличества,
		|	РесурсныеСпецификацииВыходныеИзделия.КлючСвязи КАК КлючСвязи,
		|	РесурсныеСпецификацииВыходныеИзделия.АлгоритмАвтовыбораХарактеристики КАК АлгоритмАвтовыбораХарактеристики,
		//|	РесурсныеСпецификацииВыходныеИзделия.АлгоритмРасчетаКоличестваИсторияПереходаНаНовыеФормулы КАК АлгоритмРасчетаКоличестваИсторияПереходаНаНовыеФормулы,
		|	РесурсныеСпецификацииВыходныеИзделия.ОписаниеИзделия КАК ОписаниеИзделия
		|ИЗ
		|	Справочник.РесурсныеСпецификации.ВыходныеИзделия КАК РесурсныеСпецификацииВыходныеИзделия
		|ГДЕ
		|	РесурсныеСпецификацииВыходныеИзделия.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РесурсныеСпецификацииВозвратныеОтходы.Номенклатура КАК Номенклатура,
		|	РесурсныеСпецификацииВозвратныеОтходы.Характеристика КАК Характеристика,
		|	РесурсныеСпецификацииВозвратныеОтходы.Упаковка КАК Упаковка,
		|	РесурсныеСпецификацииВозвратныеОтходы.КоличествоУпаковок КАК КоличествоУпаковок,
		|	РесурсныеСпецификацииВозвратныеОтходы.СтатьяКалькуляции КАК СтатьяКалькуляции,
		|	РесурсныеСпецификацииВозвратныеОтходы.ОписаниеИзделия КАК ОписаниеИзделия,
		|	РесурсныеСпецификацииВозвратныеОтходы.СпособАвтовыбораНоменклатуры КАК СпособАвтовыбораНоменклатуры,
		|	РесурсныеСпецификацииВозвратныеОтходы.СпособАвтовыбораХарактеристики КАК СпособАвтовыбораХарактеристики,
		|	РесурсныеСпецификацииВозвратныеОтходы.СвойствоСодержащееНоменклатуру КАК СвойствоСодержащееНоменклатуру,
		|	РесурсныеСпецификацииВозвратныеОтходы.АлгоритмРасчетаКоличества КАК АлгоритмРасчетаКоличества,
		|	РесурсныеСпецификацииВозвратныеОтходы.КлючСвязи КАК КлючСвязи,
		|	РесурсныеСпецификацииВозвратныеОтходы.АлгоритмАвтовыбораХарактеристики КАК АлгоритмАвтовыбораХарактеристики,
		|	РесурсныеСпецификацииВозвратныеОтходы.ОбработатьПоСпецификации КАК ОбработатьПоСпецификации,
		|	РесурсныеСпецификацииВозвратныеОтходы.Спецификация КАК Спецификация
		//|	РесурсныеСпецификацииВозвратныеОтходы.АлгоритмРасчетаКоличестваИсторияПереходаНаНовыеФормулы КАК АлгоритмРасчетаКоличестваИсторияПереходаНаНовыеФормулы
		|ИЗ
		|	Справочник.РесурсныеСпецификации.ВозвратныеОтходы КАК РесурсныеСпецификацииВозвратныеОтходы
		|ГДЕ
		|	РесурсныеСпецификацииВозвратныеОтходы.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РесурсныеСпецификацииМатериалыИУслуги.Номенклатура КАК Номенклатура,
		|	РесурсныеСпецификацииМатериалыИУслуги.Характеристика КАК Характеристика,
		|	РесурсныеСпецификацииМатериалыИУслуги.Упаковка КАК Упаковка,
		|	РесурсныеСпецификацииМатериалыИУслуги.КоличествоУпаковок КАК КоличествоУпаковок,
		|	РесурсныеСпецификацииМатериалыИУслуги.СтатьяКалькуляции КАК СтатьяКалькуляции,
		|	РесурсныеСпецификацииМатериалыИУслуги.СпособАвтовыбораНоменклатуры КАК СпособАвтовыбораНоменклатуры,
		|	РесурсныеСпецификацииМатериалыИУслуги.СпособАвтовыбораХарактеристики КАК СпособАвтовыбораХарактеристики,
		|	РесурсныеСпецификацииМатериалыИУслуги.СвойствоСодержащееНоменклатуру КАК СвойствоСодержащееНоменклатуру,
		|	РесурсныеСпецификацииМатериалыИУслуги.АлгоритмРасчетаКоличества КАК АлгоритмРасчетаКоличества,
		|	РесурсныеСпецификацииМатериалыИУслуги.ПрименениеМатериала КАК ПрименениеМатериала,
		|	РесурсныеСпецификацииМатериалыИУслуги.КлючСвязи КАК КлючСвязи,
		|	РесурсныеСпецификацииМатериалыИУслуги.ПроизводитсяВПроцессе КАК ПроизводитсяВПроцессе,
		|	РесурсныеСпецификацииМатериалыИУслуги.СпособПолученияМатериала КАК СпособПолученияМатериала,
		|	РесурсныеСпецификацииМатериалыИУслуги.ТребуетсяУказыватьСерии КАК ТребуетсяУказыватьСерии,
		|	РесурсныеСпецификацииМатериалыИУслуги.ПланироватьНеРанее КАК ПланироватьНеРанее,
		|	РесурсныеСпецификацииМатериалыИУслуги.АлгоритмАвтовыбораХарактеристики КАК АлгоритмАвтовыбораХарактеристики,
		|	РесурсныеСпецификацииМатериалыИУслуги.СпецификацияРемонта КАК СпецификацияРемонта,
		|	РесурсныеСпецификацииМатериалыИУслуги.Альтернативный КАК Альтернативный,
		|	РесурсныеСпецификацииМатериалыИУслуги.Вероятность КАК Вероятность,
		|	РесурсныеСпецификацииМатериалыИУслуги.ИсточникПолученияПолуфабриката КАК ИсточникПолученияПолуфабриката,
		//|	РесурсныеСпецификацииМатериалыИУслуги.АлгоритмРасчетаКоличестваИсторияПереходаНаНовыеФормулы КАК АлгоритмРасчетаКоличестваИсторияПереходаНаНовыеФормулы,
		|	РесурсныеСпецификацииМатериалыИУслуги.Обособленно КАК Обособленно
		|ИЗ
		|	Справочник.РесурсныеСпецификации.МатериалыИУслуги КАК РесурсныеСпецификацииМатериалыИУслуги
		|ГДЕ
		|	РесурсныеСпецификацииМатериалыИУслуги.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РесурсныеСпецификацииТрудозатраты.Ссылка КАК Ссылка,
		|	РесурсныеСпецификацииТрудозатраты.НомерСтроки КАК НомерСтроки,
		|	РесурсныеСпецификацииТрудозатраты.ВидРабот КАК ВидРабот,
		|	РесурсныеСпецификацииТрудозатраты.Количество КАК Количество,
		|	РесурсныеСпецификацииТрудозатраты.СтатьяКалькуляции КАК СтатьяКалькуляции,
		|	РесурсныеСпецификацииТрудозатраты.НазначениеРабот КАК НазначениеРабот,
		|	РесурсныеСпецификацииТрудозатраты.АлгоритмРасчетаКоличества КАК АлгоритмРасчетаКоличества,
		|	РесурсныеСпецификацииТрудозатраты.КлючСвязи КАК КлючСвязи
		//|	РесурсныеСпецификацииТрудозатраты.АлгоритмРасчетаКоличестваИсторияПереходаНаНовыеФормулы КАК АлгоритмРасчетаКоличестваИсторияПереходаНаНовыеФормулы
		|ИЗ
		|	Справочник.РесурсныеСпецификации.Трудозатраты КАК РесурсныеСпецификацииТрудозатраты
		|ГДЕ
		|	РесурсныеСпецификацииТрудозатраты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса[0].Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
	ВыборкаВыходныеИзделия = РезультатЗапроса[1].Выбрать();
	
	Пока ВыборкаВыходныеИзделия.Следующий() Цикл
		
		НоваяСтрока = ВыходныеИзделия.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаВыходныеИзделия);
		
	КонецЦикла;
	
	ВыборкаВозвратныеОтходы = РезультатЗапроса[2].Выбрать();
	
	Пока ВыборкаВозвратныеОтходы.Следующий() Цикл
		
		НоваяСтрока = ВозвратныеОтходы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаВозвратныеОтходы);
		
	КонецЦикла;
	
	ВыборкаМатериалыИУслуги = РезультатЗапроса[3].Выбрать();
	
	Пока ВыборкаМатериалыИУслуги.Следующий() Цикл
		
		НоваяСтрока = МатериалыИУслуги.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаМатериалыИУслуги);
		
	КонецЦикла;
	
	ВыборкаТрудозатраты = РезультатЗапроса[4].Выбрать();
	
	Пока ВыборкаТрудозатраты.Следующий() Цикл
		
		НоваяСтрока = Трудозатраты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаТрудозатраты);
		
	КонецЦикла;
	
	КАНАТ_ТехнологическаяСпецификация = Ложь;
	ИсключитьАвтоматическийВыборВДокументах = Ложь;
	ВариантПодбораВДокументы = ?(ИсключитьАвтоматическийВыборВДокументах,
			ПредопределенноеЗначение("Перечисление.ВариантыПодбораСпецификацииВДокументы.Вручную"),
			ПредопределенноеЗначение("Перечисление.ВариантыПодбораСпецификацииВДокументы.Автоматически"));
	Родитель = Справочники.РесурсныеСпецификации.ПустаяСсылка();
	КАНАТ_Основание = ДанныеЗаполнения;
	Ответственный = Пользователи.ТекущийПользователь();
		
	КонецЕсли;
	//БИТ_Гурьев_ЧТЗ_3.2_08.04.24--
КонецПроцедуры

&После("ПередЗаписью")
Процедура КАНАТ_ПередЗаписью(Отказ)
	//БИТ_Гурьев_ЧТЗ_3.2_11.04.24++
	Если КАНАТ_ТехнологическаяСпецификация Тогда
	
		Если Не ЭтоГруппа И (Не ЗначениеЗаполнено(Родитель) 
			ИЛИ (ЗначениеЗаполнено(Родитель) И Не Родитель.КАНАТ_ТехнологическаяСпецификация)) Тогда
			
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Технологическая спецификация должна находится в технологической группе.";
			Сообщение.Сообщить();
			
		КонецЕсли;
		
	
	КонецЕсли;
	
	Если Не КАНАТ_ТехнологическаяСпецификация Тогда
	
		Если ЗначениеЗаполнено(Родитель) И Родитель.КАНАТ_ТехнологическаяСпецификация Тогда
			
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "В технологической группе могут находиться только технологические спецификации.";
			Сообщение.Сообщить();
			
		КонецЕсли;
		//++Бит Трейгер П.М. 13.11.2024
		Если ЭтоНовый() Тогда
		Иначе
		//--Бит Трейгер П.М. 13.11.2024
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	РесурсныеСпецификации.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.РесурсныеСпецификации КАК РесурсныеСпецификации
			|ГДЕ
			|	РесурсныеСпецификации.Родитель = &Родитель
			|	И РесурсныеСпецификации.КАНАТ_ТехнологическаяСпецификация = ИСТИНА";

		Запрос.УстановитьПараметр("Родитель", Ссылка);

		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() И ЭтоГруппа И ЗначениеЗаполнено(Родитель) Тогда
			
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Текущая группа содержит технологические группы или спецификации";
			Сообщение.Сообщить();
			
		КонецЕсли;
       КонецЕсли;
	КонецЕсли;
	//БИТ_Гурьев_ЧТЗ_3.2_11.04.24--
КонецПроцедуры


&Перед("ПриЗаписи")
Процедура КАНАТ_ПриЗаписи(Отказ)
	Если КАНАТ_ТехнологическаяСпецификация <> Ссылка.КАНАТ_ТехнологическаяСпецификация
		И Не Пользователи.РолиДоступны("ДобавлениеИзменениеРесурсныхСпецификаций") Тогда
		
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Нет прав на изменение признака технологической спецификации.";
		Сообщение.Сообщить();
		
	КонецЕсли;
КонецПроцедуры
