
&НаСервере
Процедура КАНАТ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//БИТ_Гурьев_ЧТЗ_3.2_08.04.24++
	НовыйЭлемент = Элементы.Добавить("КАНАТ_ТехнологическаяСпецификация", Тип("ПолеФормы"),ЭтаФорма);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "Объект.КАНАТ_ТехнологическаяСпецификация";
	
	Если Не Пользователи.РолиДоступны("ДобавлениеИзменениеРесурсныхСпецификаций") Тогда
		
		НовыйЭлемент.Доступность = Ложь;
		
	КонецЕсли;
	//БИТ_Гурьев_ЧТЗ_3.2_08.04.24--
КонецПроцедуры
