Функция ДобавитьКомандуСоздатьРаспоряжениеНаОтгрузку(КомандыСозданияНаОсновании) Экспорт
	//++ Гурьев 14.11.23 Для ввода на основании
	Если ПравоДоступа("Добавление", Метаданные.Документы.КАНАТ_РаспоряжениеНаОтгрузку) Тогда
		
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.КАНАТ_РаспоряжениеНаОтгрузку.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = ОбщегоНазначенияУТ.ПредставлениеОбъекта(Метаданные.Документы.КАНАТ_РаспоряжениеНаОтгрузку);
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		КомандаСоздатьНаОсновании.ФункциональныеОпции = "ИспользоватьПроизводство";
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;
	
	Возврат Неопределено;
	//-- Гурьев 14.11.23

КонецФункции

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Обработка.КАНАТ_ПечатьПропускНаВъездВыезд";
	КомандаПечати.Идентификатор = "ПропускНаВъезд";
	КомандаПечати.Представление = "Распоряжение на отгрузку";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	
КонецПроцедуры