
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗаказКлиента.Грузополучатель КАК Грузополучатель,
			|	ЗаказКлиента.Партнер КАК Партнер,
			|	ЗаказКлиента.АдресДоставки КАК Адрес,
			|	ЗаказКлиента.СпособДоставки КАК СпособДоставки,
			|	ЗаказКлиента.ПеревозчикПартнер КАК Перевозчик,
			|	ЗаказКлиента.КАНАТ_НомерИДатаДоверенности КАК НомерИДатаДоверенности,
			|	ЗаказКлиента.КАНАТ_ФИОСопроводителя КАК ФИОСопроводителя,
			|	ЗаказКлиента.КАНАТ_Водитель КАК Водитель,
			|	ЗаказКлиента.КАНАТ_ВодительСсылка КАК КАНАТ_ВодительСсылка,
			|	ЗаказКлиента.КАНАТ_ГосНомер КАК ГосНомер,
			|	ЗаказКлиента.КАНАТ_АвтомобильМарка КАК АвтомобильМарка,
			|	ЗаказКлиента.КАНАТ_Транспорт КАК КАНАТ_Транспорт,
			|	ЗаказКлиента.Номер КАК Номер
			|ИЗ
			|	Документ.ЗаказКлиента КАК ЗаказКлиента
			|ГДЕ
			|	ЗаказКлиента.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
			|	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
			|	Сумма(ЗаказКлиентаТовары.Количество) КАК Количество,
			|	ЗаказКлиентаТовары.Цена КАК Цена,
			|	СУММА(ЗаказКлиентаТовары.Сумма) КАК СуммаБезНДС,
			|	ЗаказКлиентаТовары.СтавкаНДС КАК СтавкаНДС,
			|	СУММА(ЗаказКлиентаТовары.СуммаНДС) КАК СуммаНДС,
			|	СУММА(ЗаказКлиентаТовары.СуммаСНДС) КАК СуммаСНДС,
			|	ЗаказКлиентаТовары.КАНАТ_КомментарийКЗаказу КАК КАНАТ_КомментарийКЗаказу,
			|	ЗаказКлиентаТовары.КАНАТ_Сертификат КАК КАНАТ_Сертификат,
			|	ЗаказКлиентаТовары.Номенклатура.ЕдиницаИзмерения КАК Упаковка,
			|	СУММА(ЗаказыКлиентовОстатки.КОтгрузкеОстаток) КАК КОтгрузкеОстаток
			|ИЗ
			|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКОтгрузке.Остатки КАК ЗаказыКлиентовОстатки
			|		ПО ЗаказКлиентаТовары.Ссылка = ЗаказыКлиентовОстатки.ДокументОтгрузки
			|			И ЗаказКлиентаТовары.Номенклатура = ЗаказыКлиентовОстатки.Номенклатура  
			|			И ЗаказКлиентаТовары.Характеристика = ЗаказыКлиентовОстатки.Характеристика
			|			И ЗаказКлиентаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
			|ГДЕ
			|	ЗаказКлиентаТовары.Ссылка = &Ссылка
			|	И ЗаказыКлиентовОстатки.КОформлениюОстаток > 0
			|
			|СГРУППИРОВАТЬ ПО
			|	ЗаказКлиентаТовары.Номенклатура,
			|	ЗаказКлиентаТовары.Характеристика, 
			|	ЗаказКлиентаТовары.КАНАТ_КомментарийКЗаказу, 
			|	ЗаказКлиентаТовары.Цена,
			|	ЗаказКлиентаТовары.СтавкаНДС,
			|	ЗаказКлиентаТовары.КАНАТ_Сертификат,
			|	ЗаказКлиентаТовары.Номенклатура.ЕдиницаИзмерения
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	КАНАТ_РаспоряжениеНаОтгрузку.ПорядковыйНомер КАК ПорядковыйНомер
			|ИЗ
			|	Документ.КАНАТ_РаспоряжениеНаОтгрузку КАК КАНАТ_РаспоряжениеНаОтгрузку
			|ГДЕ
			|	КАНАТ_РаспоряжениеНаОтгрузку.ДокументОснование = &Ссылка
			|
			|УПОРЯДОЧИТЬ ПО
			|	ПорядковыйНомер УБЫВ";
		
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		ВыборкаРеквизиты = РезультатЗапроса[0].Выбрать();
		
		Если ВыборкаРеквизиты.Следующий() Тогда
			
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ВыборкаРеквизиты);
			
			Если Не ЗначениеЗаполнено(Перевозчик) Тогда
				
				Перевозчик = ВыборкаРеквизиты.Партнер;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ВыборкаТовары = РезультатЗапроса[1].Выбрать();
		
		Пока ВыборкаТовары.Следующий() Цикл
			
			СтрокаТовары = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТовары, ВыборкаТовары);
			
		КонецЦикла;
		
		ВыборкаНомер = РезультатЗапроса[2].Выбрать();
		
		Если ВыборкаНомер.Следующий() Тогда
			
			ПорядковыйНомер = ВыборкаНомер.ПорядковыйНомер + 1;
			
		Иначе
			
			ПорядковыйНомер = 1;
			
		КонецЕсли;
		
		Номер = СтрШаблон("%1-%2", Номер, ПорядковыйНомер);
		ДокументОснование = ДанныеЗаполнения;
		
	КонецЕсли;
КонецПроцедуры
