// <+БИТ> Руденков_Е.И. 22.07.2024  
// ЧТЗ ШК-1 Канат Процесс штрихкодирования
&НаСервере
Процедура КАНАТ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//ГруппаКанат
	ГруппаКанат = ЭтаФорма.Элементы.Добавить("ГруппаКанат", Тип("ГруппаФормы"),ЭтаФорма);
	ГруппаКанат.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаКанат.Заголовок = "Параметры товара";
	ГруппаКанат.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
	ГруппаКанат.ОтображатьЗаголовок = ИСТИНА; 
	ГруппаКанат.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаКанат.РастягиватьПоГоризонтали = ИСТИНА;
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("КАНАТ_Номенклатура", Тип("ПолеФормы"),ГруппаКанат);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.КАНАТ_Номенклатура";
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("КАНАТ_Характеристика", Тип("ПолеФормы"),ГруппаКанат);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.КАНАТ_Характеристика";
	
	//ГруппаВес
	ГруппаВес = ЭтаФорма.Элементы.Добавить("ГруппаВес", Тип("ГруппаФормы"),ГруппаКанат);
	ГруппаВес.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаВес.Заголовок = "Вес";
	ГруппаВес.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаВес.ОтображатьЗаголовок = Ложь; 
	ГруппаВес.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаВес.РастягиватьПоГоризонтали = ИСТИНА;
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("КАНАТ_Вес", Тип("ПолеФормы"),ГруппаВес);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.КАНАТ_Вес";
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("КАНАТ_ВесЕдиницаИзмерения", Тип("ПолеФормы"),ГруппаВес);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	НовыйЭлемент.ПутьКДанным = "Объект.КАНАТ_ВесЕдиницаИзмерения";
	
КонецПроцедуры // <-БИТ> Руденков_Е.И. 22.07.2024
