Функция ДобавитьКомандуСоздатьПропускНаВыезд(КомандыСозданияНаОсновании) Экспорт
	//++ Гурьев 17.11.23 ЧТЗ_2.10 Для ввода на основании
	Если ПравоДоступа("Добавление", Метаданные.Документы.КАНАТ_ПропускНаВыезд) Тогда
		
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.КАНАТ_ПропускНаВыезд.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = ОбщегоНазначенияУТ.ПредставлениеОбъекта(Метаданные.Документы.КАНАТ_ПропускНаВыезд);
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		КомандаСоздатьНаОсновании.ФункциональныеОпции = "ИспользоватьПроизводство";
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;
	
	Возврат Неопределено;
	//-- Гурьев 17.11.23

КонецФункции

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Обработка.КАНАТ_ПечатьПропускНаВъездВыезд";
	КомандаПечати.Идентификатор = "ПропускНаВыезд";
	КомандаПечати.Представление = "Пропуск на выезд";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	
КонецПроцедуры