
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|	ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Склад КАК Подразделение,
		|	РеализацияТоваровУслуг.Грузополучатель КАК Грузополучатель,
		|	РеализацияТоваровУслуг.Партнер КАК Партнер,
		|	ДокументЗаказКлиента.КАНАТ_Водитель КАК Водитель,
		|	ДокументЗаказКлиента.КАНАТ_ФИОСопроводителя КАК ФИОСопроводителя,
		|	ДокументЗаказКлиента.КАНАТ_ГосНомер КАК ГосНомер,
		|	ДокументЗаказКлиента.КАНАТ_АвтомобильМарка КАК Марка,
		|	СправочникНоменклатура.ГруппаФинансовогоУчета КАК ТМЦ,
		|	//КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РеализацияТоваровУслугТовары.НомерСтроки) КАК КоличествоМест,
		|	ДокументЗаказКлиента.СпособДоставки КАК СпособДоставки,
		|	ДокументЗаказКлиента.КАНАТ_ВодительСсылка КАК ВодительСсылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ДокументЗаказКлиента
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
		|				ПО ЗаказКлиентаТовары.Номенклатура = СправочникНоменклатура.Ссылка
		|			ПО ДокументЗаказКлиента.Ссылка = ЗаказКлиентаТовары.Ссылка
		|		ПО РеализацияТоваровУслуг.ЗаказКлиента = ДокументЗаказКлиента.Ссылка
		|		ПРАВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|		ПО РеализацияТоваровУслугТовары.Ссылка = РеализацияТоваровУслуг.Ссылка
		|ГДЕ
		|	РеализацияТоваровУслуг.Ссылка = &Ссылка
		|	И ЗаказКлиентаТовары.НомерСтроки = 1
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТоваровУслуг.Склад,
		|	РеализацияТоваровУслуг.Грузополучатель,
		|	РеализацияТоваровУслуг.Партнер,
		|	ДокументЗаказКлиента.КАНАТ_Водитель,
		|	ДокументЗаказКлиента.КАНАТ_ФИОСопроводителя,
		|	ДокументЗаказКлиента.КАНАТ_ГосНомер,
		|	ДокументЗаказКлиента.КАНАТ_АвтомобильМарка,
		|	СправочникНоменклатура.ГруппаФинансовогоУчета,
		|	ДокументЗаказКлиента.СпособДоставки,
		|	ДокументЗаказКлиента.КАНАТ_ВодительСсылка";
		
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
		
		ДанныеДокумента = Запрос.Выполнить().Выгрузить();
		
		Если ДанныеДокумента.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеДокумента[0]);
			
			Если Не ЗначениеЗаполнено(Грузополучатель) Тогда
				Грузополучатель = ДанныеДокумента[0].Партнер;
			КонецЕсли;
			
			Если ДанныеДокумента[0].СпособДоставки = Перечисления.СпособыДоставки.ДоКлиента Или
				ДанныеДокумента[0].СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу Тогда
				
				Водитель = ДанныеДокумента[0].ВодительСсылка;
			КонецЕсли;
		КонецЕсли;
		
		Организация = "КАНАТ";
		ПодписантДолжность = Перечисления.КАНАТ_РолиПодписантов.СтОператорЭВМ;
		ПодписантСотрудник = РегистрыСведений.КАНАТ_ЛицаПодписывающиеЗаПодразделения.ПолучитьСотрудникаПоДолжности(ПодписантДолжность);
		
		ДокументОснование = ДанныеЗаполнения;
		
		КоличествоМест = КАНАТ_ВычислитьКоличествоМест(ДанныеЗаполнения);
	КонецЕсли;
КонецПроцедуры


//БИТ_Гурьев__27.04.24++
Функция КАНАТ_ВычислитьКоличествоМест(Реализация)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗаказКлиента = Реализация.ЗаказКлиента;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ Различные
		|	ТоварыКОтгрузке.Регистратор КАК Регистратор,
		//|	ТоварыКОтгрузке.КОтгрузке + ТоварыКОтгрузке.Собрано КАК Сумма,
		//|	ТоварыКОтгрузке.Номенклатура КАК Номенклатура
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	Товары.Серия КАК Серия,
		|	СУММА(Товары.КоличествоУпаковок) КАК Сумма,
		|	МИНИМУМ(Товары.НомерСтроки) КАК НомерСтроки
		|ИЗ
		|	РегистрНакопления.ТоварыКОтгрузке КАК ТоварыКОтгрузке
		|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйОрдерНаТовары.ОтгружаемыеТовары КАК Товары
		|	ПО (ТоварыКОтгрузке.Регистратор = Товары.Ссылка
		|		И ТоварыКОтгрузке.Номенклатура = Товары.Номенклатура 
		|		И ТоварыКОтгрузке.Характеристика = Товары.Характеристика) 
		|ГДЕ
		|	ТоварыКОтгрузке.ДокументОтгрузки = &ДокументОтгрузки
		|	И ТИПЗНАЧЕНИЯ(ТоварыКОтгрузке.Регистратор) = ТИП(Документ.РасходныйОрдерНаТовары)
		|	И Товары.Действие = ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиОрдеровНаОтгрузку.Отгрузить)
		|СГРУППИРОВАТЬ ПО
		|	ТоварыКОтгрузке.Регистратор,
		|	Товары.Номенклатура,
		|	Товары.Характеристика,
		|	Товары.Серия
		|УПОРЯДОЧИТЬ ПО
		|	ТоварыКОтгрузке.Регистратор.Дата,
		|	МИНИМУМ(Товары.НомерСтроки);
		|
		|///////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыКОтгрузке.Регистратор КАК Регистратор,
		|	СУММА(ТоварыКОтгрузке.КОформлению) КАК Сумма,
		|	ТоварыКОтгрузке.Номенклатура КАК Номенклатура,
		|	ТоварыКОтгрузке.Характеристика КАК Характеристика
		|ИЗ
		|	РегистрНакопления.ТоварыКОтгрузке КАК ТоварыКОтгрузке
		|ГДЕ
		|	ТоварыКОтгрузке.ДокументОтгрузки = &ДокументОтгрузки
		|	И ТИПЗНАЧЕНИЯ(ТоварыКОтгрузке.Регистратор) = ТИП(Документ.РеализацияТоваровУслуг)
		|СГРУППИРОВАТЬ ПО
		|	ТоварыКОтгрузке.Регистратор,
		|	ТоварыКОтгрузке.Номенклатура,
		|	ТоварыКОтгрузке.Характеристика
		|УПОРЯДОЧИТЬ ПО
		|	ТоварыКОтгрузке.Регистратор.Дата";
	
	Запрос.УстановитьПараметр("ДокументОтгрузки", ЗаказКлиента);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыгрузкаРасходныйОрдер = РезультатЗапроса[0].Выгрузить();
	ВыгрузкаРеализация = РезультатЗапроса[1].Выгрузить();
	
	СоответствиеРеализацияМеста = Новый Соответствие;
	
	Для Каждого РеализацияСтрока Из ВыгрузкаРеализация Цикл
		
		Для Каждого РОСтрока Из ВыгрузкаРасходныйОрдер Цикл
			
			Если РеализацияСтрока.Сумма = 0 Тогда
				Прервать;
			КонецЕсли;
			
			Если РОСтрока.Номенклатура <> РеализацияСтрока.Номенклатура 
				ИЛИ РОСтрока.Характеристика <> РеализацияСтрока.Характеристика 
				ИЛИ РОСтрока.Сумма = 0 Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(СоответствиеРеализацияМеста[РеализацияСтрока.Регистратор]) Тогда
				СоответствиеРеализацияМеста[РеализацияСтрока.Регистратор] = 1;
			Иначе
				СоответствиеРеализацияМеста[РеализацияСтрока.Регистратор] = СоответствиеРеализацияМеста[РеализацияСтрока.Регистратор] + 1;
			КонецЕсли;
			
			Если РеализацияСтрока.Сумма > РОСтрока.Сумма Тогда
				
				РеализацияСтрока.Сумма = РеализацияСтрока.Сумма - РОСтрока.Сумма;
				РОСтрока.Сумма = 0;
				
			Иначе
				
				РОСтрока.Сумма = 0;
				РеализацияСтрока.Сумма = 0;
				
			КонецЕсли;
				
		КонецЦикла;
		
	КонецЦикла;
	
	Результат = СоответствиеРеализацияМеста[Реализация];
	
	//Для Каждого СтрокаРО Из СоответствиеРеализацияРО[Реализация] Цикл
	//	
	//	Результат = Результат + СтрокаРО.РасходныйОрдер.КАНАТ_ВсегоСерий;
	//	
	//КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции //БИТ_Гурьев__27.04.24--
