//++ Гурьев 24.10.23
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьВидимостьКварталов();
	
	Год = ТекущаяДата();
КонецПроцедуры

&НаКлиенте
Процедура ЗаКварталПриИзменении(Элемент)
	ОбновитьВидимостьКварталов();
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьКварталов()
	Элементы.Квартал.Видимость = ЗаКвартал;
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	ТабДок = ПечатьНаСервере();
	//++Бит Трейгер П.М. 25.10.2024 Блок Качества. Переделка.
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.ПолеСлева = 10;
	ТабДок.ПолеСправа = 5;
	//--Бит Трейгер П.М. 25.10.2024 Блок Качества. Переделка.
	Идентификатор = "ОтчетГодовойКвартальный";
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(Идентификатор);
	
	КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабДок;
	КоллекцияПечатныхФорм[0].Экземпляров = 1;
	КоллекцияПечатныхФорм[0].СинонимМакета = "Отчет годовой/квартальный";
	
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,Неопределено,ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция ПечатьНаСервере()
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.КАНАТКач_ГодовойКвартальныйОтчет.ПФ_MXL_ГодовойКвартальныйОтчет");
	
	Период = Новый СтандартныйПериод;
	
	Если Не ЗаКвартал Тогда
		Период.ДатаНачала = НачалоГода(Год);
		Период.ДатаОкончания = КонецГода(Год);
	Иначе
		Период.ДатаНачала = НачалоМесяца(ДобавитьМесяц(НачалоГода(Год), 3*Квартал));
		Период.ДатаОкончания = КонецМесяца(ДобавитьМесяц(НачалоГода(Год), 3*(Квартал) + 2));
	КонецЕсли;
	
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	Если ЗаКвартал Тогда 
		ОбластьШапка.Параметры.Дата = СтрШаблон("%1 квартал %2г.", Квартал + 1, Формат(Год, "ДФ=yyyy"));
	Иначе
		ОбластьШапка.Параметры.Дата = СтрШаблон("%1г.", Формат(Год, "ДФ=yyyy"));
	КонецЕсли;
	ТабДок.Вывести(ОбластьШапка);
	
	ВыборкаДанныеПФ = ПолучитьДанныеПФ(Период);
	ВывестиТаблицуВОтчет(ТабДок, Макет, ВыборкаДанныеПФ, 1);
	
	ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодвал");
	ТабДок.Вывести(ОбластьПодвал);
	
	Возврат ТабДок;
КонецФункции

&НаСервере
Функция ПолучитьДанныеПФ(Период)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КАНАТ_ВидыПродукцииКонтрольКачества.Ссылка КАК Вид,
	               |	КАНАТ_РезультатИспытаний.Ссылка КАК РезультатИспытаний,
	               |	КАНАТ_ВидыПродукцииКонтрольКачества.ЭтоГруппа КАК ЭтоГруппа
	               |ИЗ
	               |	Документ.КАНАТ_РезультатИспытаний КАК КАНАТ_РезультатИспытаний
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КАНАТ_ВидыПродукцииКонтрольКачества КАК КАНАТ_ВидыПродукцииКонтрольКачества
	               |		ПО КАНАТ_РезультатИспытаний.ВидГотовойПродукцииИспытания = КАНАТ_ВидыПродукцииКонтрольКачества.Ссылка
	               |ГДЕ
	               |	КАНАТ_РезультатИспытаний.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
				   |	И КАНАТ_РезультатИспытаний.Проведен = Истина
	               |ИТОГИ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РезультатИспытаний)
	               |ПО
	               |	Вид ИЕРАРХИЯ";
	
	Запрос.УстановитьПараметр("ДатаНачала", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Период.ДатаОкончания);
	
	Возврат Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
КонецФункции

&НаСервере
Процедура ВывестиТаблицуВОтчет(ТабДок, Макет, Выборка, Номер)
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ЭтоГруппа Тогда
			
			ОбластьТаблицаГруппа = Макет.ПолучитьОбласть("ОбластьТаблицаГруппа");
			ОбластьТаблицаГруппа.Параметры.Группа = Выборка.Вид;
			
			ТабДок.Вывести(ОбластьТаблицаГруппа);
			
			ВывестиТаблицуВОтчет(ТабДок, Макет, Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам), Номер);
			
		Иначе
			
			ОбластьТаблицаСтрока = Макет.ПолучитьОбласть("ОбластьТаблицаСтрока");
			ОбластьТаблицаСтрока.Параметры.Номер        = Номер;
			ОбластьТаблицаСтрока.Параметры.Номенклатура = Выборка.Вид;
			ОбластьТаблицаСтрока.Параметры.Количество   = Выборка.РезультатИспытаний;
			
			Номер = Номер + 1;
			
			ТабДок.Вывести(ОбластьТаблицаСтрока);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры