
&ИзменениеИКонтроль("ПолучитьСледующуюГруппировку")
Функция КАНАТ_ПолучитьСледующуюГруппировку(Знач Уровень, ВыборкаСтрок)

	Уровень = Уровень + 1;
	СледующаяГруппировка = Новый Структура("Уровень, Группировка", 0, Неопределено);

	Если Уровень = 2 Тогда
		Если ВыборкаСтрок.ХарактеристикиИспользуются Тогда
			СледующаяГруппировка.Уровень     = Уровень;
			СледующаяГруппировка.Группировка = "ХарактеристикаЦО";
		Иначе	
			СледующаяГруппировка = ПолучитьСледующуюГруппировку(Уровень, ВыборкаСтрок);
		КонецЕсли;
	ИначеЕсли Уровень = 3 Тогда  
		#Вставка  
		Попытка
		#КонецВставки
		Если ВыборкаСтрок.СерииИспользуются Тогда
			СледующаяГруппировка.Уровень     = Уровень;
			СледующаяГруппировка.Группировка = "СерияЦО";
		Иначе	
			СледующаяГруппировка = ПолучитьСледующуюГруппировку(Уровень, ВыборкаСтрок);
		КонецЕсли; 
		#Вставка
	Исключение
		Сообщить(ВыборкаСтрок.Артикул);
			СледующаяГруппировка = ПолучитьСледующуюГруппировку(Уровень, ВыборкаСтрок);   
		КонецПопытки;
		#КонецВставки
	ИначеЕсли Уровень = 4 Тогда
		#Вставка  
		Попытка
		#КонецВставки
		Если ВыборкаСтрок.УпаковкиИспользуются Тогда
			СледующаяГруппировка.Уровень     = Уровень;
			СледующаяГруппировка.Группировка = "УпаковкаЦО";
		КонецЕсли; 
		#Вставка
	Исключение 
		ЗаписьЖурналаРегистрации("ЦЕны",УровеньЖурналаРегистрации.Ошибка,,,ВыборкаСтрок.Номенклатура.Код);
		КонецПопытки;
		#КонецВставки
	КонецЕсли;	

	Возврат СледующаяГруппировка;

КонецФункции
