
Функция СведенияОВнешнейОбработке() Экспорт
  
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиОтчет();
	ПараметрыРегистрации.Версия = "2.0";
	ПараметрыРегистрации.Наименование = "Фактический расход материалов с группировкой по изделиям";
	ПараметрыРегистрации.Информация = "Фактический расход материалов с группировкой по изделиям";
	
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	ДобавитьКоманду(ТаблицаКоманд, 
		"Фактический расход материалов с группировкой по изделиям", 
		"ФактическийРасходМатериаловСГруппировкойПоИзделиям", 
		"ОткрытиеФормы", //Использование. Варианты: "ОткрытиеФормы", "ВызовКлиентскогоМетода", "ВызовСерверногоМетода" 
		Ложь,//Показывать оповещение. Варианты Истина, Ложь 
		"");
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд); 
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

//Процедура ПриОпределенииНастроекОтчета(НастройкиОтчета,НастройкиВариантов)Экспорт

//	НастройкиВариантов["Вариант1"].Теги = НСтр("ru = 'Производство'");
//	
//	НастройкиВариантов["Вариант2"].Теги = НСтр("ru = 'Производство'");
//	
//КонецПроцедуры

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "") 
	
	НоваяКоманда = ТаблицаКоманд.Добавить(); 
	НоваяКоманда.Представление = Представление; 
	НоваяКоманда.Идентификатор = Идентификатор; 
	НоваяКоманда.Использование = Использование; 
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение; 
	НоваяКоманда.Модификатор = Модификатор; 

КонецПроцедуры

Функция ПолучитьТаблицуКоманд() 

	Команды = Новый ТаблицаЗначений; 
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка")); 
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка")); 
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка")); 
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево")); 
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка")); 
	
	Возврат Команды; 

КонецФункции 


