
&ИзменениеИКонтроль("УстановитьДоступностьДоговора")
Процедура КАНАТ_УстановитьДоступностьДоговора(Объект, ДоступностьЭлемента, ВидимостьЭлемента, Договор)

	ИспользоватьПартнеровКакКонтрагентов = ПолучитьФункциональнуюОпцию("ИспользоватьПартнеровКакКонтрагентов");
	ИспользуютсяДоговорыКонтрагентов     = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами");

	ЗаполненыВлияющиеПоля = ЗначениеЗаполнено(Объект.Партнер)
	И (ЗначениеЗаполнено(Объект.Контрагент)
	Или ИспользоватьПартнеровКакКонтрагентов)
	И ЗначениеЗаполнено(Объект.Организация);

	Если ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами") Тогда

		ИспользуютсяДоговораПоОперации = Объект.Свойство("ХозяйственнаяОперация")
		И ОперацииИспользующиеДоговораКонтрагентов().Найти(Объект.ХозяйственнаяОперация) <> Неопределено;

		ЗаполненыВлияющиеПоля = ЗаполненыВлияющиеПоля
		И (ЗначениеЗаполнено(Объект.Соглашение)
		Или ИспользуютсяДоговораПоОперации);
		
		УстановитьПривилегированныйРежим(Истина);
		ИспользуютсяДоговорыКонтрагентов = ИспользуютсяДоговорыКонтрагентов
		#Удаление
		И ((ЗначениеЗаполнено(Объект.Соглашение)
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Соглашение, "ИспользуютсяДоговорыКонтрагентов"))
		#КонецУдаления
		#Вставка 
		//БИТ_Байков ЧТЗ 2_5 связь договоров и соглашений
		И (НЕ ЗначениеЗаполнено(Объект.Соглашение) ИЛИ (ЗначениеЗаполнено(Объект.Соглашение)И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Соглашение, "ИспользуютсяДоговорыКонтрагентов"))
		#КонецВставки
		Или ИспользуютсяДоговораПоОперации);
		УстановитьПривилегированныйРежим(Ложь);

	КонецЕсли;
	
	#Удаление
	ДоступностьЭлемента = ЗаполненыВлияющиеПоля
	И ИспользуютсяДоговорыКонтрагентов;
	#КонецУдаления
	#Вставка  
	//БИТ_Байков ЧТЗ 2_5 связь договоров и соглашений (что бы чаще было видно поле договора и заполнение можно было начать с него вместо соглашения)
	ДоступностьЭлемента = ИспользуютсяДоговорыКонтрагентов;
	#КонецВставки
	ВидимостьЭлемента   = ИспользуютсяДоговорыКонтрагентов;

	Если Не ДоступностьЭлемента
		И ЗначениеЗаполнено(Объект.Договор) Тогда

		Объект.Договор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();

	КонецЕсли;

КонецПроцедуры
