
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("НазваниеОтчета", "ОтчетПоИспытаниямГотовойПродукцииСДатой");
	ПараметрыФормы.Вставить("Синоним", "Отчет по испытаниям готовой продукции (по цеху) с датами");
	ОткрытьФорму("Обработка.КАНАТ_ОтчетыРезультатИспытаний.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
