
//&Вместо("ДанныеДляПечатныхФормСчетаНаОплатуИзвещения")
//Функция КАНАТ_ДанныеДляПечатныхФормСчетаНаОплатуИзвещения(ПараметрыПечати, МассивОбъектов, КодЯзыка)
//	Если ПараметрыПечати <> Неопределено И ПараметрыПечати.Свойство("ОтображатьСкидки") Тогда
//		ОтображатьСкидки = ПараметрыПечати.ОтображатьСкидки;
//	Иначе
//		ОтображатьСкидки = (Константы.ОтображениеСкидокВПечатныхФормахДокументовПродажи.Получить()
//			<> Перечисления.ВариантыВыводаСкидокВПечатныхФормах.НеВыводитьСкидки);
//	КонецЕсли; 
//	
//	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
//	ОтветственныеЛицаСервер.СформироватьВременнуюТаблицуОтветственныхЛицДокументов(МассивОбъектов, МенеджерВременныхТаблиц);	
//	
//	Запрос = Новый Запрос;
//	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
//	Запрос.Текст =
//	"ВЫБРАТЬ
//	|	Документы.Ссылка КАК Ссылка,
//	|	Документы.ДокументОснование КАК ДокументОснование
//	|ПОМЕСТИТЬ ТаблицаДокументов
//	|ИЗ
//	|	Документ.СчетНаОплатуКлиенту КАК Документы
//	|ГДЕ
//	|	Документы.Ссылка В(&МассивОбъектов)
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	Ссылка,
//	|	ДокументОснование
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	Документы.Ссылка КАК Ссылка,
//	|	Документы.Номер КАК Номер,
//	|	Документы.Дата КАК Дата,
//	|	Документы.ДокументОснование КАК ДокументОснование,
//	|	ЕСТЬNULL(Документы.БанковскийСчет.Владелец, Документы.Организация) КАК Организация,
//	|	Документы.Организация КАК ОрганизацияПоставщик,
//	|	ТаблицаОтветственныеЛица.РуководительНаименование КАК Руководитель,
//	|	ТаблицаОтветственныеЛица.РуководительДолжность КАК ДолжностьРуководителя,
//	|	ТаблицаОтветственныеЛица.ГлавныйБухгалтерНаименование КАК ГлавныйБухгалтер,
//	|	Документы.Контрагент КАК Контрагент,
//	|	Документы.Контрагент.ЮрФизЛицо КАК КонтрагентЮрФизЛицо,
//	|	Документы.БанковскийСчет КАК БанковскийСчет,
//	|	ВЫБОР
//	|		КОГДА Документы.БанковскийСчет.ИностранныйБанк
//	|				ИЛИ Документы.БанковскийСчет.ВалютаДенежныхСредств <> Документы.Организация.ВалютаРегламентированногоУчета
//	|			ТОГДА ИСТИНА
//	|		ИНАЧЕ ЛОЖЬ
//	|	КОНЕЦ КАК ПлатежЗаРубеж,
//	|	Документы.БанковскийСчет.ВалютаДенежныхСредств КАК ВалютаДенежныхСредств,
//	|	ВЫБОР
//	|		КОГДА Документы.БанковскийСчет.РучноеИзменениеРеквизитовБанка
//	|			ТОГДА Документы.БанковскийСчет.НаименованиеБанкаМеждународное
//	|		ИНАЧЕ Документы.БанковскийСчет.Банк.МеждународноеНаименование
//	|	КОНЕЦ КАК НаименованиеБанкаМеждународное,
//	|	ВЫБОР
//	|		КОГДА Документы.БанковскийСчет.РучноеИзменениеРеквизитовБанка
//	|			ТОГДА Документы.БанковскийСчет.НаименованиеБанкаДляРасчетовМеждународное
//	|		ИНАЧЕ Документы.БанковскийСчет.БанкДляРасчетов.МеждународноеНаименование
//	|	КОНЕЦ КАК НаименованиеБанкаДляРасчетовМеждународное,
//	|	ВЫБОР
//	|		КОГДА Документы.БанковскийСчет.РучноеИзменениеРеквизитовБанка
//	|			ТОГДА Документы.БанковскийСчет.СВИФТБанка
//	|		ИНАЧЕ Документы.БанковскийСчет.Банк.СВИФТБИК
//	|	КОНЕЦ КАК СВИФТБанка,
//	|	ВЫБОР
//	|		КОГДА Документы.БанковскийСчет.РучноеИзменениеРеквизитовБанкаДляРасчетов
//	|			ТОГДА Документы.БанковскийСчет.СВИФТБанкаДляРасчетов
//	|		ИНАЧЕ Документы.БанковскийСчет.БанкДляРасчетов.СВИФТБИК
//	|	КОНЕЦ КАК СВИФТБанкаДляРасчетов,
//	|	ВЫБОР
//	|		КОГДА Документы.БанковскийСчет.РучноеИзменениеРеквизитовБанка
//	|			ТОГДА Документы.БанковскийСчет.АдресБанкаМеждународный
//	|		ИНАЧЕ Документы.БанковскийСчет.Банк.АдресМеждународный
//	|	КОНЕЦ КАК АдресБанка,
//	|	ВЫБОР
//	|		КОГДА Документы.БанковскийСчет.РучноеИзменениеРеквизитовБанкаДляРасчетов
//	|			ТОГДА Документы.БанковскийСчет.АдресБанкаДляРасчетовМеждународный
//	|		ИНАЧЕ Документы.БанковскийСчет.БанкДляРасчетов.АдресМеждународный
//	|	КОНЕЦ КАК АдресБанкаДляРасчетов,
//	|	Документы.БанковскийСчет.СчетВБанкеДляРасчетов КАК СчетВБанкеДляРасчетов,
//	|	Документы.БанковскийСчет.НомерСчета КАК НомерБанковскогоСчета,
//	|	ВЫБОР
//	|		КОГДА Документы.БанковскийСчет.РучноеИзменениеРеквизитовБанка
//	|			ТОГДА Документы.БанковскийСчет.БИКБанка
//	|		ИНАЧЕ КлассификаторБанков.Код
//	|	КОНЕЦ КАК БИКБанк,
//	|	ВЫБОР
//	|		КОГДА Документы.БанковскийСчет.РучноеИзменениеРеквизитовБанка
//	|			ТОГДА Документы.БанковскийСчет.НаименованиеБанка
//	|		ИНАЧЕ КлассификаторБанков.Наименование
//	|	КОНЕЦ КАК НаименованиеБанка,
//	|	ВЫБОР
//	|		КОГДА Документы.БанковскийСчет.РучноеИзменениеРеквизитовБанка
//	|			ТОГДА Документы.БанковскийСчет.КоррСчетБанка
//	|		ИНАЧЕ КлассификаторБанков.КоррСчет
//	|	КОНЕЦ КАК КоррСчетБанка,
//	|	ВЫБОР
//	|		КОГДА Документы.БанковскийСчет.РучноеИзменениеРеквизитовБанка
//	|			ТОГДА Документы.БанковскийСчет.ГородБанка
//	|		ИНАЧЕ КлассификаторБанков.Город
//	|	КОНЕЦ КАК ГородБанка,
//	|	ВЫБОР
//	|		КОГДА Документы.БанковскийСчет.РучноеИзменениеРеквизитовБанкаДляРасчетов
//	|			ТОГДА Документы.БанковскийСчет.БИКБанкаДляРасчетов
//	|		ИНАЧЕ КлассификаторБанковКорреспондентовРФ.Код
//	|	КОНЕЦ КАК БИКБанкаДляРасчетов,
//	|	ВЫБОР
//	|		КОГДА Документы.БанковскийСчет.РучноеИзменениеРеквизитовБанкаДляРасчетов
//	|			ТОГДА Документы.БанковскийСчет.НаименованиеБанкаДляРасчетов
//	|		ИНАЧЕ КлассификаторБанковКорреспондентовРФ.Наименование
//	|	КОНЕЦ КАК НаименованиеБанкаДляРасчетов,
//	|	ВЫБОР
//	|		КОГДА Документы.БанковскийСчет.РучноеИзменениеРеквизитовБанкаДляРасчетов
//	|			ТОГДА Документы.БанковскийСчет.КоррСчетБанкаДляРасчетов
//	|		ИНАЧЕ КлассификаторБанковКорреспондентовРФ.КоррСчет
//	|	КОНЕЦ КАК КоррСчетБанкаДляРасчетов,
//	|	ВЫБОР
//	|		КОГДА Документы.БанковскийСчет.РучноеИзменениеРеквизитовБанкаДляРасчетов
//	|			ТОГДА Документы.БанковскийСчет.ГородБанкаДляРасчетов
//	|		ИНАЧЕ КлассификаторБанковКорреспондентовРФ.Город
//	|	КОНЕЦ КАК ГородБанкаДляРасчетов,
//	|	ВЫБОР
//	|		КОГДА Документы.БанковскийСчет.РучноеИзменениеРеквизитовБанкаДляРасчетов
//	|			ТОГДА Документы.БанковскийСчет.ГородБанкаМеждународный
//	|		ИНАЧЕ КлассификаторБанков.ГородМеждународный
//	|	КОНЕЦ КАК ГородБанкаМеждународный,
//	|	ВЫБОР
//	|		КОГДА Документы.БанковскийСчет.РучноеИзменениеРеквизитовБанкаДляРасчетов
//	|			ТОГДА Документы.БанковскийСчет.СтранаБанка
//	|		ИНАЧЕ КлассификаторБанков.Страна
//	|	КОНЕЦ КАК СтранаБанка,
//	|	ВЫБОР
//	|		КОГДА Документы.БанковскийСчет.РучноеИзменениеРеквизитовБанкаДляРасчетов
//	|			ТОГДА Документы.БанковскийСчет.ГородБанкаДляРасчетовМеждународный
//	|		ИНАЧЕ КлассификаторБанковКорреспондентовРФ.ГородМеждународный
//	|	КОНЕЦ КАК ГородБанкаДляРасчетовМеждународный,
//	|	ВЫБОР
//	|		КОГДА Документы.БанковскийСчет.РучноеИзменениеРеквизитовБанкаДляРасчетов
//	|			ТОГДА Документы.БанковскийСчет.СтранаБанкаДляРасчетов
//	|		ИНАЧЕ КлассификаторБанковКорреспондентовРФ.Страна
//	|	КОНЕЦ КАК СтранаБанкаДляРасчетов,
//	|	ВЫБОР
//	|		КОГДА Документы.БанковскийСчет.РучноеИзменениеРеквизитовБанка
//	|			ТОГДА """"
//	|		ИНАЧЕ ЕСТЬNULL(КлассификаторБанков.БИКРКЦ.Наименование, """")
//	|	КОНЕЦ КАК НаименованиеРКЦБанка,
//	|	ВЫБОР
//	|		КОГДА Документы.БанковскийСчет.РучноеИзменениеРеквизитовБанкаДляРасчетов
//	|			ТОГДА """"
//	|		ИНАЧЕ ЕСТЬNULL(КлассификаторБанковКорреспондентовРФ.БИКРКЦ.Наименование, """")
//	|	КОНЕЦ КАК НаименованиеРКЦБанкаДляРасчетов,
//	|	Документы.БанковскийСчет.ТекстКорреспондента КАК БанковскийСчетТекстКорреспондента,
//	|	ВЫБОР
//	|		КОГДА Документы.ДокументОснование ССЫЛКА Документ.ОтчетКомитенту
//	|			ТОГДА ИСТИНА
//	|		КОГДА Документы.ДокументОснование ССЫЛКА Документ.ОтчетКомиссионера
//	|			ТОГДА ИСТИНА
//	|		КОГДА Документы.ДокументОснование ССЫЛКА Справочник.ДоговорыКонтрагентов
//	|			ТОГДА ИСТИНА
//	|		ИНАЧЕ Документы.ДокументОснование.ЦенаВключаетНДС
//	|	КОНЕЦ КАК ЦенаВключаетНДС,
//	|	Документы.ДокументОснование.СуммаДокумента КАК СуммаКВозврату,
//	|	ВЫБОР
//	|		КОГДА Документы.ДокументОснование.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
//	|			ТОГДА ЛОЖЬ
//	|		ИНАЧЕ ИСТИНА
//	|	КОНЕЦ КАК УчитыватьНДС,
//	|	Документы.ДокументОснование.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДСУПокупателя) КАК ОперацияОблагаетсяНДСУПокупателя,
//	|	Документы.Валюта КАК Валюта,
//	|	Документы.Менеджер.ФизическоеЛицо КАК Менеджер,
//	|	Документы.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
//	|	Документы.ЧастичнаяОплата КАК ЧастичнаяОплата,
//	|	Документы.НазначениеПлатежа КАК НазначениеПлатежа,
//	|	ВЫБОР
//	|		КОГДА Документы.ДокументОснование ССЫЛКА Документ.ОтчетКомитенту
//	|				И Документы.ДокументОснование.СуммаВознаграждения = 0
//	|			ТОГДА 0
//	|		КОГДА Документы.ДокументОснование ССЫЛКА Документ.ОтчетКомитенту
//	|			ТОГДА Документы.СуммаДокумента * 100 / Документы.ДокументОснование.СуммаВознаграждения
//	|		КОГДА Документы.ДокументОснование.СуммаДокумента = 0
//	|			ТОГДА 0
//	|		КОГДА Документы.ДокументОснование ССЫЛКА Справочник.ДоговорыКонтрагентов
//	|			ТОГДА 100
//	|		КОГДА (Документы.ДокументОснование ССЫЛКА Документ.ЗаказКлиента
//	|				ИЛИ Документы.ДокументОснование ССЫЛКА Документ.ЗаявкаНаВозвратТоваровОтКлиента)
//	|				И Документы.ДокументОснование.ТребуетсяЗалогЗаТару
//	|			ТОГДА Документы.СуммаДокумента * 100 / (Документы.ДокументОснование.СуммаДокумента + Документы.ДокументОснование.СуммаВозвратнойТары)
//	|		КОГДА Документы.ДокументОснование ССЫЛКА Документ.ОтчетКомитентуОЗакупках
//	|			ТОГДА Документы.СуммаДокумента * 100 / (Документы.ДокументОснование.СуммаДокумента + Документы.ДокументОснование.СуммаВознаграждения)
//	|		ИНАЧЕ Документы.СуммаДокумента * 100 / Документы.ДокументОснование.СуммаДокумента
//	|	КОНЕЦ КАК ПроцентОплаты,
//	|	Документы.СуммаДокумента КАК СуммаДокумента,
//	|	НЕОПРЕДЕЛЕНО КАК Грузоотправитель,
//	|	Документы.ИдентификаторПлатежа КАК ИдентификаторПлатежа,
//	|	ВЫБОР
//	|		КОГДА ЗаявкаНаВозвратТоваровОтКлиента.Ссылка ЕСТЬ NULL
//	|			ТОГДА ЛОЖЬ
//	|		ИНАЧЕ ИСТИНА
//	|	КОНЕЦ КАК СчетКВозврату,
//	|	ВЫБОР
//	|		КОГДА Документы.ДокументОснование ССЫЛКА Справочник.ДоговорыКонтрагентов
//	|			ТОГДА Документы.ДокументОснование.СтавкаНДС
//	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
//	|	КОНЕЦ КАК СтавкаНДС,
//	|	ВЫБОР
//	|		КОГДА Документы.ДокументОснование ССЫЛКА Справочник.ДоговорыКонтрагентов
//	|			ТОГДА ВЫРАЗИТЬ(Документы.СуммаДокумента * (Документы.ДокументОснование.СтавкаНДС.Ставка / 100) / ((Документы.ДокументОснование.СтавкаНДС.Ставка + 100) / 100) КАК ЧИСЛО(31, 2))
//	|		ИНАЧЕ 0
//	|	КОНЕЦ КАК СуммаНДС,
//	|	ЗаказКлиента.Грузополучатель КАК Грузополучатель,
//	|	Документы.ФормаОплаты КАК ФормаОплаты,
//	|	ЕСТЬNULL(ЗаказКлиента.НеОтгружатьЧастями, ЛОЖЬ) КАК НеОтгружатьЧастями,
//	|	ЗаказКлиента.ДатаОтгрузки КАК ДатаОтгрузки,
//	|	ЗаказКлиента.СпособДоставки КАК СпособДоставки,
//	|	ЗаказКлиента.АдресДоставки КАК АдресДоставки,
//	|	ЗаказКлиента.КАНАТ_ПлатитЗаДоставку КАК ПлатитЗаДоставку,
//	|	ЕСТЬNULL(ДоговорыКонтрагентов.ДоговорСУчастникомГОЗ, ЛОЖЬ) КАК ДоговорСУчастникомГОЗ,
//	|	ЗаказКлиента.Соглашение КАК Соглашение,
//	|	СоглашенияСКлиентами.Типовое КАК СоглашениеТиповое,
//	|	ЕСТЬNULL(СоглашенияСКлиентами.КАНАТ_ВыводитьСкидки, ЛОЖЬ) КАК ВыводитьСкидки
//	|ИЗ
//	|	Документ.СчетНаОплатуКлиенту КАК Документы
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаВозвратТоваровОтКлиента КАК ЗаявкаНаВозвратТоваровОтКлиента
//	|		ПО Документы.ДокументОснование = ЗаявкаНаВозвратТоваровОтКлиента.Ссылка
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтветственныеЛица КАК ТаблицаОтветственныеЛица
//	|		ПО Документы.Ссылка = ТаблицаОтветственныеЛица.Ссылка
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторБанков КАК КлассификаторБанков
//	|		ПО Документы.БанковскийСчет.Банк = КлассификаторБанков.Ссылка
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторБанков КАК КлассификаторБанковКорреспондентовРФ
//	|		ПО Документы.БанковскийСчет.БанкДляРасчетов = КлассификаторБанковКорреспондентовРФ.Ссылка
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Константы КАК Константы
//	|		ПО (ИСТИНА)
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
//	|		ПО Документы.ДокументОснование = ЗаказКлиента.Ссылка
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
//	|		ПО Документы.Договор = ДоговорыКонтрагентов.Ссылка
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами КАК СоглашенияСКлиентами
//	|		ПО ЗаказКлиента.Соглашение = СоглашенияСКлиентами.Ссылка
//	|ГДЕ
//	|	Документы.Ссылка В
//	|			(ВЫБРАТЬ
//	|				ТаблицаДокументов.Ссылка
//	|			ИЗ
//	|				ТаблицаДокументов)
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	Документы.МоментВремени
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ДокументыФизическихЛицСрезПоследних.Физлицо КАК Физлицо,
//	|	МАКСИМУМ(ДокументыФизическихЛицСрезПоследних.Период) КАК Период,
//	|	Контрагенты.ЮрФизЛицо КАК ЮрФизЛицо,
//	|	Документы.Ссылка
//	|ПОМЕСТИТЬ ВтДокументУдостоверяющийЛичность
//	|ИЗ 
//	|	Документ.СчетНаОплатуКлиенту КАК Документы
//	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
//	|	ПО Документы.ДокументОснование = ЗаказКлиента.Ссылка
//	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
//	|	ПО ЗаказКлиента.Контрагент = Контрагенты.Ссылка
//	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних(
//	|			,
//	|			ЯвляетсяДокументомУдостоверяющимЛичность) КАК ДокументыФизическихЛицСрезПоследних
//	|	ПО Контрагенты.Ссылка = ДокументыФизическихЛицСрезПоследних.Физлицо
//	|ГДЕ
//	|	Документы.Ссылка В
//	|			(ВЫБРАТЬ
//	|				ТаблицаДокументов.Ссылка
//	|			ИЗ
//	|				ТаблицаДокументов)
//    |
//	|СГРУППИРОВАТЬ ПО
//	|	ДокументыФизическихЛицСрезПоследних.Физлицо,
//	|	Контрагенты.ЮрФизЛицо,
//	|	Документы.Ссылка
//	|;
//    |

//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ДокументыФизическихЛицСрезПоследних.Представление КАК Представление,
//	|	Вт.ЮрФизЛицо КАК ЮрФизЛицо,
//	|	Вт.Ссылка КАК Ссылка
//	|ИЗ
//	|	ВтДокументУдостоверяющийЛичность КАК Вт
//	|		ПРАВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних(
//	|				,
//	|				ЯвляетсяДокументомУдостоверяющимЛичность) КАК ДокументыФизическихЛицСрезПоследних
//	|		ПО (Вт.Физлицо = ДокументыФизическихЛицСрезПоследних.Физлицо
//	|				И Вт.Период = ДокументыФизическихЛицСрезПоследних.Период)
//	|;
//	|//////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ЭтапыГрафикаОплаты.Ссылка КАК Ссылка,
//	|	ЭтапыГрафикаОплаты.НомерСтроки КАК НомерСтроки,
//	|	ЭтапыГрафикаОплаты.ДатаПлатежа КАК ДатаПлатежа,
//	|	ЭтапыГрафикаОплаты.ПроцентПлатежа КАК ПроцентПлатежа,
//	|	ЭтапыГрафикаОплаты.СуммаПлатежа КАК СуммаПлатежа,
//	|	ЭтапыГрафикаОплаты.ЭтоЗалогЗаТару КАК ЭтоЗалогЗаТару
//	|ИЗ
//	|	Документ.СчетНаОплатуКлиенту.ЭтапыГрафикаОплаты КАК ЭтапыГрафикаОплаты
//	|ГДЕ
//	|	ЭтапыГрафикаОплаты.Ссылка В
//	|			(ВЫБРАТЬ
//	|				ТаблицаДокументов.Ссылка
//	|			ИЗ
//	|				ТаблицаДокументов)
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	НомерСтроки
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ТаблицаДокументов.Ссылка КАК Ссылка,
//	|	ТаблицаДокументов.ДокументОснование.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
//	|	Товары.НомерСтроки КАК НомерСтроки,
//	|	Товары.НоменклатураНабора,
//	|	Товары.ХарактеристикаНабора,
//	|	Товары.Номенклатура КАК Номенклатура,
//	|	Товары.Характеристика КАК Характеристика,
//	|	Товары.Упаковка КАК Упаковка,
//	|	Товары.Количество КАК Количество,
//	|	Товары.КоличествоУпаковок КАК КоличествоУпаковок,
//	|	ВЫБОР
//	|		КОГДА &ОтображатьСкидки ТОГДА
//	|			Товары.Цена
//	|		ИНАЧЕ Товары.Сумма/Товары.КоличествоУпаковок 
//	|	КОНЕЦ КАК Цена,
//	|	Товары.Сумма КАК Сумма,
//	|	Товары.СтавкаНДС КАК СтавкаНДС,
//	|	Товары.СуммаНДС КАК СуммаНДС,
//	|	ВЫБОР
//	|		КОГДА &ОтображатьСкидки ТОГДА
//	|			Товары.СуммаРучнойСкидки + Товары.СуммаАвтоматическойСкидки
//	|		ИНАЧЕ 0 
//	|	КОНЕЦ КАК СуммаСкидки,
//	|	Товары.Сумма + Товары.СуммаРучнойСкидки + Товары.СуммаАвтоматическойСкидки КАК СуммаБезСкидки,
//	|	ВЫБОР
//	|		КОГДА
//	|			Товары.Ссылка.ВернутьМногооборотнуюТару
//	|			И Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
//	|		ТОГДА
//	|			ИСТИНА
//	|		ИНАЧЕ
//	|			ЛОЖЬ
//	|	КОНЕЦ КАК ЭтоВозвратнаяТара,
//	|	Товары.Содержание КАК Содержание
//	|ПОМЕСТИТЬ ТоварыПодготовка
//	|ИЗ
//	|	ТаблицаДокументов КАК ТаблицаДокументов
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК Товары
//	|		ПО ТаблицаДокументов.ДокументОснование = Товары.Ссылка
//	|			И (Товары.Отменено = ЛОЖЬ)
//	|			И (Товары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
//	|				ИЛИ Товары.Ссылка.ТребуетсяЗалогЗаТару
//	|				ИЛИ НЕ Товары.Ссылка.ВернутьМногооборотнуюТару)
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	//++ НЕ УТКА

//	//++ Устарело_Переработка24
//	|ВЫБРАТЬ
//	|	ТаблицаДокументов.Ссылка КАК Ссылка,
//	|	Неопределено КАК ХозяйственнаяОперация,
//	|	1 КАК НомерСтроки,
//	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
//	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
//	|	Заказ.Номенклатура КАК Номенклатура,
//	|	Заказ.Характеристика КАК Характеристика,
//	|	NULL КАК Упаковка,
//	|	1 КАК Количество,
//	|	1 КАК КоличествоУпаковок,
//	|	СУММА(Товары.Сумма) КАК Цена,
//	|	СУММА(Товары.Сумма) КАК Сумма,
//	|	Заказ.СтавкаНДС КАК СтавкаНДС,
//	|	СУММА(Товары.СуммаНДС) КАК СуммаНДС,
//	|	0 КАК СуммаСкидки,
//	|	СУММА(Товары.Сумма) КАК СуммаБезСкидки,
//	|	Ложь,
//	|	МАКСИМУМ(Заказ.Содержание) КАК Содержание
//	|ИЗ
//	|	ТаблицаДокументов КАК ТаблицаДокументов
//	|
//	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
//	|		Документ.ЗаказДавальца КАК Заказ
//	|	ПО
//	|		ТаблицаДокументов.ДокументОснование = Заказ.Ссылка
//	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
//	|		Документ.ЗаказДавальца.Продукция КАК Товары
//	|	ПО
//	|		ТаблицаДокументов.ДокументОснование = Товары.Ссылка
//	|		И (Товары.Отменено = ЛОЖЬ)
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ТаблицаДокументов.Ссылка,
//	|	Заказ.Номенклатура,
//	|	Заказ.СтавкаНДС,
//	|	Заказ.Характеристика
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	//-- Устарело_Переработка24
//	|ВЫБРАТЬ
//	|	ТаблицаДокументов.Ссылка                                     КАК Ссылка,
//	|	НЕОПРЕДЕЛЕНО                                                 КАК ХозяйственнаяОперация,
//	|	Товары.НомерСтроки                                           КАК НомерСтроки,
//	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)               КАК НоменклатураНабора,
//	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК ХарактеристикаНабора,
//	|	Товары.Номенклатура                                          КАК Номенклатура,
//	|	Товары.Характеристика                                        КАК Характеристика,
//	|	Товары.Упаковка                                              КАК Упаковка,
//	|	Товары.Количество                                            КАК Количество,
//	|	Товары.КоличествоУпаковок                                    КАК КоличествоУпаковок,
//	|	Товары.Цена                                                  КАК Цена,
//	|	Товары.Сумма                                                 КАК Сумма,
//	|	Заказ.СтавкаНДС                                              КАК СтавкаНДС,
//	|	Товары.СуммаНДС                                              КАК СуммаНДС,
//	|	0                                                            КАК СуммаСкидки,
//	|	Товары.СуммаСНДС - Товары.СуммаНДС                           КАК СуммаБезСкидки,
//	|	ЛОЖЬ                                                         КАК ЭтоВозвратнаяТара,
//	|	Заказ.УслугаПоПереработке                                    КАК Содержание
//	|ИЗ
//	|	ТаблицаДокументов КАК ТаблицаДокументов
//	|	
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказДавальца2_5 КАК Заказ
//	|		ПО ТаблицаДокументов.ДокументОснование = Заказ.Ссылка
//	|	
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказДавальца2_5.Продукция КАК Товары
//	|		ПО ТаблицаДокументов.ДокументОснование = Товары.Ссылка
//	|		 И НЕ Товары.Отменено
//	//++ Устарело_Переработка24
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ТаблицаДокументов.Ссылка КАК Ссылка,
//	|	Неопределено КАК ХозяйственнаяОперация,
//	|	1 КАК НомерСтроки,
//	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
//	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
//	|	Отчет.Номенклатура КАК Номенклатура,
//	|	Отчет.Характеристика КАК Характеристика,
//	|	NULL КАК Упаковка,
//	|	1 КАК Количество,
//	|	1 КАК КоличествоУпаковок,
//	|	СУММА(Товары.Сумма) КАК Цена,
//	|	СУММА(Товары.Сумма) КАК Сумма,
//	|	Отчет.СтавкаНДС КАК СтавкаНДС,
//	|	СУММА(Товары.СуммаНДС) КАК СуммаНДС,
//	|	0 КАК СуммаСкидки,
//	|	СУММА(Товары.Сумма) КАК СуммаБезСкидки,
//	|	Ложь,
//	|	МАКСИМУМ(Отчет.Содержание) КАК Содержание
//	|ИЗ
//	|	ТаблицаДокументов КАК ТаблицаДокументов
//	|
//	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
//	|		Документ.ОтчетДавальцу КАК Отчет
//	|	ПО
//	|		ТаблицаДокументов.ДокументОснование = Отчет.Ссылка
//	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
//	|		Документ.ОтчетДавальцу.Продукция КАК Товары
//	|	ПО
//	|		ТаблицаДокументов.ДокументОснование = Товары.Ссылка
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ТаблицаДокументов.Ссылка,
//	|	Отчет.Номенклатура,
//	|	Отчет.СтавкаНДС,
//	|	Отчет.Характеристика
//	//-- Устарело_Переработка24
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ТаблицаДокументов.Ссылка                                     КАК Ссылка,
//	|	НЕОПРЕДЕЛЕНО                                                 КАК ХозяйственнаяОперация,
//	|	Товары.НомерСтроки                                           КАК НомерСтроки,
//	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)               КАК НоменклатураНабора,
//	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК ХарактеристикаНабора,
//	|	Товары.Номенклатура                                          КАК Номенклатура,
//	|	Товары.Характеристика                                        КАК Характеристика,
//	|	Товары.Упаковка                                              КАК Упаковка,
//	|	Товары.Количество                                            КАК Количество,
//	|	Товары.КоличествоУпаковок                                    КАК КоличествоУпаковок,
//	|	Товары.Цена                                                  КАК Цена,
//	|	Товары.Сумма                                                 КАК Сумма,
//	|	Отчет.СтавкаНДС                                              КАК СтавкаНДС,
//	|	Товары.СуммаНДС                                              КАК СуммаНДС,
//	|	0                                                            КАК СуммаСкидки,
//	|	Товары.СуммаСНДС - Товары.СуммаНДС                           КАК СуммаБезСкидки,
//	|	ЛОЖЬ                                                         КАК ЭтоВозвратнаяТара,
//	|	Отчет.УслугаПоПереработке                                    КАК Содержание
//	|ИЗ
//	|	ТаблицаДокументов КАК ТаблицаДокументов
//	|
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетДавальцу2_5 КАК Отчет
//	|		ПО ТаблицаДокументов.ДокументОснование = Отчет.Ссылка
//	|
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетДавальцу2_5.Продукция КАК Товары
//	|		ПО ТаблицаДокументов.ДокументОснование = Товары.Ссылка
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	//-- НЕ УТКА
//	|ВЫБРАТЬ
//	|	ТаблицаДокументов.Ссылка,
//	|	ТаблицаДокументов.ДокументОснование.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
//	|	Товары.НомерСтроки,
//	|	Товары.НоменклатураНабора,
//	|	Товары.ХарактеристикаНабора,
//	|	Товары.Номенклатура,
//	|	Товары.Характеристика,
//	|	Товары.Упаковка,
//	|	Товары.Количество,
//	|	Товары.КоличествоУпаковок,
//	|	ВЫБОР
//	|		КОГДА &ОтображатьСкидки ТОГДА
//	|			Товары.Цена
//	|		ИНАЧЕ Товары.Сумма/Товары.КоличествоУпаковок 
//	|	КОНЕЦ,
//	|	Товары.Сумма,
//	|	Товары.СтавкаНДС,
//	|	Товары.СуммаНДС,
//	|	ВЫБОР
//	|		КОГДА &ОтображатьСкидки ТОГДА
//	|			Товары.СуммаРучнойСкидки + Товары.СуммаАвтоматическойСкидки
//	|		ИНАЧЕ 0 
//	|	КОНЕЦ,
//	|	Товары.Сумма + Товары.СуммаРучнойСкидки + Товары.СуммаАвтоматическойСкидки,
//	|	ВЫБОР
//	|		КОГДА
//	|			Товары.Ссылка.ВернутьМногооборотнуюТару
//	|			И Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
//	|		ТОГДА
//	|			ИСТИНА
//	|		ИНАЧЕ
//	|			ЛОЖЬ
//	|	КОНЕЦ КАК ЭтоВозвратнаяТара,
//	|	Товары.Содержание
//	|ИЗ
//	|	ТаблицаДокументов КАК ТаблицаДокументов
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаВозвратТоваровОтКлиента.ЗаменяющиеТовары КАК Товары
//	|		ПО ТаблицаДокументов.ДокументОснование = Товары.Ссылка
//	|			И (Товары.Отменено = ЛОЖЬ)
//	|			И (Товары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
//	|				ИЛИ Товары.Ссылка.ТребуетсяЗалогЗаТару
//	|				ИЛИ НЕ Товары.Ссылка.ВернутьМногооборотнуюТару)
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ТаблицаДокументов.Ссылка,
//	|	ТаблицаДокументов.ДокументОснование.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
//	|	Товары.НомерСтроки,
//	|	Товары.НоменклатураНабора,
//	|	Товары.ХарактеристикаНабора,
//	|	Товары.Номенклатура,
//	|	Товары.Характеристика,
//	|	Товары.Упаковка,
//	|	Товары.Количество,
//	|	Товары.КоличествоУпаковок,
//	|	ВЫБОР
//	|		КОГДА &ОтображатьСкидки ТОГДА
//	|			Товары.Цена
//	|		ИНАЧЕ Товары.Сумма/Товары.КоличествоУпаковок 
//	|	КОНЕЦ,
//	|	Товары.Сумма,
//	|	Товары.СтавкаНДС,
//	|	Товары.СуммаНДС,
//	|	ВЫБОР
//	|		КОГДА &ОтображатьСкидки ТОГДА
//	|			Товары.СуммаРучнойСкидки + Товары.СуммаАвтоматическойСкидки
//	|		ИНАЧЕ 0 
//	|	КОНЕЦ,
//	|	Товары.Сумма + Товары.СуммаРучнойСкидки + Товары.СуммаАвтоматическойСкидки,
//	|	ВЫБОР
//	|		КОГДА
//	|			Товары.Ссылка.ВернутьМногооборотнуюТару
//	|			И Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
//	|		ТОГДА
//	|			ИСТИНА
//	|		ИНАЧЕ
//	|			ЛОЖЬ
//	|	КОНЕЦ КАК ЭтоВозвратнаяТара,
//	|	NULL
//	|ИЗ
//	|	ТаблицаДокументов КАК ТаблицаДокументов
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК Товары
//	|		ПО ТаблицаДокументов.ДокументОснование = Товары.Ссылка
//	|			И (Товары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
//	|				ИЛИ Товары.Ссылка.ТребуетсяЗалогЗаТару
//	|				ИЛИ НЕ Товары.Ссылка.ВернутьМногооборотнуюТару)
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ТаблицаДокументов.Ссылка,
//	|	Неопределено КАК ХозяйственнаяОперация,
//	|	Товары.НомерСтроки,
//	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
//	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
//	|	Товары.Номенклатура,
//	|	Товары.Характеристика,
//	|	Товары.Упаковка,
//	|	Товары.Количество,
//	|	Товары.КоличествоУпаковок,
//	|	Товары.Цена,
//	|	Товары.Сумма,
//	|	Товары.СтавкаНДС,
//	|	Товары.СуммаНДС,
//	|	0,
//	|	0,
//	|	Ложь,
//	|	NULL
//	|ИЗ
//	|	ТаблицаДокументов КАК ТаблицаДокументов
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВыкупВозвратнойТарыКлиентом.Товары КАК Товары
//	|		ПО ТаблицаДокументов.ДокументОснование = Товары.Ссылка
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ТаблицаДокументов.Ссылка,
//	|	ТаблицаДокументов.ДокументОснование.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
//	|	Услуги.НомерСтроки,
//	|	Услуги.НоменклатураНабора,
//	|	Услуги.ХарактеристикаНабора,
//	|	Услуги.Номенклатура,
//	|	Услуги.Характеристика,
//	|	NULL,
//	|	Услуги.Количество,
//	|	Услуги.Количество,
//	|	ВЫБОР
//	|		КОГДА &ОтображатьСкидки ТОГДА
//	|			Услуги.Цена
//	|		ИНАЧЕ Услуги.Сумма/Услуги.Количество 
//	|	КОНЕЦ,
//	|	Услуги.Сумма,
//	|	Услуги.СтавкаНДС,
//	|	Услуги.СуммаНДС,
//	|	ВЫБОР
//	|		КОГДА &ОтображатьСкидки ТОГДА
//	|			Услуги.СуммаРучнойСкидки + Услуги.СуммаАвтоматическойСкидки
//	|		ИНАЧЕ 0 
//	|	КОНЕЦ,
//	|	Услуги.Сумма + Услуги.СуммаРучнойСкидки + Услуги.СуммаАвтоматическойСкидки,
//	|	Ложь,
//	|	Услуги.Содержание
//	|ИЗ
//	|	ТаблицаДокументов КАК ТаблицаДокументов
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АктВыполненныхРабот.Услуги КАК Услуги
//	|		ПО ТаблицаДокументов.ДокументОснование = Услуги.Ссылка
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ТаблицаДокументов.Ссылка,
//	|	Неопределено КАК ХозяйственнаяОперация,
//	|	1,
//	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
//	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
//	|	Основание.Услуга,
//	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
//	|	NULL,
//	|	1,
//	|	1,
//	|	Основание.СуммаВознаграждения,
//	|	Основание.СуммаВознаграждения,
//	|	Основание.СтавкаНДСВознаграждения,
//	|	Основание.СуммаНДСВознаграждения,
//	|	0,
//	|	Основание.СуммаВознаграждения,
//	|	Ложь,
//	|	NULL
//	|ИЗ
//	|	ТаблицаДокументов КАК ТаблицаДокументов
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомитенту КАК Основание
//	|		ПО ТаблицаДокументов.ДокументОснование = Основание.Ссылка
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ТаблицаДокументов.Ссылка,
//	|	Неопределено КАК ХозяйственнаяОперация,
//	|	Товары.НомерСтроки,
//	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
//	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
//	|	Товары.Номенклатура,
//	|	Товары.Характеристика,
//	|	Товары.Упаковка,
//	|	Товары.Количество,
//	|	Товары.КоличествоУпаковок,
//	|	Товары.ЦенаПродажи,
//	|	Товары.СуммаПродажи,
//	|	Товары.СтавкаНДС,
//	|	Товары.СуммаПродажиНДС,
//	|	0,
//	|	Товары.СуммаПродажи,
//	|	Ложь,
//	|	NULL
//	|ИЗ
//	|	ТаблицаДокументов КАК ТаблицаДокументов
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионера.Товары КАК Товары
//	|		ПО ТаблицаДокументов.ДокументОснование = Товары.Ссылка
//	|ГДЕ
//	|	Товары.Количество <> 0
//	|	И Товары.СуммаПродажи <> 0
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ТаблицаДокументов.Ссылка,
//	|	Неопределено КАК ХозяйственнаяОперация,
//	|	Товары.НомерСтроки,
//	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
//	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
//	|	Товары.Номенклатура,
//	|	Товары.Характеристика,
//	|	Товары.Упаковка,
//	|	Товары.Количество,
//	|	Товары.КоличествоУпаковок,
//	|	Товары.Цена,
//	|	Товары.Сумма,
//	|	Товары.СтавкаНДС,
//	|	Товары.СуммаНДС,
//	|	0,
//	|	Товары.Сумма,
//	|	Ложь,
//	|	NULL
//	|ИЗ
//	|	ТаблицаДокументов КАК ТаблицаДокументов
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионераОСписании.Товары КАК Товары
//	|		ПО ТаблицаДокументов.ДокументОснование = Товары.Ссылка
//	|
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ТаблицаДокументов.Ссылка,
//	|	Неопределено КАК ХозяйственнаяОперация,
//	|	Товары.НомерСтроки,
//	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
//	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
//	|	Товары.Номенклатура,
//	|	Товары.Характеристика,
//	|	Товары.Упаковка,
//	|	Товары.Количество,
//	|	Товары.КоличествоУпаковок,
//	|	Товары.Цена,
//	|	Товары.Сумма,
//	|	Товары.СтавкаНДС,
//	|	Товары.СуммаНДС,
//	|	0,
//	|	0,
//	|	Ложь,
//	|	NULL
//	|ИЗ
//	|	ТаблицаДокументов КАК ТаблицаДокументов
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВыкупТоваровХранителем.Товары КАК Товары
//	|		ПО ТаблицаДокументов.ДокументОснование = Товары.Ссылка
//	|
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ТаблицаДокументов.Ссылка,
//	|	Неопределено КАК ХозяйственнаяОперация,
//	|	Товары.НомерСтроки,
//	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
//	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
//	|	Товары.Номенклатура,
//	|	Товары.Характеристика,
//	|	Товары.Упаковка,
//	|	Товары.Количество,
//	|	Товары.КоличествоУпаковок,
//	|	Товары.Цена,
//	|	Товары.Сумма,
//	|	Товары.СтавкаНДС,
//	|	Товары.СуммаНДС,
//	|	0,
//	|	0,
//	|	Ложь,
//	|	NULL
//	|ИЗ
//	|	ТаблицаДокументов КАК ТаблицаДокументов
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОЗакупках.Товары КАК Товары
//	|		ПО ТаблицаДокументов.ДокументОснование = Товары.Ссылка
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	
//	|ВЫБРАТЬ
//	|	ТаблицаДокументов.Ссылка,
//	|	Неопределено КАК ХозяйственнаяОперация,
//	|	1,
//	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
//	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
//	|	Основание.Услуга,
//	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
//	|	NULL,
//	|	1,
//	|	1,
//	|	Основание.СуммаВознаграждения-Основание.СуммаНДСВознаграждения,
//	|	Основание.СуммаВознаграждения-Основание.СуммаНДСВознаграждения,
//	|	Основание.СтавкаНДСВознаграждения,
//	|	Основание.СуммаНДСВознаграждения,
//	|	0,
//	|	Основание.СуммаВознаграждения,
//	|	Ложь,
//	|	NULL
//	|ИЗ
//	|	ТаблицаДокументов КАК ТаблицаДокументов
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОЗакупках КАК Основание
//	|		ПО ТаблицаДокументов.ДокументОснование = Основание.Ссылка
//	|	ГДЕ
//	|	Основание.СпособРасчетаВознаграждения <> ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаКомиссионногоВознаграждения.НеРассчитывается)
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	Таблица.Ссылка КАК Ссылка,
//	|	Таблица.ХозяйственнаяОперация,
//	|	
//	|	ВариантыКомплектацииНоменклатуры.Ссылка КАК ВариантКомплектацииНоменклатуры,
//	|	ВариантыКомплектацииНоменклатуры.ВариантПредставленияНабораВПечатныхФормах КАК ВариантПредставленияНабораВПечатныхФормах,
//	|	ВариантыКомплектацииНоменклатуры.ВариантРасчетаЦеныНабора КАК ВариантРасчетаЦеныНабора,
//	|	Таблица.НоменклатураНабора   КАК НоменклатураНабора,
//	|	Таблица.ХарактеристикаНабора КАК ХарактеристикаНабора,
//	|	
//	|	Таблица.НомерСтроки КАК НомерСтроки,
//	|	Таблица.Номенклатура КАК Номенклатура,
//	|	Таблица.Характеристика КАК Характеристика,
//	|	Таблица.Упаковка КАК Упаковка,
//	|	Таблица.Количество КАК Количество,
//	|	Таблица.КоличествоУпаковок КАК КоличествоУпаковок,
//	|	Таблица.Цена,
//	|	Таблица.Сумма КАК Сумма,
//	|	Таблица.СтавкаНДС,
//	|	Таблица.СуммаНДС,
//	|	Таблица.СуммаСкидки,
//	|	Таблица.СуммаБезСкидки,
//	|	Таблица.ЭтоВозвратнаяТара КАК ЭтоВозвратнаяТара,
//	|	Таблица.Содержание КАК Содержание
//	|ПОМЕСТИТЬ Товары
//	|ИЗ
//	|	ТоварыПодготовка КАК Таблица
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
//	|		ПО ВариантыКомплектацииНоменклатуры.Владелец = Таблица.НоменклатураНабора
//	|		И ВариантыКомплектацииНоменклатуры.Характеристика = Таблица.ХарактеристикаНабора
//	|		И ВариантыКомплектацииНоменклатуры.Основной
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	Таблица.Ссылка                 КАК Ссылка,
//	|	Таблица.ХозяйственнаяОперация,
//	|	Таблица.НоменклатураНабора     КАК НоменклатураНабора,
//	|	Таблица.ХарактеристикаНабора   КАК ХарактеристикаНабора,
//	|	МИНИМУМ(Таблица.НомерСтроки)   КАК НомерСтроки,
//	|	СУММА(Таблица.Сумма)           КАК Сумма,
//	|	СУММА(Таблица.СуммаНДС)        КАК СуммаНДС,
//	|	СУММА(Таблица.СуммаСкидки)     КАК СуммаСкидки,
//	|	СУММА(Таблица.СуммаБезСкидки)  КАК СуммаБезСкидки
//	|ПОМЕСТИТЬ ВременнаяТаблицаНаборыПодготовка
//	|ИЗ
//	|	Товары КАК Таблица
//	|
//	|ГДЕ
//	|	Таблица.НоменклатураНабора <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	Таблица.Ссылка,
//	|	Таблица.ХозяйственнаяОперация,
//	|	Таблица.НоменклатураНабора,
//	|	Таблица.ХарактеристикаНабора
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	ТаблицаТоваров.Ссылка КАК Ссылка
//	|ПОМЕСТИТЬ ТоварыРазличные
//	|ИЗ
//	|	Товары КАК ТаблицаТоваров
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	Товары.Ссылка                                    КАК Ссылка,
//	|	Товары.ВариантКомплектацииНоменклатуры           КАК ВариантКомплектацииНоменклатуры,
//	|	Товары.ВариантПредставленияНабораВПечатныхФормах КАК ВариантПредставленияНабораВПечатныхФормах,
//	|	Товары.ВариантРасчетаЦеныНабора                  КАК ВариантРасчетаЦеныНабора,
//	|	Товары.НоменклатураНабора,
//	|	Товары.ХарактеристикаНабора,
//	|	Товары.Номенклатура,
//	|	Товары.Характеристика,
//	|	ВЫБОР КОГДА Товары.ВариантКомплектацииНоменклатуры.НоменклатураОсновногоКомпонента = Товары.Номенклатура
//	|		И Товары.ВариантКомплектацииНоменклатуры.ХарактеристикаОсновногоКомпонента = Товары.Характеристика ТОГДА
//	|		ИСТИНА
//	|	ИНАЧЕ
//	|		ЛОЖЬ
//	|	КОНЕЦ КАК ОсновнаяКомплектующая,
//	|	Товары.СтавкаНДС КАК СтавкаНДС,
//	|	0 КАК КоличествоПоУмолчанию,
//	|	Товары.Количество КАК Количество
//	|ПОМЕСТИТЬ ВременнаяТаблицаНаборыДополнительноЧастьПервая
//	|ИЗ
//	|	Товары КАК Товары
//	|
//	|ГДЕ
//	|	Товары.НоменклатураНабора <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ТоварыРазличные.Ссылка                                                                  КАК Ссылка,
//	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка                                           КАК ВариантКомплектацииНоменклатуры,
//	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.ВариантПредставленияНабораВПечатныхФормах КАК ВариантПредставленияНабораВПечатныхФормах,
//	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.ВариантРасчетаЦеныНабора                  КАК ВариантРасчетаЦеныНабора,
//	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец                                  КАК НоменклатураНабора,
//	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Характеристика                            КАК ХарактеристикаНабора,
//	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура   КАК Номенклатура,
//	|	ВариантыКомплектацииНоменклатурыТовары.Характеристика КАК Характеристика,
//	|	ЛОЖЬ КАК ОсновнаяКомплектующая,
//	|	NULL КАК СтавкаНДС,
//	|	СУММА(ВариантыКомплектацииНоменклатурыТовары.Количество) КАК КоличествоПоУмолчанию,
//	|	0 КАК Количество
//	|ИЗ
//	|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыРазличные КАК ТоварыРазличные
//	|		ПО ИСТИНА
//	|ГДЕ
//	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка В (ВЫБРАТЬ РАЗЛИЧНЫЕ Т.ВариантКомплектацииНоменклатуры ИЗ Товары КАК Т)
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ТоварыРазличные.Ссылка,
//	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка,
//	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец,
//	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Характеристика,
//	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура,
//	|	ВариантыКомплектацииНоменклатурыТовары.Характеристика,
//	|	ВариантыКомплектацииНоменклатурыТовары.Упаковка
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	Таблица.Ссылка,
//	|	Таблица.ВариантКомплектацииНоменклатуры,
//	|	Таблица.ВариантРасчетаЦеныНабора,
//	|	Таблица.ВариантПредставленияНабораВПечатныхФормах,
//	|	Таблица.НоменклатураНабора,
//	|	Таблица.ХарактеристикаНабора,
//	|	Таблица.Номенклатура,
//	|	Таблица.Характеристика,
//	|	МАКСИМУМ(Таблица.СтавкаНДС) КАК СтавкаНДС,
//	|	МАКСИМУМ(Таблица.ОсновнаяКомплектующая) КАК ОсновнаяКомплектующая,
//	|	СУММА(Таблица.КоличествоПоУмолчанию) КАК КоличествоПоУмолчанию,
//	|	СУММА(Таблица.Количество) КАК Количество
//	|ПОМЕСТИТЬ ВременнаяТаблицаНаборыДополнительноЧастьВторая
//	|ИЗ
//	|	ВременнаяТаблицаНаборыДополнительноЧастьПервая КАК Таблица
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	Таблица.Ссылка,
//	|	Таблица.ВариантКомплектацииНоменклатуры,
//	|	Таблица.ВариантРасчетаЦеныНабора,
//	|	Таблица.ВариантПредставленияНабораВПечатныхФормах,
//	|	Таблица.НоменклатураНабора,
//	|	Таблица.ХарактеристикаНабора,
//	|	Таблица.Номенклатура,
//	|	Таблица.Характеристика
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	Результат.Ссылка,
//	|	Результат.ВариантКомплектацииНоменклатуры,
//	|	Результат.ВариантРасчетаЦеныНабора,
//	|	Результат.ВариантПредставленияНабораВПечатныхФормах,
//	|	Результат.НоменклатураНабора,
//	|	Результат.ХарактеристикаНабора,
//	|	МАКСИМУМ(ВЫБОР
//	|			КОГДА Результат.ОсновнаяКомплектующая
//	|				ТОГДА Результат.СтавкаНДС
//	|			ИНАЧЕ null
//	|		КОНЕЦ) КАК СтавкаНДС,
//	|	ВЫРАЗИТЬ(МИНИМУМ(ВЫБОР
//	|			КОГДА Результат.КоличествоПоУмолчанию <> 0 И Результат.ОсновнаяКомплектующая
//	|				ТОГДА Результат.Количество / Результат.КоличествоПоУмолчанию
//	|			ИНАЧЕ null
//	|		КОНЕЦ) + 0.5 КАК Число(10,0)) - 1 КАК Количество
//	|ПОМЕСТИТЬ ВременнаяТаблицаНаборыДополнительно
//	|ИЗ
//	|	ВременнаяТаблицаНаборыДополнительноЧастьВторая КАК Результат
//	|СГРУППИРОВАТЬ ПО
//	|	Результат.Ссылка,
//	|	Результат.ВариантКомплектацииНоменклатуры,
//	|	Результат.ВариантРасчетаЦеныНабора,
//	|	Результат.ВариантПредставленияНабораВПечатныхФормах,
//	|	Результат.НоменклатураНабора,
//	|	Результат.ХарактеристикаНабора
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ВременнаяТаблицаНаборыДополнительно.ВариантКомплектацииНоменклатуры,
//	|	
//	|	ВЫБОР КОГДА Таблица.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию) ТОГДА
//	|		ВЫБОР КОГДА ВременнаяТаблицаНаборыДополнительно.ВариантПредставленияНабораВПечатныхФормах = ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.ТолькоНабор) ТОГДА
//	|			ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.НаборИКомплектующие)
//	|		ИНАЧЕ
//	|			ВременнаяТаблицаНаборыДополнительно.ВариантПредставленияНабораВПечатныхФормах
//	|		КОНЕЦ
//	|	ИНАЧЕ
//	|		ВременнаяТаблицаНаборыДополнительно.ВариантПредставленияНабораВПечатныхФормах
//	|	КОНЕЦ КАК ВариантПредставленияНабораВПечатныхФормах,
//	|	
//	|	ВЫБОР КОГДА Таблица.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию) ТОГДА
//	|		ВЫБОР КОГДА
//	|			ВЫБОР КОГДА ВременнаяТаблицаНаборыДополнительно.ВариантПредставленияНабораВПечатныхФормах = ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.ТолькоНабор) ТОГДА
//	|				ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.НаборИКомплектующие)
//	|			ИНАЧЕ
//	|				ВременнаяТаблицаНаборыДополнительно.ВариантПредставленияНабораВПечатныхФормах
//	|			КОНЕЦ = ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.НаборИКомплектующие)
//	|			И ВременнаяТаблицаНаборыДополнительно.ВариантРасчетаЦеныНабора В (ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.ЦенаЗадаетсяЗаНаборРаспределяетсяПоЦенам),ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.ЦенаЗадаетсяЗаНаборРаспределяетсяПоДолям)) ТОГДА
//	|				ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.РассчитываетсяИзЦенКомплектующих)
//	|		ИНАЧЕ
//	|			ВременнаяТаблицаНаборыДополнительно.ВариантРасчетаЦеныНабора
//	|		КОНЕЦ
//	|	ИНАЧЕ
//	|		ВременнаяТаблицаНаборыДополнительно.ВариантРасчетаЦеныНабора
//	|	КОНЕЦ КАК ВариантРасчетаЦеныНабора,
//	|	
//	|	Таблица.Ссылка                            КАК Ссылка,
//	|	Таблица.ХозяйственнаяОперация,
//	|	Таблица.НоменклатураНабора                КАК НоменклатураНабора,
//	|	Таблица.ХарактеристикаНабора              КАК ХарактеристикаНабора,
//	|	Таблица.НомерСтроки                       КАК НомерСтроки,
//	|	ЕСТЬNULL(ВременнаяТаблицаНаборыДополнительно.Количество, 1) КАК КоличествоУпаковок,
//	|	ЕСТЬNULL(ВременнаяТаблицаНаборыДополнительно.Количество, 1) КАК Количество,
//	|	Таблица.Сумма                                 КАК Сумма,
//	|	Таблица.СуммаНДС                              КАК СуммаНДС,
//	|	Таблица.СуммаСкидки                           КАК СуммаСкидки,
//	|	Таблица.СуммаБезСкидки                        КАК СуммаБезСкидки,
//	|	ВременнаяТаблицаНаборыДополнительно.СтавкаНДС КАК СтавкаНДС
//	|ПОМЕСТИТЬ ВременнаяТаблицаНаборы
//	|ИЗ
//	|	ВременнаяТаблицаНаборыПодготовка КАК Таблица
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаНаборыДополнительно КАК ВременнаяТаблицаНаборыДополнительно
//	|		ПО Таблица.НоменклатураНабора = ВременнаяТаблицаНаборыДополнительно.НоменклатураНабора
//	|		И Таблица.ХарактеристикаНабора = ВременнаяТаблицаНаборыДополнительно.ХарактеристикаНабора
//	|		И Таблица.Ссылка = ВременнаяТаблицаНаборыДополнительно.Ссылка
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	СчетНаОплатуКлиенту.Ссылка КАК Ссылка,
//	|	ЗаказКлиентаЭтапыГрафикаОплаты.ВариантОтсчета КАК ВариантОтсчета,
//	|	ЗаказКлиентаЭтапыГрафикаОплаты.ПроцентПлатежа КАК ПроцентПлатежа,
//	|	ЗаказКлиентаЭтапыГрафикаОплаты.НомерСтроки КАК НомерСтроки
//	|ИЗ
//	|	Документ.СчетНаОплатуКлиенту КАК СчетНаОплатуКлиенту
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
//	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.ЭтапыГрафикаОплаты КАК ЗаказКлиентаЭтапыГрафикаОплаты
//	|			ПО ЗаказКлиента.Ссылка = ЗаказКлиентаЭтапыГрафикаОплаты.Ссылка
//	|		ПО СчетНаОплатуКлиенту.ДокументОснование = ЗаказКлиента.Ссылка
//	|ГДЕ
//	|	СчетНаОплатуКлиенту.Ссылка В
//	|			(ВЫБРАТЬ
//	|				ТаблицаДокументов.Ссылка
//	|			ИЗ
//	|				ТаблицаДокументов)
//	|	И ЗаказКлиентаЭтапыГрафикаОплаты.НомерСтроки = 1
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	Товары.Ссылка КАК Ссылка,
//	|	
//	|	Товары.ВариантПредставленияНабораВПечатныхФормах КАК ВариантПредставленияНабораВПечатныхФормах,
//	|	Товары.ВариантРасчетаЦеныНабора                  КАК ВариантРасчетаЦеныНабора,
//	|	
//	|	Товары.НоменклатураНабора    КАК НоменклатураНабора,
//	|	ЕСТЬNULL(НоменклатураНабораПредставления.НаименованиеПолное, Товары.НоменклатураНабора.НаименованиеПолное) КАК НоменклатураНабораНаименованиеПолное,
//	|	Товары.ХарактеристикаНабора  КАК ХарактеристикаНабора,
//	|	ЕСТЬNULL(ХарактеристикиНоменклатурыНабораПредставления.НаименованиеПолное, ЕСТЬNULL(Товары.ХарактеристикаНабора.НаименованиеПолное, """")) КАК ХарактеристикаНабораНаименованиеПолное,
//	|	Товары.ЭтоНабор         КАК ЭтоНабор,
//	|	Товары.ЭтоКомплектующие КАК ЭтоКомплектующие,
//	|	
//	|	Товары.НомерСтроки                     КАК НомерСтроки,
//	|	Товары.Номенклатура                    КАК Номенклатура,
//	|	Товары.Номенклатура.Код                КАК Код,
//	|	Товары.Номенклатура.Артикул            КАК Артикул,
//	|	ЕСТЬNULL(НоменклатураПредставления.НаименованиеПолное, Товары.Номенклатура.НаименованиеПолное) КАК НаименованиеПолное,
//	|	Товары.Содержание                      КАК Содержание,
//	|	&ТекстЗапросаНаименованиеЕдиницыИзмерения 				 КАК ЕдиницаИзмерения,
//	|	Товары.КоличествоУпаковок                                КАК Количество,
//	|	Товары.Цена КАК Цена,
//	|	Товары.Сумма                                             КАК Сумма,
//	|	Товары.СтавкаНДС                                         КАК СтавкаНДС,
//	|	Товары.СуммаНДС                                          КАК СуммаНДС,
//	|	НЕОПРЕДЕЛЕНО                                             КАК ВидЦеныИсполнителя,
//	|	ЕСТЬNULL(ХарактеристикиНоменклатурыПредставления.НаименованиеПолное, ЕСТЬNULL(Товары.Характеристика.НаименованиеПолное, """")) КАК Характеристика,
//	|	ВЫБОР КОГДА ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1) = 1 ТОГДА
//	|		НЕОПРЕДЕЛЕНО
//	|	ИНАЧЕ
//	|		Товары.Упаковка.Наименование
//	|	КОНЕЦ                                                    КАК Упаковка,
//	|	
//	|	Товары.СуммаСкидки                                       КАК СуммаСкидки,
//	|	
//	|	Товары.СуммаБезСкидки                                    КАК СуммаБезСкидки,
//	|	
//	|	Товары.ЭтоВозвратнаяТара                                 КАК ЭтоВозвратнаяТара	
//	|	
//	|ИЗ (
//	|	
//	|	ВЫБРАТЬ
//	|		Таблица.Ссылка,
//	|		
//	|		ВЫБОР КОГДА ЕСТЬNULL(ВременнаяТаблицаНаборы.НомерСтроки, 0) <> 0 ТОГДА
//	|			ВременнаяТаблицаНаборы.ВариантПредставленияНабораВПечатныхФормах
//	|		ИНАЧЕ
//	|			ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.ПустаяСсылка)
//	|		КОНЕЦ КАК ВариантПредставленияНабораВПечатныхФормах,
//	|		
//	|		ВЫБОР КОГДА ЕСТЬNULL(ВременнаяТаблицаНаборы.НомерСтроки, 0) <> 0 ТОГДА
//	|			ВременнаяТаблицаНаборы.ВариантРасчетаЦеныНабора
//	|		ИНАЧЕ
//	|			ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.ПустаяСсылка)
//	|		КОНЕЦ КАК ВариантРасчетаЦеныНабора,
//	|		
//	|		Таблица.НоменклатураНабора,
//	|		Таблица.ХарактеристикаНабора,
//	|		ВЫБОР КОГДА ЕСТЬNULL(ВременнаяТаблицаНаборы.НомерСтроки, 0) <> 0 ТОГДА
//	|			ИСТИНА
//	|		ИНАЧЕ
//	|			ЛОЖЬ
//	|		КОНЕЦ КАК ЭтоКомплектующие,
//	|		ЛОЖЬ КАК ЭтоНабор,
//	|		ВЫБОР КОГДА ЕСТЬNULL(ВременнаяТаблицаНаборы.НомерСтроки, 0) <> 0 ТОГДА
//	|			ВременнаяТаблицаНаборы.НомерСтроки
//	|		ИНАЧЕ
//	|			Таблица.НомерСтроки
//	|		КОНЕЦ КАК НомерСтроки,
//	|		Таблица.Номенклатура,
//	|		Таблица.Количество,
//	|		Таблица.КоличествоУпаковок,
//	|		Таблица.Цена,
//	|		Таблица.Сумма,
//	|		Таблица.СтавкаНДС,
//	|		Таблица.СуммаНДС,
//	|		Таблица.Характеристика,
//	|		Таблица.Упаковка,
//	|		Таблица.СуммаСкидки,
//	|		Таблица.СуммаБезСкидки,
//	|		Таблица.ЭтоВозвратнаяТара,
//	|		Таблица.Содержание
//	|	ИЗ
//	|		Товары КАК Таблица
//	|			ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаНаборы КАК ВременнаяТаблицаНаборы
//	|			ПО ВременнаяТаблицаНаборы.НоменклатураНабора = Таблица.НоменклатураНабора
//	|			 И ВременнаяТаблицаНаборы.ХарактеристикаНабора = Таблица.ХарактеристикаНабора
//	|			 И ВременнаяТаблицаНаборы.Ссылка = Таблица.Ссылка
//	|
//	|	ГДЕ
//	|		Таблица.НоменклатураНабора = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
//	|		ИЛИ (Таблица.НоменклатураНабора <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
//	|	        И ВременнаяТаблицаНаборы.ВариантПредставленияНабораВПечатныхФормах В (ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.ТолькоКомплектующие),
//	|	                                                                              ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.НаборИКомплектующие)))
//	|	
//	|	ОБЪЕДИНИТЬ ВСЕ
//	|	
//	|	ВЫБРАТЬ
//	|		ВременнаяТаблицаНаборы.Ссылка,
//	|		ВременнаяТаблицаНаборы.ВариантПредставленияНабораВПечатныхФормах,
//	|		ВременнаяТаблицаНаборы.ВариантРасчетаЦеныНабора КАК ВариантРасчетаЦеныНабора,
//	|		ВременнаяТаблицаНаборы.НоменклатураНабора,
//	|		ВременнаяТаблицаНаборы.ХарактеристикаНабора,
//	|		ЛОЖЬ КАК ЭтоКомплектующие,
//	|		ИСТИНА КАК ЭтоНабор,
//	|		ВременнаяТаблицаНаборы.НомерСтроки,
//	|		ВременнаяТаблицаНаборы.НоменклатураНабора,
//	|		ВременнаяТаблицаНаборы.Количество,
//	|		ВременнаяТаблицаНаборы.КоличествоУпаковок,
//	|		ВЫБОР
//	|			КОГДА &ОтображатьСкидки ТОГДА
//	|				ВЫБОР КОГДА ЕСТЬNULL(ВременнаяТаблицаНаборы.КоличествоУпаковок, 1) <> 0 ТОГДА
//	|					(ВременнаяТаблицаНаборы.СуммаБезСкидки) / ЕСТЬNULL(ВременнаяТаблицаНаборы.КоличествоУпаковок, 1)
//	|				ИНАЧЕ
//	|					0
//	|				КОНЕЦ
//	|			ИНАЧЕ
//	|				ВЫБОР КОГДА ЕСТЬNULL(ВременнаяТаблицаНаборы.КоличествоУпаковок, 1) <> 0 ТОГДА
//	|					(ВременнаяТаблицаНаборы.Сумма) / ЕСТЬNULL(ВременнаяТаблицаНаборы.КоличествоУпаковок, 1)
//	|				ИНАЧЕ
//	|					0
//	|				КОНЕЦ
//	|		КОНЕЦ КАК Цена,
//	|		ВременнаяТаблицаНаборы.Сумма КАК Сумма,
//	|		ВременнаяТаблицаНаборы.СтавкаНДС,
//	|		ВременнаяТаблицаНаборы.СуммаНДС,
//	|		ВременнаяТаблицаНаборы.ХарактеристикаНабора,
//	|		ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) КАК Упаковка,
//	|		ВременнаяТаблицаНаборы.СуммаСкидки,
//	|		ВременнаяТаблицаНаборы.СуммаБезСкидки,
//	|		Ложь,
//	|		""""
//	|	ИЗ
//	|		ВременнаяТаблицаНаборы КАК ВременнаяТаблицаНаборы
//	|	ГДЕ
//	|		ВременнаяТаблицаНаборы.ВариантПредставленияНабораВПечатныхФормах В (ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.ТолькоНабор),
//	|	                                                                        ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.НаборИКомплектующие))
//	|) КАК Товары
//	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.Представления КАК НоменклатураПредставления
//	|	ПО (Товары.Номенклатура = НоменклатураПредставления.Ссылка
//	|			И НоменклатураПредставления.КодЯзыка = &КодЯзыка)
//	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.Представления КАК ХарактеристикиНоменклатурыПредставления
//	|	ПО (Товары.Характеристика = ХарактеристикиНоменклатурыПредставления.Ссылка
//	|			И ХарактеристикиНоменклатурыПредставления.КодЯзыка = &КодЯзыка)
//	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.Представления КАК НоменклатураНабораПредставления
//	|	ПО (Товары.НоменклатураНабора = НоменклатураНабораПредставления.Ссылка
//	|			И НоменклатураНабораПредставления.КодЯзыка = &КодЯзыка)
//	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.Представления КАК ХарактеристикиНоменклатурыНабораПредставления
//	|	ПО (Товары.ХарактеристикаНабора = ХарактеристикиНоменклатурыНабораПредставления.Ссылка
//	|			И ХарактеристикиНоменклатурыНабораПредставления.КодЯзыка = &КодЯзыка)
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	Товары.НомерСтроки,
//	|	ЭтоНабор УБЫВ
//	|";
//	
//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаКоэффициентУпаковки",
//		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
//			"Товары.Упаковка",
//			"Товары.Номенклатура"));
//			
//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаНаименованиеЕдиницыИзмерения",
//		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаЗначениеРеквизитаЕдиницыИзмерения(
//			"Наименование",
//			"Товары.Упаковка",
//			"Товары.Номенклатура"));
//	
//	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
//	Запрос.УстановитьПараметр("ОтображатьСкидки", ОтображатьСкидки);
//	Запрос.УстановитьПараметр("КодЯзыка", КодЯзыка);
//	
//	ПакетРезультатовЗапроса = Запрос.ВыполнитьПакет();
//	
//	СтруктураДанныхДляПечати = Новый Структура;
//	СтруктураДанныхДляПечати.Вставить("РезультатПоШапке", ПакетРезультатовЗапроса[1]);
//	СтруктураДанныхДляПечати.Вставить("РезультатПоЭтапамОплаты", ПакетРезультатовЗапроса[4]);
//	//·++·Гурьев·07.08.23·#2_11_4·Данные табличной части, нужные для заполнения полей
//	СтруктураДанныхДляПечати.Вставить("ЭтапыГрафикаОплатыЗаказКлиента", ПакетРезультатовЗапроса[ПакетРезультатовЗапроса.Количество() - 2]);
//	//·--·Гурьев·07.08.23
//	//·++·Гурьев·16.08.23·#2_2·Данные табличной части, нужные для документа удостоверяющего личность
//	СтруктураДанныхДляПечати.Вставить("ДокументУдостоверяющийЛичность", ПакетРезультатовЗапроса[3]);
//	//·--·Гурьев·16.08.23

//	СтруктураДанныхДляПечати.Вставить("РезультатПоТабличнойЧасти", ПакетРезультатовЗапроса[ПакетРезультатовЗапроса.Количество() - 1]);
//	
//	// <+БИТ> Руденков_Е.И. 29.03.2024 
//	// #000000222, Счет на оплату.
//	ЗаполненаКАНАТ_Товары = Ложь;
//	ЗапросКАНАТ_Товары = Новый Запрос;
//	ЗапросКАНАТ_Товары.Текст = 
//	"ВЫБРАТЬ *
//	|ПОМЕСТИТЬ ТчКАНАТ_Товары
//	|ИЗ
//	|	Документ.СчетНаОплатуКлиенту.КАНАТ_Товары КАК ТчКАНАТ_Товары
//	|ГДЕ
//	|	ТчКАНАТ_Товары.Ссылка В(&МассивОбъектов)
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ТчКАНАТ_Товары.Ссылка КАК Ссылка,
//	|	ТчКАНАТ_Товары.НомерСтроки КАК НомерСтроки,
//	|	ТчКАНАТ_Товары.ДатаОтгрузки КАК ДатаОтгрузки,
//	|	ТчКАНАТ_Товары.Номенклатура КАК Номенклатура,
//	|	ТчКАНАТ_Товары.Номенклатура.НаименованиеПолное КАК НаименованиеПолное,
//	|	ТчКАНАТ_Товары.Характеристика.НаименованиеПолное КАК Характеристика,
//	|	ТчКАНАТ_Товары.Упаковка КАК Упаковка,
//	|	ТчКАНАТ_Товары.КоличествоУпаковок КАК КоличествоУпаковок,
//	|	ТчКАНАТ_Товары.Количество КАК Количество,
//	|	ТчКАНАТ_Товары.ВидЦены КАК ВидЦены,
//	|	ТчКАНАТ_Товары.Цена КАК ЦенаТЧ,
//	|	ТчКАНАТ_Товары.Сумма КАК Сумма,
//	|	ТчКАНАТ_Товары.УдалитьСтавкаНДС КАК УдалитьСтавкаНДС,
//	|	ТчКАНАТ_Товары.СтавкаНДС КАК СтавкаНДС,
//	|	ТчКАНАТ_Товары.СуммаНДС КАК СуммаНДС,
//	|	ТчКАНАТ_Товары.СуммаСНДС КАК СуммаСНДС,
//	|	ТчКАНАТ_Товары.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
//	|	ТчКАНАТ_Товары.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
//	|	ТчКАНАТ_Товары.ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки,
//	|	ТчКАНАТ_Товары.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
//	|	ТчКАНАТ_Товары.ПричинаОтмены КАК ПричинаОтмены,
//	|	ТчКАНАТ_Товары.КодСтроки КАК КодСтроки,
//	|	ТчКАНАТ_Товары.Отменено КАК Отменено,
//	|	ТчКАНАТ_Товары.КлючСвязи КАК КлючСвязи,
//	|	ТчКАНАТ_Товары.Склад КАК Склад,
//	|	ТчКАНАТ_Товары.СрокПоставки КАК СрокПоставки,
//	|	ТчКАНАТ_Товары.Содержание КАК Содержание,
//	|	ТчКАНАТ_Товары.СтатусУказанияСерий КАК СтатусУказанияСерий,
//	|	ТчКАНАТ_Товары.ВариантОбеспечения КАК ВариантОбеспечения,
//	|	ТчКАНАТ_Товары.Серия КАК Серия,
//	|	ТчКАНАТ_Товары.НоменклатураНабора КАК НоменклатураНабора,
//	|	ТчКАНАТ_Товары.Обособленно КАК Обособленно,
//	|	ТчКАНАТ_Товары.ХарактеристикаНабора КАК ХарактеристикаНабора,
//	|	ТчКАНАТ_Товары.ХарактеристикаНабора.НаименованиеПолное КАК ХарактеристикаНабораНаименованиеПолное,
//	|	ТчКАНАТ_Товары.ИдентификаторСтроки КАК ИдентификаторСтроки,
//	|	ТчКАНАТ_Товары.ВариантОбеспеченияДоИзмененияОбновлениемИБ КАК ВариантОбеспеченияДоИзмененияОбновлениемИБ,
//	|	ТчКАНАТ_Товары.Подразделение КАК Подразделение,
//	|	ТчКАНАТ_Товары.НоменклатураПартнера КАК НоменклатураПартнера,
//	|	ТчКАНАТ_Товары.СуммаБонусныхБалловКСписанию КАК СуммаБонусныхБалловКСписанию,
//	|	ТчКАНАТ_Товары.СуммаБонусныхБалловКСписаниюВВалюте КАК СуммаБонусныхБалловКСписаниюВВалюте,
//	|	ТчКАНАТ_Товары.СуммаНачисленныхБонусныхБалловВВалюте КАК СуммаНачисленныхБонусныхБалловВВалюте,
//	|	ТчКАНАТ_Товары.СпособДоставки Как СпособДоставки,
//	|	ТчКАНАТ_Товары.ПеревозчикПартнер Как ПеревозчикПартнер,
//	|	ТчКАНАТ_Товары.Грузополучатель Как Грузополучатель,
//	|	ТчКАНАТ_Товары.НеОтгружатьЧастями Как НеОтгружатьЧастями,
//	|	ТчКАНАТ_Товары.ДатаОтгрузкиОснования Как ДатаОтгрузкиОснования,
//	|	ТчКАНАТ_Товары.АдресДоставки Как АдресДоставки,
//	|	ТчКАНАТ_Товары.КАНАТ_ПлатитЗаДоставку Как КАНАТ_ПлатитЗаДоставку,
//	|	Ложь Как ЭтоНабор,
//	|	Ложь Как ЭтоКомплектующие,
//	|	Ложь Как ЭтоВозвратнаяТара,
//	|	ТчКАНАТ_Товары.Сумма + ТчКАНАТ_Товары.СуммаРучнойСкидки + ТчКАНАТ_Товары.СуммаАвтоматическойСкидки КАК СуммаБезСкидки,
//	|	ВЫБОР
//	|		КОГДА &ОтображатьСкидки
//	|			ТОГДА ТчКАНАТ_Товары.СуммаРучнойСкидки + ТчКАНАТ_Товары.СуммаАвтоматическойСкидки
//	|		ИНАЧЕ 0
//	|	КОНЕЦ КАК СуммаСкидки,
//	|	ВЫБОР
//	|		КОГДА &ОтображатьСкидки
//	|			ТОГДА ТчКАНАТ_Товары.Цена
//	|		ИНАЧЕ ТчКАНАТ_Товары.Сумма / ТчКАНАТ_Товары.КоличествоУпаковок
//	|	КОНЕЦ КАК Цена,
//	//БИТ_Гурьев__06.05.24++
//	|	&ТекстЗапросаНаименованиеЕдиницыИзмерения КАК ЕдиницаИзмерения
//	//БИТ_Гурьев__06.05.24--
//	|ИЗ
//	|	ТчКАНАТ_Товары КАК ТчКАНАТ_Товары
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуКлиенту КАК СчетНаОплатуКлиенту
//	|		ПО ТчКАНАТ_Товары.Ссылка = СчетНаОплатуКлиенту.Ссылка
//	//БИТ_Гурьев__06.05.24++
//	|ГДЕ
//	|	ТчКАНАТ_Товары.Отменено = Ложь";
//	//БИТ_Гурьев__06.05.24--";
//	ЗапросКАНАТ_Товары.УстановитьПараметр("МассивОбъектов"		,МассивОбъектов);
//	ЗапросКАНАТ_Товары.УстановитьПараметр("ОтображатьСкидки"	,ОтображатьСкидки);
//	//БИТ_Гурьев__06.05.24++
//	ЗапросКАНАТ_Товары.Текст = СтрЗаменить(ЗапросКАНАТ_Товары.Текст, "&ТекстЗапросаНаименованиеЕдиницыИзмерения",
//		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаЗначениеРеквизитаЕдиницыИзмерения(
//			"Наименование",
//			"ТчКАНАТ_Товары.Упаковка",
//			"ТчКАНАТ_Товары.Номенклатура"));
//	//БИТ_Гурьев__06.05.24--
//	РезультатКАНАТ_Товары = ЗапросКАНАТ_Товары.Выполнить();
//	СтруктураДанныхДляПечати.Вставить("КАНАТ_Товары",РезультатКАНАТ_Товары);
//	// <-БИТ> Руденков_Е.И. 29.03.2024
//	
//	Возврат СтруктураДанныхДляПечати;

//КонецФункции

//&Вместо("СформироватьНазначениеПлатежа")
//Функция КАНАТ_СформироватьНазначениеПлатежа(Знач Номер, Знач ДокументОснование)
//	ТекстДокумента = "";
//		
//	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
//		//++ Гурьев 09.11.23 ЧТЗ_2_11_4
//		//ТекстНазначениеПлатежа = НСтр("ru = 'Оплата по заказу клиента №%Номер%';
//		//								|en = 'Payment by sales order No.%Номер%'");
//		ТекстНазначениеПлатежа = НСтр("ru = 'Оплата по счету №%Номер%';
//										|en = 'Payment by sales order No.%Номер%'");

//		//-- Гурьев 09.11.23 ЧТЗ_2_11_4
//	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("СправочникСсылка.СоглашенияСКлиентами") Тогда
//		
//		ТекстНазначениеПлатежа = НСтр("ru = 'Оплата по соглашению №%Номер%';
//										|en = 'Payment by agreement No.%Номер%'");
//		
//	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента") Тогда
//		
//		ТекстНазначениеПлатежа = НСтр("ru = 'Оплата по заявке на возврат №%Номер%';
//										|en = 'Payment by return request No.%Номер%'");
//		
//	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ОтчетКомиссионераОСписании") Тогда
//		
//		ТекстНазначениеПлатежа = НСтр("ru = 'Оплата по отчету комиссионера о списании №%Номер%';
//										|en = 'Payment by write-off report from commission agent No.%Номер%'");
//		
//	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ОтчетКомитенту") Тогда
//		
//		ТекстНазначениеПлатежа = НСтр("ru = 'Оплата по отчету комитенту №%Номер%';
//										|en = 'Payment by agent report No.%Номер%'");
//		
//	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ОтчетКомиссионера") Тогда
//		
//		ТекстНазначениеПлатежа = НСтр("ru = 'Оплата по отчету комиссионера о продажах №%Номер%';
//										|en = 'Payment by account sales from commission agent No.%Номер%'");
//		
//	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
//		
//		ТекстНазначениеПлатежа = НСтр("ru = 'Оплата по реализации товаров и услуг №%Номер%';
//										|en = 'Payment by сustomer invoice #%Номер%'");
//		
//	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ВыкупВозвратнойТарыКлиентом") Тогда
//		
//		ТекстНазначениеПлатежа = НСтр("ru = 'Оплата по выкупу возвратной тары клиентом №%Номер%';
//										|en = 'Payment under returnable packaging redemption by customer No.%Номер%'");
//		
//	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.АктВыполненныхРабот") Тогда
//		
//		ТекстНазначениеПлатежа = НСтр("ru = 'Оплата по акту выполненных работ №%Номер%';
//										|en = 'Payment by Customer invoice —Services #%Номер%'");
//		
//	//++ НЕ УТКА

//	//++ Устарело_Переработка24
//	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказДавальца")
//		  Или ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ОтчетДавальцу") Тогда
//		
//		ТекстНазначениеПлатежа = НСтр("ru = 'Оплата по акту выполненных работ №%Номер%';
//										|en = 'Payment by Customer invoice —Services #%Номер%'");
//	//-- Устарело_Переработка24
//	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказДавальца2_5")
//		  Или ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ОтчетДавальцу2_5") Тогда
//		
//		ТекстНазначениеПлатежа = НСтр("ru = 'Оплата по акту выполненных работ №%Номер%';
//										|en = 'Payment by Customer invoice —Services #%Номер%'");
//		
//	//-- НЕ УТКА
//	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
//		
//		ТекстНазначениеПлатежа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "НаименованиеДляПечати");
//		
//	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ОтчетКомитентуОЗакупках") Тогда
//		
//		ТекстНазначениеПлатежа = НСтр("ru = 'Оплата по отчету комитенту о закупках №%Номер%';
//										|en = 'Payment according to the purchasing report to consignor No.%Номер%'");
//		
//	КонецЕсли;
//		
//	ТекстНазначениеПлатежа = СтрЗаменить(
//		ТекстНазначениеПлатежа,
//		"%Номер%",
//		ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Номер, Ложь, Истина));
//		
//	Возврат ТекстНазначениеПлатежа;
//КонецФункции

&ИзменениеИКонтроль("ДанныеДляПечатныхФормСчетаНаОплатуИзвещения")
Функция КАНАТ_ДанныеДляПечатныхФормСчетаНаОплатуИзвещения(ПараметрыПечати, МассивОбъектов, КодЯзыка)

	Если ПараметрыПечати <> Неопределено И ПараметрыПечати.Свойство("ОтображатьСкидки") Тогда
		ОтображатьСкидки = ПараметрыПечати.ОтображатьСкидки;
	Иначе
		ОтображатьСкидки = (Константы.ОтображениеСкидокВПечатныхФормахДокументовПродажи.Получить()
		<> Перечисления.ВариантыВыводаСкидокВПечатныхФормах.НеВыводитьСкидки);
	КонецЕсли; 

	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ОтветственныеЛицаСервер.СформироватьВременнуюТаблицуОтветственныхЛицДокументов(МассивОбъектов, МенеджерВременныхТаблиц);	

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Документы.Ссылка КАК Ссылка,
	|	Документы.ДокументОснование КАК ДокументОснование
	|ПОМЕСТИТЬ ТаблицаДокументов
	|ИЗ
	|	Документ.СчетНаОплатуКлиенту КАК Документы
	|ГДЕ
	|	Документы.Ссылка В(&МассивОбъектов)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Документы.Ссылка КАК Ссылка,
	|	Документы.Номер КАК Номер,
	|	Документы.Дата КАК Дата,
	|	Документы.ДокументОснование КАК ДокументОснование,
	|	ЕСТЬNULL(Документы.БанковскийСчет.Владелец, Документы.Организация) КАК Организация,
	|	Документы.Организация КАК ОрганизацияПоставщик,
	|	ТаблицаОтветственныеЛица.РуководительНаименование КАК Руководитель,
	|	ТаблицаОтветственныеЛица.РуководительДолжность КАК ДолжностьРуководителя,
	|	ТаблицаОтветственныеЛица.ГлавныйБухгалтерНаименование КАК ГлавныйБухгалтер,
	|	Документы.Контрагент КАК Контрагент,
	|	Документы.Контрагент.ЮрФизЛицо КАК КонтрагентЮрФизЛицо,
	|	Документы.БанковскийСчет КАК БанковскийСчет,
	|	
	|	ВЫБОР КОГДА Документы.БанковскийСчет.ИностранныйБанк
	|		ИЛИ Документы.БанковскийСчет.ВалютаДенежныхСредств <> Документы.Организация.ВалютаРегламентированногоУчета ТОГДА
	|		ИСТИНА
	|	ИНАЧЕ
	|		ЛОЖЬ
	|	КОНЕЦ КАК ПлатежЗаРубеж,
	|	Документы.БанковскийСчет.ВалютаДенежныхСредств КАК ВалютаДенежныхСредств,
	|	
	|	ВЫБОР КОГДА Документы.БанковскийСчет.РучноеИзменениеРеквизитовБанка ТОГДА Документы.БанковскийСчет.НаименованиеБанкаМеждународное
	|		ИНАЧЕ Документы.БанковскийСчет.Банк.МеждународноеНаименование КОНЕЦ КАК НаименованиеБанкаМеждународное,
	|	ВЫБОР КОГДА Документы.БанковскийСчет.РучноеИзменениеРеквизитовБанка ТОГДА Документы.БанковскийСчет.НаименованиеБанкаДляРасчетовМеждународное
	|		ИНАЧЕ Документы.БанковскийСчет.БанкДляРасчетов.МеждународноеНаименование КОНЕЦ КАК НаименованиеБанкаДляРасчетовМеждународное,
	|	ВЫБОР КОГДА Документы.БанковскийСчет.РучноеИзменениеРеквизитовБанка ТОГДА Документы.БанковскийСчет.СВИФТБанка
	|		ИНАЧЕ Документы.БанковскийСчет.Банк.СВИФТБИК КОНЕЦ КАК СВИФТБанка,
	|	ВЫБОР КОГДА Документы.БанковскийСчет.РучноеИзменениеРеквизитовБанкаДляРасчетов ТОГДА Документы.БанковскийСчет.СВИФТБанкаДляРасчетов
	|		ИНАЧЕ Документы.БанковскийСчет.БанкДляРасчетов.СВИФТБИК КОНЕЦ КАК СВИФТБанкаДляРасчетов,
	|	ВЫБОР КОГДА Документы.БанковскийСчет.РучноеИзменениеРеквизитовБанка ТОГДА Документы.БанковскийСчет.АдресБанкаМеждународный
	|		ИНАЧЕ Документы.БанковскийСчет.Банк.АдресМеждународный КОНЕЦ КАК АдресБанка,
	|	ВЫБОР КОГДА Документы.БанковскийСчет.РучноеИзменениеРеквизитовБанкаДляРасчетов ТОГДА Документы.БанковскийСчет.АдресБанкаДляРасчетовМеждународный
	|		ИНАЧЕ Документы.БанковскийСчет.БанкДляРасчетов.АдресМеждународный КОНЕЦ КАК АдресБанкаДляРасчетов,
	|	
	|	Документы.БанковскийСчет.СчетВБанкеДляРасчетов КАК СчетВБанкеДляРасчетов,
	|	
	|	Документы.БанковскийСчет.НомерСчета КАК НомерБанковскогоСчета,
	|	ВЫБОР
	|		КОГДА Документы.БанковскийСчет.РучноеИзменениеРеквизитовБанка
	|			ТОГДА Документы.БанковскийСчет.БИКБанка
	|		ИНАЧЕ КлассификаторБанков.Код
	|	КОНЕЦ КАК БИКБанк,
	|	ВЫБОР
	|		КОГДА Документы.БанковскийСчет.РучноеИзменениеРеквизитовБанка
	|			ТОГДА Документы.БанковскийСчет.НаименованиеБанка
	|		ИНАЧЕ КлассификаторБанков.Наименование
	|	КОНЕЦ КАК НаименованиеБанка,
	|	ВЫБОР
	|		КОГДА Документы.БанковскийСчет.РучноеИзменениеРеквизитовБанка
	|			ТОГДА Документы.БанковскийСчет.КоррСчетБанка
	|		ИНАЧЕ КлассификаторБанков.КоррСчет
	|	КОНЕЦ КАК КоррСчетБанка,
	|	ВЫБОР
	|		КОГДА Документы.БанковскийСчет.РучноеИзменениеРеквизитовБанка
	|			ТОГДА Документы.БанковскийСчет.ГородБанка
	|		ИНАЧЕ КлассификаторБанков.Город
	|	КОНЕЦ КАК ГородБанка,
	|	ВЫБОР
	|		КОГДА Документы.БанковскийСчет.РучноеИзменениеРеквизитовБанкаДляРасчетов
	|			ТОГДА Документы.БанковскийСчет.БИКБанкаДляРасчетов
	|		ИНАЧЕ КлассификаторБанковКорреспондентовРФ.Код
	|	КОНЕЦ КАК БИКБанкаДляРасчетов,
	|	ВЫБОР
	|		КОГДА Документы.БанковскийСчет.РучноеИзменениеРеквизитовБанкаДляРасчетов
	|			ТОГДА Документы.БанковскийСчет.НаименованиеБанкаДляРасчетов
	|		ИНАЧЕ КлассификаторБанковКорреспондентовРФ.Наименование
	|	КОНЕЦ КАК НаименованиеБанкаДляРасчетов,
	|	ВЫБОР
	|		КОГДА Документы.БанковскийСчет.РучноеИзменениеРеквизитовБанкаДляРасчетов
	|			ТОГДА Документы.БанковскийСчет.КоррСчетБанкаДляРасчетов
	|		ИНАЧЕ КлассификаторБанковКорреспондентовРФ.КоррСчет
	|	КОНЕЦ КАК КоррСчетБанкаДляРасчетов,
	|	ВЫБОР
	|		КОГДА Документы.БанковскийСчет.РучноеИзменениеРеквизитовБанкаДляРасчетов
	|			ТОГДА Документы.БанковскийСчет.ГородБанкаДляРасчетов
	|		ИНАЧЕ КлассификаторБанковКорреспондентовРФ.Город
	|	КОНЕЦ КАК ГородБанкаДляРасчетов,
	|	ВЫБОР
	|		КОГДА Документы.БанковскийСчет.РучноеИзменениеРеквизитовБанкаДляРасчетов
	|			ТОГДА Документы.БанковскийСчет.ГородБанкаМеждународный
	|		ИНАЧЕ КлассификаторБанков.ГородМеждународный
	|	КОНЕЦ КАК ГородБанкаМеждународный,
	|	ВЫБОР
	|		КОГДА Документы.БанковскийСчет.РучноеИзменениеРеквизитовБанкаДляРасчетов
	|			ТОГДА Документы.БанковскийСчет.СтранаБанка
	|		ИНАЧЕ КлассификаторБанков.Страна
	|	КОНЕЦ КАК СтранаБанка,
	|	ВЫБОР
	|		КОГДА Документы.БанковскийСчет.РучноеИзменениеРеквизитовБанкаДляРасчетов
	|			ТОГДА Документы.БанковскийСчет.ГородБанкаДляРасчетовМеждународный
	|		ИНАЧЕ КлассификаторБанковКорреспондентовРФ.ГородМеждународный
	|	КОНЕЦ КАК ГородБанкаДляРасчетовМеждународный,
	|	ВЫБОР
	|		КОГДА Документы.БанковскийСчет.РучноеИзменениеРеквизитовБанкаДляРасчетов
	|			ТОГДА Документы.БанковскийСчет.СтранаБанкаДляРасчетов
	|		ИНАЧЕ КлассификаторБанковКорреспондентовРФ.Страна
	|	КОНЕЦ КАК СтранаБанкаДляРасчетов,
	|	ВЫБОР
	|		КОГДА Документы.БанковскийСчет.РучноеИзменениеРеквизитовБанка
	|			ТОГДА """"
	|		ИНАЧЕ ЕСТЬNULL(КлассификаторБанков.БИКРКЦ.Наименование, """")
	|	КОНЕЦ КАК НаименованиеРКЦБанка,
	|	ВЫБОР
	|		КОГДА Документы.БанковскийСчет.РучноеИзменениеРеквизитовБанкаДляРасчетов
	|			ТОГДА """"
	|		ИНАЧЕ ЕСТЬNULL(КлассификаторБанковКорреспондентовРФ.БИКРКЦ.Наименование, """")
	|	КОНЕЦ КАК НаименованиеРКЦБанкаДляРасчетов,
	|	Документы.БанковскийСчет.ТекстКорреспондента КАК БанковскийСчетТекстКорреспондента,
	|	ВЫБОР
	|		КОГДА Документы.ДокументОснование ССЫЛКА Документ.ОтчетКомитенту
	|			ТОГДА ИСТИНА
	|		КОГДА Документы.ДокументОснование ССЫЛКА Документ.ОтчетКомиссионера
	|			ТОГДА ИСТИНА
	|		КОГДА Документы.ДокументОснование ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ Документы.ДокументОснование.ЦенаВключаетНДС
	|	КОНЕЦ КАК ЦенаВключаетНДС,
	|	Документы.ДокументОснование.СуммаДокумента КАК СуммаКВозврату,
	|	ВЫБОР
	|		КОГДА Документы.ДокументОснование.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК УчитыватьНДС,
	|	Документы.ДокументОснование.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДСУПокупателя) КАК ОперацияОблагаетсяНДСУПокупателя,
	|	Документы.Валюта КАК Валюта,
	|	Документы.Менеджер.ФизическоеЛицо КАК Менеджер,
	|	Документы.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
	|	Документы.ЧастичнаяОплата КАК ЧастичнаяОплата,
	|	Документы.НазначениеПлатежа КАК НазначениеПлатежа,
	|	ВЫБОР КОГДА Документы.ДокументОснование ССЫЛКА Документ.ОтчетКомитенту
	|				И Документы.ДокументОснование.СуммаВознаграждения = 0 ТОГДА
	|		0
	|	КОГДА Документы.ДокументОснование ССЫЛКА Документ.ОтчетКомитенту ТОГДА // СуммаВознаграждения <> 0
	|		Документы.СуммаДокумента * 100 / Документы.ДокументОснование.СуммаВознаграждения
	|	КОГДА Документы.ДокументОснование.СуммаДокумента = 0 ТОГДА
	|		0
	|	КОГДА Документы.ДокументОснование ССЫЛКА Справочник.ДоговорыКонтрагентов ТОГДА
	|		100
	|	КОГДА (Документы.ДокументОснование ССЫЛКА Документ.ЗаказКлиента
	|				ИЛИ Документы.ДокументОснование ССЫЛКА Документ.ЗаявкаНаВозвратТоваровОтКлиента)
	|				И Документы.ДокументОснование.ТребуетсяЗалогЗаТару ТОГДА
	|		Документы.СуммаДокумента * 100 / (Документы.ДокументОснование.СуммаДокумента + Документы.ДокументОснование.СуммаВозвратнойТары)
	|	КОГДА Документы.ДокументОснование ССЫЛКА Документ.ОтчетКомитентуОЗакупках ТОГДА
	|		Документы.СуммаДокумента * 100 / (Документы.ДокументОснование.СуммаДокумента + Документы.ДокументОснование.СуммаВознаграждения)
	|	ИНАЧЕ
	|		Документы.СуммаДокумента * 100 / Документы.ДокументОснование.СуммаДокумента
	|	КОНЕЦ КАК ПроцентОплаты,
	|	Документы.СуммаДокумента КАК СуммаДокумента,
	|	Неопределено КАК Грузоотправитель, 
	#Удаление
	|	Неопределено КАК Грузополучатель,
	#КонецУдаления
	|	Документы.ИдентификаторПлатежа КАК ИдентификаторПлатежа,
	|	ВЫБОР
	|		КОГДА ЗаявкаНаВозвратТоваровОтКлиента.Ссылка ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК СчетКВозврату,
	|	ВЫБОР
	|		КОГДА Документы.ДокументОснование ССЫЛКА Справочник.ДоговорыКонтрагентов 
	|			ТОГДА Документы.ДокументОснование.СтавкаНДС
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СтавкаНДС,
	|	ВЫБОР
	|		КОГДА Документы.ДокументОснование ССЫЛКА Справочник.ДоговорыКонтрагентов 
	|			ТОГДА (ВЫРАЗИТЬ(Документы.СуммаДокумента * (Документы.ДокументОснование.СтавкаНДС.Ставка / 100) / ((Документы.ДокументОснование.СтавкаНДС.Ставка + 100) / 100) КАК ЧИСЛО(31, 2)))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаНДС 
	#Вставка
	|	,
	|	ЗаказКлиента.Грузополучатель КАК Грузополучатель,
	|	Документы.ФормаОплаты КАК ФормаОплаты,
	|	ЕСТЬNULL(ЗаказКлиента.НеОтгружатьЧастями, ЛОЖЬ) КАК НеОтгружатьЧастями,
	|	ЗаказКлиента.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ЗаказКлиента.СпособДоставки КАК СпособДоставки,
	|	ЗаказКлиента.АдресДоставки КАК АдресДоставки,
	|	ЗаказКлиента.КАНАТ_ПлатитЗаДоставку КАК ПлатитЗаДоставку,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ДоговорСУчастникомГОЗ, ЛОЖЬ) КАК ДоговорСУчастникомГОЗ,
	|	ЗаказКлиента.Соглашение КАК Соглашение,
	|	СоглашенияСКлиентами.Типовое КАК СоглашениеТиповое,
	|	ЕСТЬNULL(СоглашенияСКлиентами.КАНАТ_ВыводитьСкидки, ЛОЖЬ) КАК ВыводитьСкидки
	#КонецВставки
	|ИЗ
	|	Документ.СчетНаОплатуКлиенту КАК Документы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаВозвратТоваровОтКлиента КАК ЗаявкаНаВозвратТоваровОтКлиента
	|		ПО Документы.ДокументОснование = ЗаявкаНаВозвратТоваровОтКлиента.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтветственныеЛица КАК ТаблицаОтветственныеЛица
	|		ПО Документы.Ссылка = ТаблицаОтветственныеЛица.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторБанков КАК КлассификаторБанков
	|		ПО Документы.БанковскийСчет.Банк = КлассификаторБанков.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторБанков КАК КлассификаторБанковКорреспондентовРФ
	|		ПО Документы.БанковскийСчет.БанкДляРасчетов = КлассификаторБанковКорреспондентовРФ.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Константы
	|		ПО ИСТИНА  
	#Вставка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ПО Документы.ДокументОснование = ЗаказКлиента.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО Документы.Договор = ДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами КАК СоглашенияСКлиентами
	|		ПО ЗаказКлиента.Соглашение = СоглашенияСКлиентами.Ссылка
    #КонецВставки
	|ГДЕ
	|	Документы.Ссылка В
	|			(ВЫБРАТЬ
	|				ТаблицаДокументов.Ссылка
	|			ИЗ
	|				ТаблицаДокументов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Документы.МоментВремени
	|;
	|  
	#Вставка
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыФизическихЛицСрезПоследних.Физлицо КАК Физлицо,
	|	МАКСИМУМ(ДокументыФизическихЛицСрезПоследних.Период) КАК Период,
	|	Контрагенты.ЮрФизЛицо КАК ЮрФизЛицо,
	|	Документы.Ссылка
	|ПОМЕСТИТЬ ВтДокументУдостоверяющийЛичность
	|ИЗ 
	|	Документ.СчетНаОплатуКлиенту КАК Документы
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
	|	ПО Документы.ДокументОснование = ЗаказКлиента.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|	ПО ЗаказКлиента.Контрагент = Контрагенты.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних(
	|			,
	|			ЯвляетсяДокументомУдостоверяющимЛичность) КАК ДокументыФизическихЛицСрезПоследних
	|	ПО Контрагенты.Ссылка = ДокументыФизическихЛицСрезПоследних.Физлицо
	|ГДЕ
	|	Документы.Ссылка В
	|			(ВЫБРАТЬ
	|				ТаблицаДокументов.Ссылка
	|			ИЗ
	|				ТаблицаДокументов)
    |
	|СГРУППИРОВАТЬ ПО
	|	ДокументыФизическихЛицСрезПоследних.Физлицо,
	|	Контрагенты.ЮрФизЛицо,
	|	Документы.Ссылка
	|;
    |

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыФизическихЛицСрезПоследних.Представление КАК Представление,
	|	Вт.ЮрФизЛицо КАК ЮрФизЛицо,
	|	Вт.Ссылка КАК Ссылка
	|ИЗ
	|	ВтДокументУдостоверяющийЛичность КАК Вт
	|		ПРАВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних(
	|				,
	|				ЯвляетсяДокументомУдостоверяющимЛичность) КАК ДокументыФизическихЛицСрезПоследних
	|		ПО (Вт.Физлицо = ДокументыФизическихЛицСрезПоследних.Физлицо
	|				И Вт.Период = ДокументыФизическихЛицСрезПоследних.Период)
	|;
	#КонецВставки
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЭтапыГрафикаОплаты.Ссылка КАК Ссылка,
	|	ЭтапыГрафикаОплаты.НомерСтроки КАК НомерСтроки,
	|	ЭтапыГрафикаОплаты.ДатаПлатежа КАК ДатаПлатежа,
	|	ЭтапыГрафикаОплаты.ПроцентПлатежа КАК ПроцентПлатежа,
	|	ЭтапыГрафикаОплаты.СуммаПлатежа КАК СуммаПлатежа,
	|	ЭтапыГрафикаОплаты.ЭтоЗалогЗаТару КАК ЭтоЗалогЗаТару
	|ИЗ
	|	Документ.СчетНаОплатуКлиенту.ЭтапыГрафикаОплаты КАК ЭтапыГрафикаОплаты
	|ГДЕ
	|	ЭтапыГрафикаОплаты.Ссылка В
	|			(ВЫБРАТЬ
	|				ТаблицаДокументов.Ссылка
	|			ИЗ
	|				ТаблицаДокументов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.ДокументОснование.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	Товары.НоменклатураНабора,
	|	Товары.ХарактеристикаНабора,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Упаковка КАК Упаковка,
	|	Товары.Количество КАК Количество,
	|	Товары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА &ОтображатьСкидки ТОГДА
	|			Товары.Цена
	|		ИНАЧЕ Товары.Сумма/Товары.КоличествоУпаковок 
	|	КОНЕЦ КАК Цена,
	|	Товары.Сумма КАК Сумма,
	|	Товары.СтавкаНДС КАК СтавкаНДС,
	|	Товары.СуммаНДС КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА &ОтображатьСкидки ТОГДА
	|			Товары.СуммаРучнойСкидки + Товары.СуммаАвтоматическойСкидки
	|		ИНАЧЕ 0 
	|	КОНЕЦ КАК СуммаСкидки,
	|	Товары.Сумма + Товары.СуммаРучнойСкидки + Товары.СуммаАвтоматическойСкидки КАК СуммаБезСкидки,
	|	ВЫБОР
	|		КОГДА
	|			Товары.Ссылка.ВернутьМногооборотнуюТару
	|			И Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|		ТОГДА
	|			ИСТИНА
	|		ИНАЧЕ
	|			ЛОЖЬ
	|	КОНЕЦ КАК ЭтоВозвратнаяТара,
	|	Товары.Содержание КАК Содержание
	|ПОМЕСТИТЬ ТоварыПодготовка
	|ИЗ
	|	ТаблицаДокументов КАК ТаблицаДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК Товары
	|		ПО ТаблицаДокументов.ДокументОснование = Товары.Ссылка
	|			И (Товары.Отменено = ЛОЖЬ)
	|			И (Товары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|				ИЛИ Товары.Ссылка.ТребуетсяЗалогЗаТару
	|				ИЛИ НЕ Товары.Ссылка.ВернутьМногооборотнуюТару)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	//++ НЕ УТКА

	//++ Устарело_Переработка24
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	Неопределено КАК ХозяйственнаяОперация,
	|	1 КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
	|	Заказ.Номенклатура КАК Номенклатура,
	|	Заказ.Характеристика КАК Характеристика,
	|	NULL КАК Упаковка,
	|	1 КАК Количество,
	|	1 КАК КоличествоУпаковок,
	|	СУММА(Товары.Сумма) КАК Цена,
	|	СУММА(Товары.Сумма) КАК Сумма,
	|	Заказ.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(Товары.СуммаНДС) КАК СуммаНДС,
	|	0 КАК СуммаСкидки,
	|	СУММА(Товары.Сумма) КАК СуммаБезСкидки,
	|	Ложь,
	|	МАКСИМУМ(Заказ.Содержание) КАК Содержание
	|ИЗ
	|	ТаблицаДокументов КАК ТаблицаДокументов
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ЗаказДавальца КАК Заказ
	|	ПО
	|		ТаблицаДокументов.ДокументОснование = Заказ.Ссылка
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ЗаказДавальца.Продукция КАК Товары
	|	ПО
	|		ТаблицаДокументов.ДокументОснование = Товары.Ссылка
	|		И (Товары.Отменено = ЛОЖЬ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокументов.Ссылка,
	|	Заказ.Номенклатура,
	|	Заказ.СтавкаНДС,
	|	Заказ.Характеристика
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	//-- Устарело_Переработка24
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка                                     КАК Ссылка,
	|	НЕОПРЕДЕЛЕНО                                                 КАК ХозяйственнаяОперация,
	|	Товары.НомерСтроки                                           КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)               КАК НоменклатураНабора,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК ХарактеристикаНабора,
	|	Товары.Номенклатура                                          КАК Номенклатура,
	|	Товары.Характеристика                                        КАК Характеристика,
	|	Товары.Упаковка                                              КАК Упаковка,
	|	Товары.Количество                                            КАК Количество,
	|	Товары.КоличествоУпаковок                                    КАК КоличествоУпаковок,
	|	Товары.Цена                                                  КАК Цена,
	|	Товары.Сумма                                                 КАК Сумма,
	|	Заказ.СтавкаНДС                                              КАК СтавкаНДС,
	|	Товары.СуммаНДС                                              КАК СуммаНДС,
	|	0                                                            КАК СуммаСкидки,
	|	Товары.СуммаСНДС - Товары.СуммаНДС                           КАК СуммаБезСкидки,
	|	ЛОЖЬ                                                         КАК ЭтоВозвратнаяТара,
	|	Заказ.УслугаПоПереработке                                    КАК Содержание
	|ИЗ
	|	ТаблицаДокументов КАК ТаблицаДокументов
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказДавальца2_5 КАК Заказ
	|		ПО ТаблицаДокументов.ДокументОснование = Заказ.Ссылка
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказДавальца2_5.Продукция КАК Товары
	|		ПО ТаблицаДокументов.ДокументОснование = Товары.Ссылка
	|		 И НЕ Товары.Отменено
	//++ Устарело_Переработка24
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	Неопределено КАК ХозяйственнаяОперация,
	|	1 КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
	|	Отчет.Номенклатура КАК Номенклатура,
	|	Отчет.Характеристика КАК Характеристика,
	|	NULL КАК Упаковка,
	|	1 КАК Количество,
	|	1 КАК КоличествоУпаковок,
	|	СУММА(Товары.Сумма) КАК Цена,
	|	СУММА(Товары.Сумма) КАК Сумма,
	|	Отчет.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(Товары.СуммаНДС) КАК СуммаНДС,
	|	0 КАК СуммаСкидки,
	|	СУММА(Товары.Сумма) КАК СуммаБезСкидки,
	|	Ложь,
	|	МАКСИМУМ(Отчет.Содержание) КАК Содержание
	|ИЗ
	|	ТаблицаДокументов КАК ТаблицаДокументов
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ОтчетДавальцу КАК Отчет
	|	ПО
	|		ТаблицаДокументов.ДокументОснование = Отчет.Ссылка
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ОтчетДавальцу.Продукция КАК Товары
	|	ПО
	|		ТаблицаДокументов.ДокументОснование = Товары.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокументов.Ссылка,
	|	Отчет.Номенклатура,
	|	Отчет.СтавкаНДС,
	|	Отчет.Характеристика
	//-- Устарело_Переработка24
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка                                     КАК Ссылка,
	|	НЕОПРЕДЕЛЕНО                                                 КАК ХозяйственнаяОперация,
	|	Товары.НомерСтроки                                           КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)               КАК НоменклатураНабора,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК ХарактеристикаНабора,
	|	Товары.Номенклатура                                          КАК Номенклатура,
	|	Товары.Характеристика                                        КАК Характеристика,
	|	Товары.Упаковка                                              КАК Упаковка,
	|	Товары.Количество                                            КАК Количество,
	|	Товары.КоличествоУпаковок                                    КАК КоличествоУпаковок,
	|	Товары.Цена                                                  КАК Цена,
	|	Товары.Сумма                                                 КАК Сумма,
	|	Отчет.СтавкаНДС                                              КАК СтавкаНДС,
	|	Товары.СуммаНДС                                              КАК СуммаНДС,
	|	0                                                            КАК СуммаСкидки,
	|	Товары.СуммаСНДС - Товары.СуммаНДС                           КАК СуммаБезСкидки,
	|	ЛОЖЬ                                                         КАК ЭтоВозвратнаяТара,
	|	Отчет.УслугаПоПереработке                                    КАК Содержание
	|ИЗ
	|	ТаблицаДокументов КАК ТаблицаДокументов
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетДавальцу2_5 КАК Отчет
	|		ПО ТаблицаДокументов.ДокументОснование = Отчет.Ссылка
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетДавальцу2_5.Продукция КАК Товары
	|		ПО ТаблицаДокументов.ДокументОснование = Товары.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	//-- НЕ УТКА
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка,
	|	ТаблицаДокументов.ДокументОснование.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	Товары.НомерСтроки,
	|	Товары.НоменклатураНабора,
	|	Товары.ХарактеристикаНабора,
	|	Товары.Номенклатура,
	|	Товары.Характеристика,
	|	Товары.Упаковка,
	|	Товары.Количество,
	|	Товары.КоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА &ОтображатьСкидки ТОГДА
	|			Товары.Цена
	|		ИНАЧЕ Товары.Сумма/Товары.КоличествоУпаковок 
	|	КОНЕЦ,
	|	Товары.Сумма,
	|	Товары.СтавкаНДС,
	|	Товары.СуммаНДС,
	|	ВЫБОР
	|		КОГДА &ОтображатьСкидки ТОГДА
	|			Товары.СуммаРучнойСкидки + Товары.СуммаАвтоматическойСкидки
	|		ИНАЧЕ 0 
	|	КОНЕЦ,
	|	Товары.Сумма + Товары.СуммаРучнойСкидки + Товары.СуммаАвтоматическойСкидки,
	|	ВЫБОР
	|		КОГДА
	|			Товары.Ссылка.ВернутьМногооборотнуюТару
	|			И Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|		ТОГДА
	|			ИСТИНА
	|		ИНАЧЕ
	|			ЛОЖЬ
	|	КОНЕЦ КАК ЭтоВозвратнаяТара,
	|	Товары.Содержание
	|ИЗ
	|	ТаблицаДокументов КАК ТаблицаДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаВозвратТоваровОтКлиента.ЗаменяющиеТовары КАК Товары
	|		ПО ТаблицаДокументов.ДокументОснование = Товары.Ссылка
	|			И (Товары.Отменено = ЛОЖЬ)
	|			И (Товары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|				ИЛИ Товары.Ссылка.ТребуетсяЗалогЗаТару
	|				ИЛИ НЕ Товары.Ссылка.ВернутьМногооборотнуюТару)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка,
	|	ТаблицаДокументов.ДокументОснование.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	Товары.НомерСтроки,
	|	Товары.НоменклатураНабора,
	|	Товары.ХарактеристикаНабора,
	|	Товары.Номенклатура,
	|	Товары.Характеристика,
	|	Товары.Упаковка,
	|	Товары.Количество,
	|	Товары.КоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА &ОтображатьСкидки ТОГДА
	|			Товары.Цена
	|		ИНАЧЕ Товары.Сумма/Товары.КоличествоУпаковок 
	|	КОНЕЦ,
	|	Товары.Сумма,
	|	Товары.СтавкаНДС,
	|	Товары.СуммаНДС,
	|	ВЫБОР
	|		КОГДА &ОтображатьСкидки ТОГДА
	|			Товары.СуммаРучнойСкидки + Товары.СуммаАвтоматическойСкидки
	|		ИНАЧЕ 0 
	|	КОНЕЦ,
	|	Товары.Сумма + Товары.СуммаРучнойСкидки + Товары.СуммаАвтоматическойСкидки,
	|	ВЫБОР
	|		КОГДА
	|			Товары.Ссылка.ВернутьМногооборотнуюТару
	|			И Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|		ТОГДА
	|			ИСТИНА
	|		ИНАЧЕ
	|			ЛОЖЬ
	|	КОНЕЦ КАК ЭтоВозвратнаяТара,
	|	NULL
	|ИЗ
	|	ТаблицаДокументов КАК ТаблицаДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК Товары
	|		ПО ТаблицаДокументов.ДокументОснование = Товары.Ссылка
	|			И (Товары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|				ИЛИ Товары.Ссылка.ТребуетсяЗалогЗаТару
	|				ИЛИ НЕ Товары.Ссылка.ВернутьМногооборотнуюТару)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка,
	|	Неопределено КАК ХозяйственнаяОперация,
	|	Товары.НомерСтроки,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
	|	Товары.Номенклатура,
	|	Товары.Характеристика,
	|	Товары.Упаковка,
	|	Товары.Количество,
	|	Товары.КоличествоУпаковок,
	|	Товары.Цена,
	|	Товары.Сумма,
	|	Товары.СтавкаНДС,
	|	Товары.СуммаНДС,
	|	0,
	|	0,
	|	Ложь,
	|	NULL
	|ИЗ
	|	ТаблицаДокументов КАК ТаблицаДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВыкупВозвратнойТарыКлиентом.Товары КАК Товары
	|		ПО ТаблицаДокументов.ДокументОснование = Товары.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка,
	|	ТаблицаДокументов.ДокументОснование.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	Услуги.НомерСтроки,
	|	Услуги.НоменклатураНабора,
	|	Услуги.ХарактеристикаНабора,
	|	Услуги.Номенклатура,
	|	Услуги.Характеристика,
	|	NULL,
	|	Услуги.Количество,
	|	Услуги.Количество,
	|	ВЫБОР
	|		КОГДА &ОтображатьСкидки ТОГДА
	|			Услуги.Цена
	|		ИНАЧЕ Услуги.Сумма/Услуги.Количество 
	|	КОНЕЦ,
	|	Услуги.Сумма,
	|	Услуги.СтавкаНДС,
	|	Услуги.СуммаНДС,
	|	ВЫБОР
	|		КОГДА &ОтображатьСкидки ТОГДА
	|			Услуги.СуммаРучнойСкидки + Услуги.СуммаАвтоматическойСкидки
	|		ИНАЧЕ 0 
	|	КОНЕЦ,
	|	Услуги.Сумма + Услуги.СуммаРучнойСкидки + Услуги.СуммаАвтоматическойСкидки,
	|	Ложь,
	|	Услуги.Содержание
	|ИЗ
	|	ТаблицаДокументов КАК ТаблицаДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АктВыполненныхРабот.Услуги КАК Услуги
	|		ПО ТаблицаДокументов.ДокументОснование = Услуги.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка,
	|	Неопределено КАК ХозяйственнаяОперация,
	|	1,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
	|	Основание.Услуга,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
	|	NULL,
	|	1,
	|	1,
	|	Основание.СуммаВознаграждения,
	|	Основание.СуммаВознаграждения,
	|	Основание.СтавкаНДСВознаграждения,
	|	Основание.СуммаНДСВознаграждения,
	|	0,
	|	Основание.СуммаВознаграждения,
	|	Ложь,
	|	NULL
	|ИЗ
	|	ТаблицаДокументов КАК ТаблицаДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомитенту КАК Основание
	|		ПО ТаблицаДокументов.ДокументОснование = Основание.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка,
	|	Неопределено КАК ХозяйственнаяОперация,
	|	Товары.НомерСтроки,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
	|	Товары.Номенклатура,
	|	Товары.Характеристика,
	|	Товары.Упаковка,
	|	Товары.Количество,
	|	Товары.КоличествоУпаковок,
	|	Товары.ЦенаПродажи,
	|	Товары.СуммаПродажи,
	|	Товары.СтавкаНДС,
	|	Товары.СуммаПродажиНДС,
	|	0,
	|	Товары.СуммаПродажи,
	|	Ложь,
	|	NULL
	|ИЗ
	|	ТаблицаДокументов КАК ТаблицаДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионера.Товары КАК Товары
	|		ПО ТаблицаДокументов.ДокументОснование = Товары.Ссылка
	|ГДЕ
	|	Товары.Количество <> 0
	|	И Товары.СуммаПродажи <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка,
	|	Неопределено КАК ХозяйственнаяОперация,
	|	Товары.НомерСтроки,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
	|	Товары.Номенклатура,
	|	Товары.Характеристика,
	|	Товары.Упаковка,
	|	Товары.Количество,
	|	Товары.КоличествоУпаковок,
	|	Товары.Цена,
	|	Товары.Сумма,
	|	Товары.СтавкаНДС,
	|	Товары.СуммаНДС,
	|	0,
	|	Товары.Сумма,
	|	Ложь,
	|	NULL
	|ИЗ
	|	ТаблицаДокументов КАК ТаблицаДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионераОСписании.Товары КАК Товары
	|		ПО ТаблицаДокументов.ДокументОснование = Товары.Ссылка
	|
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка,
	|	Неопределено КАК ХозяйственнаяОперация,
	|	Товары.НомерСтроки,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
	|	Товары.Номенклатура,
	|	Товары.Характеристика,
	|	Товары.Упаковка,
	|	Товары.Количество,
	|	Товары.КоличествоУпаковок,
	|	Товары.Цена,
	|	Товары.Сумма,
	|	Товары.СтавкаНДС,
	|	Товары.СуммаНДС,
	|	0,
	|	0,
	|	Ложь,
	|	NULL
	|ИЗ
	|	ТаблицаДокументов КАК ТаблицаДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВыкупТоваровХранителем.Товары КАК Товары
	|		ПО ТаблицаДокументов.ДокументОснование = Товары.Ссылка
	|
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка,
	|	Неопределено КАК ХозяйственнаяОперация,
	|	Товары.НомерСтроки,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
	|	Товары.Номенклатура,
	|	Товары.Характеристика,
	|	Товары.Упаковка,
	|	Товары.Количество,
	|	Товары.КоличествоУпаковок,
	|	Товары.Цена,
	|	Товары.Сумма,
	|	Товары.СтавкаНДС,
	|	Товары.СуммаНДС,
	|	0,
	|	0,
	|	Ложь,
	|	NULL
	|ИЗ
	|	ТаблицаДокументов КАК ТаблицаДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОЗакупках.Товары КАК Товары
	|		ПО ТаблицаДокументов.ДокументОснование = Товары.Ссылка
	|ОБЪЕДИНИТЬ ВСЕ
	|

	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка,
	|	Неопределено КАК ХозяйственнаяОперация,
	|	1,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
	|	Основание.Услуга,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
	|	NULL,
	|	1,
	|	1,
	|	Основание.СуммаВознаграждения-Основание.СуммаНДСВознаграждения,
	|	Основание.СуммаВознаграждения-Основание.СуммаНДСВознаграждения,
	|	Основание.СтавкаНДСВознаграждения,
	|	Основание.СуммаНДСВознаграждения,
	|	0,
	|	Основание.СуммаВознаграждения,
	|	Ложь,
	|	NULL
	|ИЗ
	|	ТаблицаДокументов КАК ТаблицаДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОЗакупках КАК Основание
	|		ПО ТаблицаДокументов.ДокументОснование = Основание.Ссылка
	|	ГДЕ
	|	Основание.СпособРасчетаВознаграждения <> ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаКомиссионногоВознаграждения.НеРассчитывается)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица.Ссылка КАК Ссылка,
	|	Таблица.ХозяйственнаяОперация,
	|	
	|	ВариантыКомплектацииНоменклатуры.Ссылка КАК ВариантКомплектацииНоменклатуры,
	|	ВариантыКомплектацииНоменклатуры.ВариантПредставленияНабораВПечатныхФормах КАК ВариантПредставленияНабораВПечатныхФормах,
	|	ВариантыКомплектацииНоменклатуры.ВариантРасчетаЦеныНабора КАК ВариантРасчетаЦеныНабора,
	|	Таблица.НоменклатураНабора   КАК НоменклатураНабора,
	|	Таблица.ХарактеристикаНабора КАК ХарактеристикаНабора,
	|	
	|	Таблица.НомерСтроки КАК НомерСтроки,
	|	Таблица.Номенклатура КАК Номенклатура,
	|	Таблица.Характеристика КАК Характеристика,
	|	Таблица.Упаковка КАК Упаковка,
	|	Таблица.Количество КАК Количество,
	|	Таблица.КоличествоУпаковок КАК КоличествоУпаковок,
	|	Таблица.Цена,
	|	Таблица.Сумма КАК Сумма,
	|	Таблица.СтавкаНДС,
	|	Таблица.СуммаНДС,
	|	Таблица.СуммаСкидки,
	|	Таблица.СуммаБезСкидки,
	|	Таблица.ЭтоВозвратнаяТара КАК ЭтоВозвратнаяТара,
	|	Таблица.Содержание КАК Содержание
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	ТоварыПодготовка КАК Таблица
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
	|		ПО ВариантыКомплектацииНоменклатуры.Владелец = Таблица.НоменклатураНабора
	|		И ВариантыКомплектацииНоменклатуры.Характеристика = Таблица.ХарактеристикаНабора
	|		И ВариантыКомплектацииНоменклатуры.Основной
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица.Ссылка                 КАК Ссылка,
	|	Таблица.ХозяйственнаяОперация,
	|	Таблица.НоменклатураНабора     КАК НоменклатураНабора,
	|	Таблица.ХарактеристикаНабора   КАК ХарактеристикаНабора,
	|	МИНИМУМ(Таблица.НомерСтроки)   КАК НомерСтроки,
	|	СУММА(Таблица.Сумма)           КАК Сумма,
	|	СУММА(Таблица.СуммаНДС)        КАК СуммаНДС,
	|	СУММА(Таблица.СуммаСкидки)     КАК СуммаСкидки,
	|	СУММА(Таблица.СуммаБезСкидки)  КАК СуммаБезСкидки
	|ПОМЕСТИТЬ ВременнаяТаблицаНаборыПодготовка
	|ИЗ
	|	Товары КАК Таблица
	|
	|ГДЕ
	|	Таблица.НоменклатураНабора <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	Таблица.Ссылка,
	|	Таблица.ХозяйственнаяОперация,
	|	Таблица.НоменклатураНабора,
	|	Таблица.ХарактеристикаНабора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаТоваров.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ТоварыРазличные
	|ИЗ
	|	Товары КАК ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Ссылка                                    КАК Ссылка,
	|	Товары.ВариантКомплектацииНоменклатуры           КАК ВариантКомплектацииНоменклатуры,
	|	Товары.ВариантПредставленияНабораВПечатныхФормах КАК ВариантПредставленияНабораВПечатныхФормах,
	|	Товары.ВариантРасчетаЦеныНабора                  КАК ВариантРасчетаЦеныНабора,
	|	Товары.НоменклатураНабора,
	|	Товары.ХарактеристикаНабора,
	|	Товары.Номенклатура,
	|	Товары.Характеристика,
	|	ВЫБОР КОГДА Товары.ВариантКомплектацииНоменклатуры.НоменклатураОсновногоКомпонента = Товары.Номенклатура
	|		И Товары.ВариантКомплектацииНоменклатуры.ХарактеристикаОсновногоКомпонента = Товары.Характеристика ТОГДА
	|		ИСТИНА
	|	ИНАЧЕ
	|		ЛОЖЬ
	|	КОНЕЦ КАК ОсновнаяКомплектующая,
	|	Товары.СтавкаНДС КАК СтавкаНДС,
	|	0 КАК КоличествоПоУмолчанию,
	|	Товары.Количество КАК Количество
	|ПОМЕСТИТЬ ВременнаяТаблицаНаборыДополнительноЧастьПервая
	|ИЗ
	|	Товары КАК Товары
	|
	|ГДЕ
	|	Товары.НоменклатураНабора <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыРазличные.Ссылка                                                                  КАК Ссылка,
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка                                           КАК ВариантКомплектацииНоменклатуры,
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.ВариантПредставленияНабораВПечатныхФормах КАК ВариантПредставленияНабораВПечатныхФормах,
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.ВариантРасчетаЦеныНабора                  КАК ВариантРасчетаЦеныНабора,
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец                                  КАК НоменклатураНабора,
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Характеристика                            КАК ХарактеристикаНабора,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура   КАК Номенклатура,
	|	ВариантыКомплектацииНоменклатурыТовары.Характеристика КАК Характеристика,
	|	ЛОЖЬ КАК ОсновнаяКомплектующая,
	|	NULL КАК СтавкаНДС,
	|	СУММА(ВариантыКомплектацииНоменклатурыТовары.Количество) КАК КоличествоПоУмолчанию,
	|	0 КАК Количество
	|ИЗ
	|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыРазличные КАК ТоварыРазличные
	|		ПО ИСТИНА
	|ГДЕ
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка В (ВЫБРАТЬ РАЗЛИЧНЫЕ Т.ВариантКомплектацииНоменклатуры ИЗ Товары КАК Т)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыРазличные.Ссылка,
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка,
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец,
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Характеристика,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура,
	|	ВариантыКомплектацииНоменклатурыТовары.Характеристика,
	|	ВариантыКомплектацииНоменклатурыТовары.Упаковка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица.Ссылка,
	|	Таблица.ВариантКомплектацииНоменклатуры,
	|	Таблица.ВариантРасчетаЦеныНабора,
	|	Таблица.ВариантПредставленияНабораВПечатныхФормах,
	|	Таблица.НоменклатураНабора,
	|	Таблица.ХарактеристикаНабора,
	|	Таблица.Номенклатура,
	|	Таблица.Характеристика,
	|	МАКСИМУМ(Таблица.СтавкаНДС) КАК СтавкаНДС,
	|	МАКСИМУМ(Таблица.ОсновнаяКомплектующая) КАК ОсновнаяКомплектующая,
	|	СУММА(Таблица.КоличествоПоУмолчанию) КАК КоличествоПоУмолчанию,
	|	СУММА(Таблица.Количество) КАК Количество
	|ПОМЕСТИТЬ ВременнаяТаблицаНаборыДополнительноЧастьВторая
	|ИЗ
	|	ВременнаяТаблицаНаборыДополнительноЧастьПервая КАК Таблица
	|
	|СГРУППИРОВАТЬ ПО
	|	Таблица.Ссылка,
	|	Таблица.ВариантКомплектацииНоменклатуры,
	|	Таблица.ВариантРасчетаЦеныНабора,
	|	Таблица.ВариантПредставленияНабораВПечатныхФормах,
	|	Таблица.НоменклатураНабора,
	|	Таблица.ХарактеристикаНабора,
	|	Таблица.Номенклатура,
	|	Таблица.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Результат.Ссылка,
	|	Результат.ВариантКомплектацииНоменклатуры,
	|	Результат.ВариантРасчетаЦеныНабора,
	|	Результат.ВариантПредставленияНабораВПечатныхФормах,
	|	Результат.НоменклатураНабора,
	|	Результат.ХарактеристикаНабора,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА Результат.ОсновнаяКомплектующая
	|				ТОГДА Результат.СтавкаНДС
	|			ИНАЧЕ null
	|		КОНЕЦ) КАК СтавкаНДС,
	|	ВЫРАЗИТЬ(МИНИМУМ(ВЫБОР
	|			КОГДА Результат.КоличествоПоУмолчанию <> 0 И Результат.ОсновнаяКомплектующая
	|				ТОГДА Результат.Количество / Результат.КоличествоПоУмолчанию
	|			ИНАЧЕ null
	|		КОНЕЦ) + 0.5 КАК Число(10,0)) - 1 КАК Количество
	|ПОМЕСТИТЬ ВременнаяТаблицаНаборыДополнительно
	|ИЗ
	|	ВременнаяТаблицаНаборыДополнительноЧастьВторая КАК Результат
	|СГРУППИРОВАТЬ ПО
	|	Результат.Ссылка,
	|	Результат.ВариантКомплектацииНоменклатуры,
	|	Результат.ВариантРасчетаЦеныНабора,
	|	Результат.ВариантПредставленияНабораВПечатныхФормах,
	|	Результат.НоменклатураНабора,
	|	Результат.ХарактеристикаНабора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаНаборыДополнительно.ВариантКомплектацииНоменклатуры,
	|	
	|	ВЫБОР КОГДА Таблица.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию) ТОГДА
	|		ВЫБОР КОГДА ВременнаяТаблицаНаборыДополнительно.ВариантПредставленияНабораВПечатныхФормах = ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.ТолькоНабор) ТОГДА
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.НаборИКомплектующие)
	|		ИНАЧЕ
	|			ВременнаяТаблицаНаборыДополнительно.ВариантПредставленияНабораВПечатныхФормах
	|		КОНЕЦ
	|	ИНАЧЕ
	|		ВременнаяТаблицаНаборыДополнительно.ВариантПредставленияНабораВПечатныхФормах
	|	КОНЕЦ КАК ВариантПредставленияНабораВПечатныхФормах,
	|	
	|	ВЫБОР КОГДА Таблица.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию) ТОГДА
	|		ВЫБОР КОГДА
	|			ВЫБОР КОГДА ВременнаяТаблицаНаборыДополнительно.ВариантПредставленияНабораВПечатныхФормах = ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.ТолькоНабор) ТОГДА
	|				ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.НаборИКомплектующие)
	|			ИНАЧЕ
	|				ВременнаяТаблицаНаборыДополнительно.ВариантПредставленияНабораВПечатныхФормах
	|			КОНЕЦ = ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.НаборИКомплектующие)
	|			И ВременнаяТаблицаНаборыДополнительно.ВариантРасчетаЦеныНабора В (ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.ЦенаЗадаетсяЗаНаборРаспределяетсяПоЦенам),ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.ЦенаЗадаетсяЗаНаборРаспределяетсяПоДолям)) ТОГДА
	|				ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.РассчитываетсяИзЦенКомплектующих)
	|		ИНАЧЕ
	|			ВременнаяТаблицаНаборыДополнительно.ВариантРасчетаЦеныНабора
	|		КОНЕЦ
	|	ИНАЧЕ
	|		ВременнаяТаблицаНаборыДополнительно.ВариантРасчетаЦеныНабора
	|	КОНЕЦ КАК ВариантРасчетаЦеныНабора,
	|	
	|	Таблица.Ссылка                            КАК Ссылка,
	|	Таблица.ХозяйственнаяОперация,
	|	Таблица.НоменклатураНабора                КАК НоменклатураНабора,
	|	Таблица.ХарактеристикаНабора              КАК ХарактеристикаНабора,
	|	Таблица.НомерСтроки                       КАК НомерСтроки,
	|	ЕСТЬNULL(ВременнаяТаблицаНаборыДополнительно.Количество, 1) КАК КоличествоУпаковок,
	|	ЕСТЬNULL(ВременнаяТаблицаНаборыДополнительно.Количество, 1) КАК Количество,
	|	Таблица.Сумма                                 КАК Сумма,
	|	Таблица.СуммаНДС                              КАК СуммаНДС,
	|	Таблица.СуммаСкидки                           КАК СуммаСкидки,
	|	Таблица.СуммаБезСкидки                        КАК СуммаБезСкидки,
	|	ВременнаяТаблицаНаборыДополнительно.СтавкаНДС КАК СтавкаНДС
	|ПОМЕСТИТЬ ВременнаяТаблицаНаборы
	|ИЗ
	|	ВременнаяТаблицаНаборыПодготовка КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаНаборыДополнительно КАК ВременнаяТаблицаНаборыДополнительно
	|		ПО Таблица.НоменклатураНабора = ВременнаяТаблицаНаборыДополнительно.НоменклатураНабора
	|		И Таблица.ХарактеристикаНабора = ВременнаяТаблицаНаборыДополнительно.ХарактеристикаНабора
	|		И Таблица.Ссылка = ВременнаяТаблицаНаборыДополнительно.Ссылка
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////// 
	#Вставка
	|ВЫБРАТЬ
	|	СчетНаОплатуКлиенту.Ссылка КАК Ссылка,
	|	ЗаказКлиентаЭтапыГрафикаОплаты.ВариантОтсчета КАК ВариантОтсчета,
	|	ЗаказКлиентаЭтапыГрафикаОплаты.ПроцентПлатежа КАК ПроцентПлатежа,
	|	ЗаказКлиентаЭтапыГрафикаОплаты.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Документ.СчетНаОплатуКлиенту КАК СчетНаОплатуКлиенту
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.ЭтапыГрафикаОплаты КАК ЗаказКлиентаЭтапыГрафикаОплаты
	|			ПО ЗаказКлиента.Ссылка = ЗаказКлиентаЭтапыГрафикаОплаты.Ссылка
	|		ПО СчетНаОплатуКлиенту.ДокументОснование = ЗаказКлиента.Ссылка
	|ГДЕ
	|	СчетНаОплатуКлиенту.Ссылка В
	|			(ВЫБРАТЬ
	|				ТаблицаДокументов.Ссылка
	|			ИЗ
	|				ТаблицаДокументов)
	|	И ЗаказКлиентаЭтапыГрафикаОплаты.НомерСтроки = 1
	|;
    |//////////////////////////////////////////////////////////////////////////////// 
	#КонецВставки
	|ВЫБРАТЬ
	|	Товары.Ссылка КАК Ссылка,
	|	
	|	Товары.ВариантПредставленияНабораВПечатныхФормах КАК ВариантПредставленияНабораВПечатныхФормах,
	|	Товары.ВариантРасчетаЦеныНабора                  КАК ВариантРасчетаЦеныНабора,
	|	
	|	Товары.НоменклатураНабора    КАК НоменклатураНабора,
	|	ЕСТЬNULL(НоменклатураНабораПредставления.НаименованиеПолное, Товары.НоменклатураНабора.НаименованиеПолное) КАК НоменклатураНабораНаименованиеПолное,
	|	Товары.ХарактеристикаНабора  КАК ХарактеристикаНабора,
	|	ЕСТЬNULL(ХарактеристикиНоменклатурыНабораПредставления.НаименованиеПолное, ЕСТЬNULL(Товары.ХарактеристикаНабора.НаименованиеПолное, """")) КАК ХарактеристикаНабораНаименованиеПолное,
	|	Товары.ЭтоНабор         КАК ЭтоНабор,
	|	Товары.ЭтоКомплектующие КАК ЭтоКомплектующие,
	|	
	|	Товары.НомерСтроки                     КАК НомерСтроки,
	|	Товары.Номенклатура                    КАК Номенклатура,
	|	Товары.Номенклатура.Код                КАК Код,
	|	Товары.Номенклатура.Артикул            КАК Артикул,
	|	ЕСТЬNULL(НоменклатураПредставления.НаименованиеПолное, Товары.Номенклатура.НаименованиеПолное) КАК НаименованиеПолное,
	|	Товары.Содержание                      КАК Содержание,
	|	&ТекстЗапросаНаименованиеЕдиницыИзмерения 				 КАК ЕдиницаИзмерения,
	|	Товары.КоличествоУпаковок                                КАК Количество,
	|	Товары.Цена КАК Цена,
	|	Товары.Сумма                                             КАК Сумма,
	|	Товары.СтавкаНДС                                         КАК СтавкаНДС,
	|	Товары.СуммаНДС                                          КАК СуммаНДС,
	|	НЕОПРЕДЕЛЕНО                                             КАК ВидЦеныИсполнителя,
	|	ЕСТЬNULL(ХарактеристикиНоменклатурыПредставления.НаименованиеПолное, ЕСТЬNULL(Товары.Характеристика.НаименованиеПолное, """")) КАК Характеристика,
	|	ВЫБОР КОГДА ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1) = 1 ТОГДА
	|		НЕОПРЕДЕЛЕНО
	|	ИНАЧЕ
	|		Товары.Упаковка.Наименование
	|	КОНЕЦ                                                    КАК Упаковка,
	|	
	|	Товары.СуммаСкидки                                       КАК СуммаСкидки,
	|	
	|	Товары.СуммаБезСкидки                                    КАК СуммаБезСкидки,
	|	
	|	Товары.ЭтоВозвратнаяТара                                 КАК ЭтоВозвратнаяТара	
	|	
	|ИЗ (
	|	
	|	ВЫБРАТЬ
	|		Таблица.Ссылка,
	|		
	|		ВЫБОР КОГДА ЕСТЬNULL(ВременнаяТаблицаНаборы.НомерСтроки, 0) <> 0 ТОГДА
	|			ВременнаяТаблицаНаборы.ВариантПредставленияНабораВПечатныхФормах
	|		ИНАЧЕ
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.ПустаяСсылка)
	|		КОНЕЦ КАК ВариантПредставленияНабораВПечатныхФормах,
	|		
	|		ВЫБОР КОГДА ЕСТЬNULL(ВременнаяТаблицаНаборы.НомерСтроки, 0) <> 0 ТОГДА
	|			ВременнаяТаблицаНаборы.ВариантРасчетаЦеныНабора
	|		ИНАЧЕ
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.ПустаяСсылка)
	|		КОНЕЦ КАК ВариантРасчетаЦеныНабора,
	|		
	|		Таблица.НоменклатураНабора,
	|		Таблица.ХарактеристикаНабора,
	|		ВЫБОР КОГДА ЕСТЬNULL(ВременнаяТаблицаНаборы.НомерСтроки, 0) <> 0 ТОГДА
	|			ИСТИНА
	|		ИНАЧЕ
	|			ЛОЖЬ
	|		КОНЕЦ КАК ЭтоКомплектующие,
	|		ЛОЖЬ КАК ЭтоНабор,
	|		ВЫБОР КОГДА ЕСТЬNULL(ВременнаяТаблицаНаборы.НомерСтроки, 0) <> 0 ТОГДА
	|			ВременнаяТаблицаНаборы.НомерСтроки
	|		ИНАЧЕ
	|			Таблица.НомерСтроки
	|		КОНЕЦ КАК НомерСтроки,
	|		Таблица.Номенклатура,
	|		Таблица.Количество,
	|		Таблица.КоличествоУпаковок,
	|		Таблица.Цена,
	|		Таблица.Сумма,
	|		Таблица.СтавкаНДС,
	|		Таблица.СуммаНДС,
	|		Таблица.Характеристика,
	|		Таблица.Упаковка,
	|		Таблица.СуммаСкидки,
	|		Таблица.СуммаБезСкидки,
	|		Таблица.ЭтоВозвратнаяТара,
	|		Таблица.Содержание
	|	ИЗ
	|		Товары КАК Таблица
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаНаборы КАК ВременнаяТаблицаНаборы
	|			ПО ВременнаяТаблицаНаборы.НоменклатураНабора = Таблица.НоменклатураНабора
	|			 И ВременнаяТаблицаНаборы.ХарактеристикаНабора = Таблица.ХарактеристикаНабора
	|			 И ВременнаяТаблицаНаборы.Ссылка = Таблица.Ссылка
	|
	|	ГДЕ
	|		Таблица.НоменклатураНабора = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|		ИЛИ (Таблица.НоменклатураНабора <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	        И ВременнаяТаблицаНаборы.ВариантПредставленияНабораВПечатныхФормах В (ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.ТолькоКомплектующие),
	|	                                                                              ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.НаборИКомплектующие)))
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВременнаяТаблицаНаборы.Ссылка,
	|		ВременнаяТаблицаНаборы.ВариантПредставленияНабораВПечатныхФормах,
	|		ВременнаяТаблицаНаборы.ВариантРасчетаЦеныНабора КАК ВариантРасчетаЦеныНабора,
	|		ВременнаяТаблицаНаборы.НоменклатураНабора,
	|		ВременнаяТаблицаНаборы.ХарактеристикаНабора,
	|		ЛОЖЬ КАК ЭтоКомплектующие,
	|		ИСТИНА КАК ЭтоНабор,
	|		ВременнаяТаблицаНаборы.НомерСтроки,
	|		ВременнаяТаблицаНаборы.НоменклатураНабора,
	|		ВременнаяТаблицаНаборы.Количество,
	|		ВременнаяТаблицаНаборы.КоличествоУпаковок,
	|		ВЫБОР
	|			КОГДА &ОтображатьСкидки ТОГДА
	|				ВЫБОР КОГДА ЕСТЬNULL(ВременнаяТаблицаНаборы.КоличествоУпаковок, 1) <> 0 ТОГДА
	|					(ВременнаяТаблицаНаборы.СуммаБезСкидки) / ЕСТЬNULL(ВременнаяТаблицаНаборы.КоличествоУпаковок, 1)
	|				ИНАЧЕ
	|					0
	|				КОНЕЦ
	|			ИНАЧЕ
	|				ВЫБОР КОГДА ЕСТЬNULL(ВременнаяТаблицаНаборы.КоличествоУпаковок, 1) <> 0 ТОГДА
	|					(ВременнаяТаблицаНаборы.Сумма) / ЕСТЬNULL(ВременнаяТаблицаНаборы.КоличествоУпаковок, 1)
	|				ИНАЧЕ
	|					0
	|				КОНЕЦ
	|		КОНЕЦ КАК Цена,
	|		ВременнаяТаблицаНаборы.Сумма КАК Сумма,
	|		ВременнаяТаблицаНаборы.СтавкаНДС,
	|		ВременнаяТаблицаНаборы.СуммаНДС,
	|		ВременнаяТаблицаНаборы.ХарактеристикаНабора,
	|		ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) КАК Упаковка,
	|		ВременнаяТаблицаНаборы.СуммаСкидки,
	|		ВременнаяТаблицаНаборы.СуммаБезСкидки,
	|		Ложь,
	|		""""
	|	ИЗ
	|		ВременнаяТаблицаНаборы КАК ВременнаяТаблицаНаборы
	|	ГДЕ
	|		ВременнаяТаблицаНаборы.ВариантПредставленияНабораВПечатныхФормах В (ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.ТолькоНабор),
	|	                                                                        ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.НаборИКомплектующие))
	|) КАК Товары
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.Представления КАК НоменклатураПредставления
	|	ПО (Товары.Номенклатура = НоменклатураПредставления.Ссылка
	|			И НоменклатураПредставления.КодЯзыка = &КодЯзыка)
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.Представления КАК ХарактеристикиНоменклатурыПредставления
	|	ПО (Товары.Характеристика = ХарактеристикиНоменклатурыПредставления.Ссылка
	|			И ХарактеристикиНоменклатурыПредставления.КодЯзыка = &КодЯзыка)
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.Представления КАК НоменклатураНабораПредставления
	|	ПО (Товары.НоменклатураНабора = НоменклатураНабораПредставления.Ссылка
	|			И НоменклатураНабораПредставления.КодЯзыка = &КодЯзыка)
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.Представления КАК ХарактеристикиНоменклатурыНабораПредставления
	|	ПО (Товары.ХарактеристикаНабора = ХарактеристикиНоменклатурыНабораПредставления.Ссылка
	|			И ХарактеристикиНоменклатурыНабораПредставления.КодЯзыка = &КодЯзыка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Товары.НомерСтроки,
	|	ЭтоНабор УБЫВ
	|";

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаКоэффициентУпаковки",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
	"Товары.Упаковка",
	"Товары.Номенклатура"));

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаНаименованиеЕдиницыИзмерения",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаЗначениеРеквизитаЕдиницыИзмерения(
	"Наименование",
	"Товары.Упаковка",
	"Товары.Номенклатура"));

	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("ОтображатьСкидки", ОтображатьСкидки);
	Запрос.УстановитьПараметр("КодЯзыка", КодЯзыка);

	ПакетРезультатовЗапроса = Запрос.ВыполнитьПакет();

	СтруктураДанныхДляПечати = Новый Структура;
	СтруктураДанныхДляПечати.Вставить("РезультатПоШапке", ПакетРезультатовЗапроса[1]);  
	#Удаление
	СтруктураДанныхДляПечати.Вставить("РезультатПоЭтапамОплаты", ПакетРезультатовЗапроса[2]); 
	#КонецУдаления
	#Вставка   
	СтруктураДанныхДляПечати.Вставить("РезультатПоЭтапамОплаты", ПакетРезультатовЗапроса[4]); 
	//·++·Гурьев·07.08.23·#2_11_4·Данные табличной части, нужные для заполнения полей
	СтруктураДанныхДляПечати.Вставить("ЭтапыГрафикаОплатыЗаказКлиента", ПакетРезультатовЗапроса[ПакетРезультатовЗапроса.Количество() - 2]);
	//·--·Гурьев·07.08.23
	//·++·Гурьев·16.08.23·#2_2·Данные табличной части, нужные для документа удостоверяющего личность
	СтруктураДанныхДляПечати.Вставить("ДокументУдостоверяющийЛичность", ПакетРезультатовЗапроса[3]);
	//·--·Гурьев·16.08.23

	#КонецВставки
	СтруктураДанныхДляПечати.Вставить("РезультатПоТабличнойЧасти", ПакетРезультатовЗапроса[ПакетРезультатовЗапроса.Количество() - 1]);
    #Вставка
	// <+БИТ> Руденков_Е.И. 29.03.2024 
	// #000000222, Счет на оплату.
	ЗаполненаКАНАТ_Товары = Ложь;
	ЗапросКАНАТ_Товары = Новый Запрос;
	ЗапросКАНАТ_Товары.Текст = 
	"ВЫБРАТЬ *
	|ПОМЕСТИТЬ ТчКАНАТ_Товары
	|ИЗ
	|	Документ.СчетНаОплатуКлиенту.КАНАТ_Товары КАК ТчКАНАТ_Товары
	|ГДЕ
	|	ТчКАНАТ_Товары.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТчКАНАТ_Товары.Ссылка КАК Ссылка,
	|	ТчКАНАТ_Товары.НомерСтроки КАК НомерСтроки,
	|	ТчКАНАТ_Товары.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ТчКАНАТ_Товары.Номенклатура КАК Номенклатура,
	|	ТчКАНАТ_Товары.Номенклатура.НаименованиеПолное КАК НаименованиеПолное,
	|	ТчКАНАТ_Товары.Характеристика.НаименованиеПолное КАК Характеристика,
	|	ТчКАНАТ_Товары.Упаковка КАК Упаковка,
	|	ТчКАНАТ_Товары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ТчКАНАТ_Товары.Количество КАК Количество,
	|	ТчКАНАТ_Товары.ВидЦены КАК ВидЦены,
	|	ТчКАНАТ_Товары.Цена КАК ЦенаТЧ,
	|	ТчКАНАТ_Товары.Сумма КАК Сумма,
	|	ТчКАНАТ_Товары.УдалитьСтавкаНДС КАК УдалитьСтавкаНДС,
	|	ТчКАНАТ_Товары.СтавкаНДС КАК СтавкаНДС,
	|	ТчКАНАТ_Товары.СуммаНДС КАК СуммаНДС,
	|	ТчКАНАТ_Товары.СуммаСНДС КАК СуммаСНДС,
	|	ТчКАНАТ_Товары.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
	|	ТчКАНАТ_Товары.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	|	ТчКАНАТ_Товары.ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки,
	|	ТчКАНАТ_Товары.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
	|	ТчКАНАТ_Товары.ПричинаОтмены КАК ПричинаОтмены,
	|	ТчКАНАТ_Товары.КодСтроки КАК КодСтроки,
	|	ТчКАНАТ_Товары.Отменено КАК Отменено,
	|	ТчКАНАТ_Товары.КлючСвязи КАК КлючСвязи,
	|	ТчКАНАТ_Товары.Склад КАК Склад,
	|	ТчКАНАТ_Товары.СрокПоставки КАК СрокПоставки,
	|	ТчКАНАТ_Товары.Содержание КАК Содержание,
	|	ТчКАНАТ_Товары.СтатусУказанияСерий КАК СтатусУказанияСерий,
	|	ТчКАНАТ_Товары.ВариантОбеспечения КАК ВариантОбеспечения,
	|	ТчКАНАТ_Товары.Серия КАК Серия,
	|	ТчКАНАТ_Товары.НоменклатураНабора КАК НоменклатураНабора,
	|	ТчКАНАТ_Товары.Обособленно КАК Обособленно,
	|	ТчКАНАТ_Товары.ХарактеристикаНабора КАК ХарактеристикаНабора,
	|	ТчКАНАТ_Товары.ХарактеристикаНабора.НаименованиеПолное КАК ХарактеристикаНабораНаименованиеПолное,
	|	ТчКАНАТ_Товары.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТчКАНАТ_Товары.ВариантОбеспеченияДоИзмененияОбновлениемИБ КАК ВариантОбеспеченияДоИзмененияОбновлениемИБ,
	|	ТчКАНАТ_Товары.Подразделение КАК Подразделение,
	|	ТчКАНАТ_Товары.НоменклатураПартнера КАК НоменклатураПартнера,
	|	ТчКАНАТ_Товары.СуммаБонусныхБалловКСписанию КАК СуммаБонусныхБалловКСписанию,
	|	ТчКАНАТ_Товары.СуммаБонусныхБалловКСписаниюВВалюте КАК СуммаБонусныхБалловКСписаниюВВалюте,
	|	ТчКАНАТ_Товары.СуммаНачисленныхБонусныхБалловВВалюте КАК СуммаНачисленныхБонусныхБалловВВалюте,
	|	ТчКАНАТ_Товары.СпособДоставки Как СпособДоставки,
	|	ТчКАНАТ_Товары.ПеревозчикПартнер Как ПеревозчикПартнер,
	|	ТчКАНАТ_Товары.Грузополучатель Как Грузополучатель,
	|	ТчКАНАТ_Товары.НеОтгружатьЧастями Как НеОтгружатьЧастями,
	|	ТчКАНАТ_Товары.ДатаОтгрузкиОснования Как ДатаОтгрузкиОснования,
	|	ТчКАНАТ_Товары.АдресДоставки Как АдресДоставки,
	|	ТчКАНАТ_Товары.КАНАТ_ПлатитЗаДоставку Как КАНАТ_ПлатитЗаДоставку,
	|	Ложь Как ЭтоНабор,
	|	Ложь Как ЭтоКомплектующие,
	|	Ложь Как ЭтоВозвратнаяТара,
	|	ТчКАНАТ_Товары.Сумма + ТчКАНАТ_Товары.СуммаРучнойСкидки + ТчКАНАТ_Товары.СуммаАвтоматическойСкидки КАК СуммаБезСкидки,
	|	ВЫБОР
	|		КОГДА &ОтображатьСкидки
	|			ТОГДА ТчКАНАТ_Товары.СуммаРучнойСкидки + ТчКАНАТ_Товары.СуммаАвтоматическойСкидки
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаСкидки,
	|	ВЫБОР
	|		КОГДА &ОтображатьСкидки
	|			ТОГДА ТчКАНАТ_Товары.Цена
	|		ИНАЧЕ ТчКАНАТ_Товары.Сумма / ТчКАНАТ_Товары.КоличествоУпаковок
	|	КОНЕЦ КАК Цена,
	//БИТ_Гурьев__06.05.24++
	|	&ТекстЗапросаНаименованиеЕдиницыИзмерения КАК ЕдиницаИзмерения
	//БИТ_Гурьев__06.05.24--
	|ИЗ
	|	ТчКАНАТ_Товары КАК ТчКАНАТ_Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуКлиенту КАК СчетНаОплатуКлиенту
	|		ПО ТчКАНАТ_Товары.Ссылка = СчетНаОплатуКлиенту.Ссылка
	//БИТ_Гурьев__06.05.24++
	|ГДЕ
	|	ТчКАНАТ_Товары.Отменено = Ложь";
	//БИТ_Гурьев__06.05.24--";
	ЗапросКАНАТ_Товары.УстановитьПараметр("МассивОбъектов"		,МассивОбъектов);
	ЗапросКАНАТ_Товары.УстановитьПараметр("ОтображатьСкидки"	,ОтображатьСкидки);
	//БИТ_Гурьев__06.05.24++
	ЗапросКАНАТ_Товары.Текст = СтрЗаменить(ЗапросКАНАТ_Товары.Текст, "&ТекстЗапросаНаименованиеЕдиницыИзмерения",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаЗначениеРеквизитаЕдиницыИзмерения(
			"Наименование",
			"ТчКАНАТ_Товары.Упаковка",
			"ТчКАНАТ_Товары.Номенклатура"));
	//БИТ_Гурьев__06.05.24--
	РезультатКАНАТ_Товары = ЗапросКАНАТ_Товары.Выполнить();
	СтруктураДанныхДляПечати.Вставить("КАНАТ_Товары",РезультатКАНАТ_Товары);
	// <-БИТ> Руденков_Е.И. 29.03.2024
	#КонецВставки
	Возврат СтруктураДанныхДляПечати;

КонецФункции

&ИзменениеИКонтроль("СформироватьНазначениеПлатежа")
Функция КАНАТ_СформироватьНазначениеПлатежа(Знач Номер, Знач ДокументОснование)

	ТекстДокумента = "";

	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
        #Удаление
		ТекстНазначениеПлатежа = НСтр("ru = 'Оплата по заказу клиента №%Номер%';
		|en = 'Payment against sales order No.%Номер%'");
        #КонецУдаления  
		#Вставка
		ТекстНазначениеПлатежа = НСтр("ru = 'Оплата по счету №%Номер%';
										|en = 'Payment by sales order No.%Номер%'");
		#КонецВставки
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("СправочникСсылка.СоглашенияСКлиентами") Тогда

		ТекстНазначениеПлатежа = НСтр("ru = 'Оплата по соглашению №%Номер%';
		|en = 'Payment by agreement No.%Номер%'");

	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента") Тогда

		ТекстНазначениеПлатежа = НСтр("ru = 'Оплата по заявке на возврат №%Номер%';
		|en = 'Payment by return request No.%Номер%'");

	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ОтчетКомиссионераОСписании") Тогда

		ТекстНазначениеПлатежа = НСтр("ru = 'Оплата по отчету комиссионера о списании №%Номер%';
		|en = 'Payment by consignment stock adjustment No.%Номер%'");

	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ОтчетКомитенту") Тогда

		ТекстНазначениеПлатежа = НСтр("ru = 'Оплата по отчету комитенту №%Номер%';
		|en = 'Payment by consignment notification No.%Номер%'");

	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ОтчетКомиссионера") Тогда

		ТекстНазначениеПлатежа = НСтр("ru = 'Оплата по отчету комиссионера о продажах №%Номер%';
		|en = 'Payment by consignment issue notification No.%Номер%'");

	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда

		ТекстНазначениеПлатежа = НСтр("ru = 'Оплата по реализации товаров и услуг №%Номер%';
		|en = 'Payment by customer invoice #%Номер%'");

	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ВыкупВозвратнойТарыКлиентом") Тогда

		ТекстНазначениеПлатежа = НСтр("ru = 'Оплата по выкупу возвратной тары клиентом №%Номер%';
		|en = 'Payment under Customer invoice — returnable packaging No.%Номер%'");

	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.АктВыполненныхРабот") Тогда

		ТекстНазначениеПлатежа = НСтр("ru = 'Оплата по акту выполненных работ №%Номер%';
		|en = 'Payment by Customer invoice —Services #%Номер%'");

		//++ НЕ УТКА

		//++ Устарело_Переработка24
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказДавальца")
		Или ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ОтчетДавальцу") Тогда

		ТекстНазначениеПлатежа = НСтр("ru = 'Оплата по акту выполненных работ №%Номер%';
		|en = 'Payment by Customer invoice —Services #%Номер%'");
		//-- Устарело_Переработка24
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказДавальца2_5")
		Или ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ОтчетДавальцу2_5") Тогда

		ТекстНазначениеПлатежа = НСтр("ru = 'Оплата по акту выполненных работ №%Номер%';
		|en = 'Payment by Customer invoice —Services #%Номер%'");

		//-- НЕ УТКА
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда

		ТекстНазначениеПлатежа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "НаименованиеДляПечати");

	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ОтчетКомитентуОЗакупках") Тогда

		ТекстНазначениеПлатежа = НСтр("ru = 'Оплата по отчету комитенту о закупках №%Номер%';
		|en = 'Payment according to purchase notification No.%Номер%'");

	КонецЕсли;

	ТекстНазначениеПлатежа = СтрЗаменить(
	ТекстНазначениеПлатежа,
	"%Номер%",
	ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Номер, Ложь, Истина));

	Возврат ТекстНазначениеПлатежа;

КонецФункции
