
&После("ПриУстановкеНовогоНомера")
Процедура КАНАТ_ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	//++ Гурьев 31.08.23 Изменение номера при создании на основании
	Если ПустаяСтрока(Номер) И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		СтандартнаяОбработка = Ложь;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СчетНаОплатуКлиенту.Номер КАК НомерСчета
			|ИЗ
			|	Документ.СчетНаОплатуКлиенту КАК СчетНаОплатуКлиенту
			|ГДЕ
			|	СчетНаОплатуКлиенту.ДокументОснование = &ДокументОснование";
		
		Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		МаксНомер = 0;
		Префикс = ДокументОснование.Номер;
		
		Пока Выборка.Следующий() Цикл
			НомерСчета = Число(Прав(Выборка.НомерСчета, 3));
			Если НомерСчета > МаксНомер Тогда
				МаксНомер = НомерСчета;
			КонецЕсли;
		КонецЦикла;
		
		Номер = СтрШаблон("%1-%2", Префикс, Формат(МаксНомер+1, "ЧЦ=3; ЧВН=")); 
	
	КонецЕсли;
	//-- Гурьев 31.08.23
КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаЗаполнения")
Процедура КАНАТ_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);

	Если ТипДанныхЗаполнения = Тип("Структура") Тогда

		ЗаполнитьДокументПоОтбору(ДанныеЗаполнения);

	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		ЗаполнитьПоРеализацииТоваров(
		ДанныеЗаполнения,
		ДанныеЗаполнения);

	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ВыкупВозвратнойТарыКлиентом") Тогда
		ЗаполнитьПоВыкупуВозвратнойТарыКлиентом(
		ДанныеЗаполнения,
		ДанныеЗаполнения);

	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ВыкупТоваровХранителем") Тогда
		ЗаполнитьПоВыкупуТоваровХранителем(
		ДанныеЗаполнения,
		ДанныеЗаполнения);

	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.АктВыполненныхРабот") Тогда
		ЗаполнитьПоАктуВыполненныхРабот(
		ДанныеЗаполнения,
		ДанныеЗаполнения);

	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ОтчетКомитенту") Тогда
		ЗаполнитьПоОтчетуКомитенту(
		ДанныеЗаполнения,
		ДанныеЗаполнения);

	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ОтчетКомиссионераОСписании") Тогда
		ЗаполнитьПоОтчетуКомиссионераОСписании(
		ДанныеЗаполнения,
		ДанныеЗаполнения);

	ИначеЕсли ТипДанныхЗаполнения = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		ЗаполнитьПоДоговору(
		ДанныеЗаполнения,
		ДанныеЗаполнения);

		//++ НЕ УТКА

		//++ Устарело_Переработка24
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ОтчетДавальцу") Тогда
		ЗаполнитьПоОтчетуДавальцу(
		ДанныеЗаполнения,
		ДанныеЗаполнения);
		//-- Устарело_Переработка24
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ОтчетДавальцу2_5") Тогда

		ЗаполнитьПоОтчетуДавальцу2_5(ДанныеЗаполнения, ДанныеЗаполнения);

		//-- НЕ УТКА

	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ОтчетКомитентуОЗакупках") Тогда
		ЗаполнитьПоОтчетуКомитентуОЗакупках(
		ДанныеЗаполнения,
		ДанныеЗаполнения);

	КонецЕсли;

	ИнициализироватьДокумент(ДанныеЗаполнения);
	ДополнительныеСвойства.Вставить("НеобходимостьЗаполненияКассыПриФОИспользоватьНесколькоКассЛожь", Ложь);
	ДополнительныеСвойства.Вставить("НеобходимостьЗаполненияСчетаПриФОИспользоватьНесколькоСчетовЛожь", Ложь);

	СчетНаОплатуКлиентуЛокализация.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, СтандартнаяОбработка);

	#Вставка 
	// <+БИТ> Руденков_Е.И. 29.03.2024 
	// #000000222, Счет на оплату. 
	ТипОснования = ТипЗнч(ДокументОснование);
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипОснования);
	Если ОбъектМетаданных <> Неопределено и Метаданные.Документы.Содержит(ОбъектМетаданных)
		И ОбъектМетаданных.ТабличныеЧасти.Найти("Товары") <> Неопределено Тогда
		ОбъектДляЗапроса = "Документ." + ОбъектМетаданных.Имя;
		ЗаполнитьКАНАТ_Товары(ОбъектДляЗапроса);
		Если ОбъектДляЗапроса = "Документ.ЗаказКлиента" Тогда
			ДополнительнаяИнформация = ДокументОснование.ДополнительнаяИнформация;
		КонецЕсли;
	КонецЕсли;
	// <-БИТ> Руденков_Е.И. 29.03.2024
	#КонецВставки
	
КонецПроцедуры

// <+БИТ> Руденков_Е.И. 29.03.2024 
// #000000222, Счет на оплату. 
Процедура ЗаполнитьКАНАТ_Товары(ОбъектДляЗапроса)
	
	//Запрос реализиован следующим образом, т.к. ДокументОснование может быть разных типов
	//с разным набором реквизитов
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ *
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ТЧТовары
	|ГДЕ
	|	ТЧТовары.Ссылка = &ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ *
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Ссылка = &ДокументОснование";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"Документ.ЗаказКлиента.Товары",ОбъектДляЗапроса+".Товары");
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	МассивРезультатов	= Запрос.ВыполнитьПакет();
	РезультатТЧ			= МассивРезультатов[0];
	РезультатОбъект		= МассивРезультатов[1];
	
	ВыборкаОбъект	= РезультатОбъект.Выбрать();
	ВыборкаОбъект.Следующий();
	
	ВыборкаТЧ		= РезультатТЧ.Выбрать();
	Пока ВыборкаТЧ.Следующий() Цикл
		НоваяСтрока = КАНАТ_Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаТЧ);
		Если ОбъектДляЗапроса = "Документ.ЗаказКлиента" Тогда
			НоваяСтрока.СпособДоставки			= ВыборкаОбъект.СпособДоставки;
			НоваяСтрока.ПеревозчикПартнер		= ВыборкаОбъект.ПеревозчикПартнер;
			НоваяСтрока.Грузополучатель			= ВыборкаОбъект.Грузополучатель;
			НоваяСтрока.НеОтгружатьЧастями		= ВыборкаОбъект.НеОтгружатьЧастями;
			НоваяСтрока.ДатаОтгрузкиОснования	= ВыборкаОбъект.ДатаОтгрузки;
			НоваяСтрока.АдресДоставки			= ВыборкаОбъект.АдресДоставки;
			НоваяСтрока.КАНАТ_ПлатитЗаДоставку	= ВыборкаОбъект.КАНАТ_ПлатитЗаДоставку;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // <-БИТ> Руденков_Е.И. 29.03.2024
