
&ИзменениеИКонтроль("ПриНачалеРаботыСистемы")
Процедура КАНАТ_ПриНачалеРаботыСистемы(Параметры)

	ПланГлобальногоПоиска = ГлобальныйПоиск.ПолучитьПлан();
	ПланГлобальногоПоиска.Добавить("НайтиДокументВРеестре", "ОбщегоНазначенияУТ", Истина, , 5);
	ГлобальныйПоиск.УстановитьПлан(ПланГлобальногоПоиска);

	ПараметрыРаботыКлиента = СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиентаПриЗапуске();
	Если ПараметрыРаботыКлиента.ЗадатьВопросОПереходеНаОнлайнВзаиморасчеты Тогда
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Да';
		|en = 'Yes'"));
		Кнопки.Добавить(КодВозвратаДиалога.Нет, НСтр("ru = 'Не сейчас';
		|en = 'Maybe later'"));
		Кнопки.Добавить(КодВозвратаДиалога.Прервать, НСтр("ru = 'Нет';
		|en = 'No'"));
		ОбработчикОтвета = Новый ОписаниеОповещения("ЗавершениеВопросаОПереходе", ОбщегоНазначенияУТКлиент);
		ТекстВопроса = НСтр("ru = 'Рекомендуется перейти на новый режим «онлайн» учета взаиморасчетов. 
		|Это ускорит печать документов и откроет новые возможности в отчетах. 
		|Выполнить переход?';
		|en = 'Switching to the new online settlements accounting mode is recommended. 
		|This will speed up printing of documents and unlock new features in reports. 
		|Do you want to switch?'");
		ПоказатьВопрос(ОбработчикОтвета, ТекстВопроса, Кнопки);
	КонецЕсли;

	#Если МобильныйКлиент Тогда
		Если ОбменМобильныеВызовПК.ТребуетсяОбменДаннымиСАвтономнымПриложением() Тогда
			#Удаление
			Если ОсновнойСерверДоступен() = Истина Тогда
			#КонецУдаления
			#Вставка
			Если ОсновнойСерверДоступен() = Истина И Ложь Тогда
			#КонецВставки
				ОбменМобильныеАвтономныйКлиент.НачатьОбмен();
			КонецЕсли;
			ПодключитьОбработчикОжидания("ПроверкаНеобходимостиСинхронизации", 10);
		КонецЕсли;
	#КонецЕсли

КонецПроцедуры
