
&НаСервере
Процедура КАНАТ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//БИТ_Гурьев_ЧТЗ_3.2_09.04.24++
	СтраницаЗаправочныеПараметры = Элементы.Добавить("КАНАТ_СтраницаЗаправочныеПараметры",
												Тип("ГруппаФормы"),
												Элементы.Страницы);
	СтраницаЗаправочныеПараметры.Вид = ВидГруппыФормы.Страница;
	СтраницаЗаправочныеПараметры.Заголовок = "Заправочные параметры";
	
	ЭлементОборудование = Элементы.Добавить("КАНАТ_ЭлементОборудование",
													 Тип("ПолеФормы"),
													 СтраницаЗаправочныеПараметры);
	ЭлементОборудование.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементОборудование.ПутьКДанным = "Объект.КАНАТ_Оборудование";
	
	ТаблицаПоказатели = Элементы.Добавить("КАНАТ_ТаблицаПоказатели", Тип("ТаблицаФормы"),СтраницаЗаправочныеПараметры);
	ТаблицаПоказатели.ПутьКДанным = "Объект.КАНАТ_Показатели";
	
	ТаблицаПоказателиПоказатель  = Элементы.Добавить("КАНАТ_ТаблицаПоказателиПоказатель",
														   Тип("ПолеФормы"),
														   ТаблицаПоказатели);
	ТаблицаПоказателиПоказатель.Вид = ВидПоляФормы.ПолеВвода;      
	ТаблицаПоказателиПоказатель.ПутьКДанным = "Объект.КАНАТ_Показатели.Показатель";
	
	ТаблицаПоказателиЗначение  = Элементы.Добавить("КАНАТ_ТаблицаПоказателиЗначение",
														   Тип("ПолеФормы"),
														   ТаблицаПоказатели);
	ТаблицаПоказателиЗначение.Вид = ВидПоляФормы.ПолеВвода;      
	ТаблицаПоказателиЗначение.ПутьКДанным = "Объект.КАНАТ_Показатели.Значение";
	
	ЭлементЗапПараметры = Элементы.Добавить("КАНАТ_ЭлементЗаправочныеПараметры",
													 Тип("ПолеФормы"),
													 СтраницаЗаправочныеПараметры);
	ЭлементЗапПараметры.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементЗапПараметры.ПутьКДанным = "Объект.КАНАТ_ЗаправочныеПараметры"; 
	ЭлементЗапПараметры.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	ЭлементЗапПараметры.АвтоМаксимальнаяШирина = Ложь;
	//БИТ_Гурьев_ЧТЗ_3.2_09.04.24--
КонецПроцедуры
