
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("НазваниеОтчета", "ОтчетНитиSisol");
	ПараметрыФормы.Вставить("Синоним", "Отчет по нитям ПП с экструзионной линии ф. Sisal");
	ОткрытьФорму("Обработка.КАНАТ_ОтчетыРезультатИспытаний.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
