
&НаСервере
Процедура КАНАТ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//++ Гурьев 01.09.23 Гурьев Вывод реквизита "Комментарий к заказу"
	КолонкаКомментарийКЗаказу = Элементы.Добавить("КАНАТ_ПродукцияКомментарийКЗаказу", Тип("ПолеФормы"), Элементы.Продукция); 
	КолонкаКомментарийКЗаказу.Заголовок = "Комментарий к заказу"; 
	КолонкаКомментарийКЗаказу.ПутьКДанным = "Объект.Продукция.КАНАТ_КомментарийКЗаказу";
	КолонкаКомментарийКЗаказу.Вид = ВидПоляФормы.ПолеВвода;
	//-- Гурьев 01.09.23
	
	//++ Гурьев 13.11.23 ЧТЗ_2.3 Вывод колонки с сертификатом
	КолонкаКомментарийКЗаказу = Элементы.Добавить("КАНАТ_Сертификат", Тип("ПолеФормы"), Элементы.Продукция); 
	КолонкаКомментарийКЗаказу.Заголовок = "Сертификат"; 
	КолонкаКомментарийКЗаказу.ПутьКДанным = "Объект.Продукция.КАНАТ_Сертификат";
	КолонкаКомментарийКЗаказу.Вид = ВидПоляФормы.ПолеВвода;
	//-- Гурьев 13.11.23

КонецПроцедуры
