
&НаСервере
Процедура КАНАТ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//++ Гурьев 29.08.23 Создание новых элементов формы для отображения свода товаров
	
	СтраницаСводТоваров = Элементы.Добавить(
		"КАНАТ_СтраницаСводТоваров",
		Тип("ГруппаФормы"),
		Элементы.ГруппаСтраницы);
	СтраницаСводТоваров.Вид = ВидГруппыФормы.Страница;
	СтраницаСводТоваров.Заголовок = "Товары свод";
	
	ДобавляемыеРеквизиты = Новый Массив;
	//Таблица Товары Свод
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("КАНАТ_ТЗСводТоваров",
															 Новый ОписаниеТипов("ТаблицаЗначений")));
	
	//Колонки
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Номер",
															 Новый ОписаниеТипов("Число"),
															 "КАНАТ_ТЗСводТоваров",
															 "№"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Код",
															 Новый ОписаниеТипов("Строка"),
															 "КАНАТ_ТЗСводТоваров",
															 "Код"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("НоменклатураСсылка",
															 Новый ОписаниеТипов("СправочникСсылка.Номенклатура"),
															 "КАНАТ_ТЗСводТоваров",
															 "Номенклатура"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ХарактеристикаСсылка",
															 Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"),
															 "КАНАТ_ТЗСводТоваров",
															 "Характеристика"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Количество",
															 Новый ОписаниеТипов("Число"),
															 "КАНАТ_ТЗСводТоваров",
															 "Количество"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Вес",
															 Новый ОписаниеТипов("Число"),
															 "КАНАТ_ТЗСводТоваров",
															 "Вес"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ЕдиницаИзмерения",
															 Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"),
															 "КАНАТ_ТЗСводТоваров",
															 "Ед. изм."));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Серии",
															 Новый ОписаниеТипов("Число"),
															 "КАНАТ_ТЗСводТоваров",
															 "Мест"));
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	//Элементы формы Свод Таблица
	ТаблицаФормы = Элементы.Добавить("КАНАТ_ТЗСводТоваров", Тип("ТаблицаФормы"), Элементы.КАНАТ_СтраницаСводТоваров);
	ТаблицаФормы.ПутьКДанным = "КАНАТ_ТЗСводТоваров"; 
	ТаблицаФормы.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	ТаблицаФормы.ТолькоПросмотр = Истина;
	
	НоваяКолонка = Элементы.Добавить("КАНАТ_ТЗСводТоваровНомер", Тип("ПолеФормы"), Элементы.КАНАТ_ТЗСводТоваров); 
	НоваяКолонка.Заголовок = "№"; 
	НоваяКолонка.ПутьКДанным = "КАНАТ_ТЗСводТоваров.Номер";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	
	НоваяКолонка = Элементы.Добавить("КАНАТ_ТЗСводТоваровКод", Тип("ПолеФормы"), Элементы.КАНАТ_ТЗСводТоваров); 
	НоваяКолонка.Заголовок = "Код"; 
	НоваяКолонка.ПутьКДанным = "КАНАТ_ТЗСводТоваров.Код";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	
	НоваяКолонка = Элементы.Добавить("КАНАТ_ТЗСводТоваровНоменклатура", Тип("ПолеФормы"), Элементы.КАНАТ_ТЗСводТоваров); 
	НоваяКолонка.Заголовок = "Номенклатура"; 
	НоваяКолонка.ПутьКДанным = "КАНАТ_ТЗСводТоваров.НоменклатураСсылка";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	
	НоваяКолонка = Элементы.Добавить("КАНАТ_ТЗСводТоваровХарактеристика", Тип("ПолеФормы"), Элементы.КАНАТ_ТЗСводТоваров); 
	НоваяКолонка.Заголовок = "Характеристика"; 
	НоваяКолонка.ПутьКДанным = "КАНАТ_ТЗСводТоваров.ХарактеристикаСсылка";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	
	НоваяКолонка = Элементы.Добавить("КАНАТ_ТЗСводТоваровКоличество", Тип("ПолеФормы"), Элементы.КАНАТ_ТЗСводТоваров); 
	НоваяКолонка.Заголовок = "Количество"; 
	НоваяКолонка.ПутьКДанным = "КАНАТ_ТЗСводТоваров.Количество";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	
	НоваяКолонка = Элементы.Добавить("КАНАТ_ТЗСводТоваровВес", Тип("ПолеФормы"), Элементы.КАНАТ_ТЗСводТоваров); 
	НоваяКолонка.Заголовок = "Вес"; 
	НоваяКолонка.ПутьКДанным = "КАНАТ_ТЗСводТоваров.Вес";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	
	НоваяКолонка = Элементы.Добавить("КАНАТ_ТЗСводТоваровЕдиницаИзмерения", Тип("ПолеФормы"), Элементы.КАНАТ_ТЗСводТоваров); 
	НоваяКолонка.Заголовок = "Ед. изм."; 
	НоваяКолонка.ПутьКДанным = "КАНАТ_ТЗСводТоваров.ЕдиницаИзмерения";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	
	НоваяКолонка = Элементы.Добавить("КАНАТ_ТЗСводТоваровНомерСерии", Тип("ПолеФормы"), Элементы.КАНАТ_ТЗСводТоваров); 
	НоваяКолонка.Заголовок = "Мест"; 
	НоваяКолонка.ПутьКДанным = "КАНАТ_ТЗСводТоваров.Серии";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	
	КАНАТ_ОбновитьТоварыСвод();
	
	КАНАТ_ОбновитьТоварыСвод();
	
	//-- Гурьев 30.08.23
КонецПроцедуры

//&НаКлиенте
//&ИзменениеИКонтроль("ОткрытьПодборСерий")
//Процедура КАНАТ_ОткрытьПодборСерий(Текст, ТекущиеДанные)
//	Если НоменклатураКлиент.ДляУказанияСерийНуженСерверныйВызов(ЭтотОбъект,ПараметрыУказанияСерий[ИмяТЧ],Текст, ТекущиеДанные) Тогда
//		Если ТекущиеДанные = Неопределено Тогда
//			ТекущиеДанныеИдентификатор = Элементы[ИмяТЧ].ТекущиеДанные.ПолучитьИдентификатор();
//		Иначе
//			ТекущиеДанныеИдентификатор = ТекущиеДанные.ПолучитьИдентификатор();
//		КонецЕсли;

//		ПараметрыФормыУказанияСерий = ПараметрыФормыУказанияСерий(ТекущиеДанныеИдентификатор);

//		ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьПодборСерийЗавершение",
//		ЭтотОбъект,
//		Новый Структура("ИмяТЧ,ПараметрыФормыУказанияСерий", ИмяТЧ,ПараметрыФормыУказанияСерий));
//		#Вставка
//		//БИТ_Гурьев_ЧТЗ_2.7_19.02.24++
//		Если ИмяТЧ = "ОтгружаемыеТовары" и ПроверитьВидНоменклатуры(ТекущиеДанные.Номенклатура) Тогда   
//			
//			ПараметрыФормыУказанияСерий.ИмяФормы = "Обработка.ПодборСерийВДокументы.Форма.КАНАТ_РегистрацияИПодборСерийПоОднойСтрокеТоваров_РасходныйОрдер";
//			ПараметрыФормыУказанияСерий.ТолькоПросмотр = Истина;
//	
//			ПараметрыФормыУказанияСерий.Вставить("КоличествоКОтгрузке",КАНАТ_ПолучитьКоличествоКОтгрузке(Объект.Ссылка,
//																										 ТекущиеДанные.Номенклатура,
//																										 ТекущиеДанные.Характеристика));
//																											 
//		КонецЕсли;
//		//БИТ_Гурьев_ЧТЗ_2.7_19.02.24--
//		#КонецВставки
//		ОткрытьФорму(ПараметрыФормыУказанияСерий.ИмяФормы,
//		ПараметрыФормыУказанияСерий,
//		ЭтотОбъект,
//		,
//		,
//		,
//		ОписаниеОповещения,
//		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
//	КонецЕсли;

//КонецПроцедуры

Функция КАНАТ_ПолучитьКоличествоКОтгрузке(Ссылка, Номенклатура, Характеристика)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(РасходныйОрдерНаТоварыОтгружаемыеТовары.КоличествоУпаковок) КАК КоличествоУпаковок
		|ИЗ
		|	Документ.РасходныйОрдерНаТовары.ОтгружаемыеТовары КАК РасходныйОрдерНаТоварыОтгружаемыеТовары
		|ГДЕ
		|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Ссылка = &Ссылка
		|	И РасходныйОрдерНаТоварыОтгружаемыеТовары.Номенклатура = &Номенклатура
		|	И РасходныйОрдерНаТоварыОтгружаемыеТовары.Характеристика = &Характеристика";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Возврат ВыборкаДетальныеЗаписи.КоличествоУпаковок;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПроверитьВидНоменклатуры(Номенклатура)
	Возврат Номенклатура.ВидНоменклатуры.Канат_ЗапретНаОтгрузкуЧастями; 
	
КонецФункции

&НаКлиенте
Процедура КАНАТ_ГруппаСтраницыПриСменеСтраницыПосле(Элемент, ТекущаяСтраница)
	//++ Гурьев 30.08.23 Обновление свода товаров при смене страницы
	Если ТекущаяСтраница.Имя = "КАНАТ_СтранциаСводТоваров" Тогда
		КАНАТ_ОбновитьТоварыСвод();
	КонецЕсли;
	//-- Гурьев 30.08.23
КонецПроцедуры

//++ Гурьев 30.08.23 Процедура, обновляющая таблицу ТоварыСвод
&НаСервере
Процедура КАНАТ_ОбновитьТоварыСвод()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ТаблицаТовары.Вес КАК Вес,
	|	ТаблицаТовары.Количество КАК Количество,
	|	ТаблицаТовары.Серия КАК Серия
	|ПОМЕСТИТЬ ВТБезГруппировки
	|ИЗ
	|	&Таблица КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.УпаковочныйЛист = ЗНАЧЕНИЕ(Документ.УпаковочныйЛист.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТовары.Номенклатура КАК НоменклатураСсылка,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	СУММА(ТаблицаТовары.Вес) КАК Вес,
	|	СУММА(ТаблицаТовары.Количество) КАК Количество,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТаблицаТовары.Серия) КАК Серия
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	ВТБезГруппировки КАК ТаблицаТовары
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТовары.Номенклатура,
	|	ТаблицаТовары.Характеристика
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Код КАК Код,
	|	ВТ.НоменклатураСсылка КАК НоменклатураСсылка,
	|	ВТ.Характеристика КАК ХарактеристикаСсылка,
	|	ВТ.Количество КАК Количество,
	|	ВТ.Вес КАК Вес,
	|	Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТ.Серия КАК Серии
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ПО ВТ.Характеристика = ХарактеристикиНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО ВТ.НоменклатураСсылка = Номенклатура.Ссылка";
	
	Запрос.УстановитьПараметр("Таблица", Объект.Товары.Выгрузить());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Счетчик = 0;
	
	ЭтотОбъект.КАНАТ_ТЗСводТоваров.Очистить();
	
	Пока Выборка.Следующий() Цикл
		
		Счетчик = Счетчик + 1;
		
		Строка = ЭтотОбъект.КАНАТ_ТЗСводТоваров.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, Выборка);
		Строка.Номер = Счетчик;
		
	КонецЦикла;
	
КонецПроцедуры 


&НаКлиенте
&ИзменениеИКонтроль("ОткрытьПодборСерийЗавершение")
Процедура КАНАТ_ОткрытьПодборСерийЗавершение(Результат, ДополнительныеПараметры)

	ПараметрыФормыУказанияСерий = ДополнительныеПараметры.ПараметрыФормыУказанияСерий;


	ЗначениеВозврата = Результат;

	Если ЗначениеВозврата <> Неопределено Тогда
		ОбработатьУказаниеСерийСервер(ПараметрыФормыУказанияСерий);
	КонецЕсли;
    #Вставка
	//БИТ_Ларионов_Баг в приходном ордере не встают серии? +++  
	КАНАТ_ОбработатьВозвратСерий(ЗначениеВозврата,ПараметрыФормыУказанияСерий.Номенклатура,ПараметрыФормыУказанияСерий.Характеристика,ПараметрыФормыУказанияСерий.Количество);
	//БИТ_Ларионов_Баг в приходном ордере не встают серии? ---
	#КонецВставки
КонецПроцедуры
//-- Гурьев 30.08.23      

Процедура КАНАТ_ОбработатьВозвратСерий(Адрес,Ном,Хар,Колво)
	//Выгрузка = Объект.Товары.Выгрузить();
	//Выгрузка.Свернуть("Номенклатура,Характеристика,");
	//Значение = ПолучитьИзВременногоХранилища(Адрес);      
	//Стр = Выгрузка.НайтиСтроки(Новый Структура("Номенклатура,Характеристика",Ном,Хар));
	//Стр[0].Серия = Значение[0].Серия;  
	//Объект.Товары.Загрузить(Выгрузка);
КонецПроцедуры	

&НаКлиенте
&ИзменениеИКонтроль("ОткрытьПодборСерий")
Процедура КАНАТ_ОткрытьПодборСерий(Текст, ТекущиеДанные)

	Если НоменклатураКлиент.ДляУказанияСерийНуженСерверныйВызов(ЭтаФорма, ПараметрыУказанияСерий, Текст, ТекущиеДанные)Тогда

		Если ТекущиеДанные = Неопределено Тогда
			ТекущиеДанныеИдентификатор = Элементы.Товары.ТекущиеДанные.ПолучитьИдентификатор();
		Иначе
			ТекущиеДанныеИдентификатор = ТекущиеДанные.ПолучитьИдентификатор();
		КонецЕсли;

		ПараметрыФормыУказанияСерий = ПараметрыФормыУказанияСерий(ТекущиеДанныеИдентификатор);

		ЗначениеВозврата = Неопределено;

		ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьПодборСерийЗавершение",
		ЭтотОбъект,
		Новый Структура("ПараметрыФормыУказанияСерий", ПараметрыФормыУказанияСерий));
        #Вставка
		#КонецВставки
		ОткрытьФорму(ПараметрыФормыУказанияСерий.ИмяФормы,
		ПараметрыФормыУказанияСерий,
		ЭтаФорма
		,
		,
		,
		,
		ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	КонецЕсли;

КонецПроцедуры
