
&НаСервере
Процедура КАНАТ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//++ Гурьев 29.08.23 Создание новых элементов формы для отображения свода товаров
	
	СтраницаСводТоваров = Элементы.Добавить(
		"КАНАТ_СтраницаСводТоваров",
		Тип("ГруппаФормы"),
		Элементы.ГруппаСтраницы);
	СтраницаСводТоваров.Вид = ВидГруппыФормы.Страница;
	СтраницаСводТоваров.Заголовок = "Товары свод";
	
	ДобавляемыеРеквизиты = Новый Массив;
	//Таблица Товары Свод
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("КАНАТ_ТЗСводТоваров",
															 Новый ОписаниеТипов("ТаблицаЗначений")));
	
	//Колонки
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Номер",
															 Новый ОписаниеТипов("Число"),
															 "КАНАТ_ТЗСводТоваров",
															 "№"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Код",
															 Новый ОписаниеТипов("Строка"),
															 "КАНАТ_ТЗСводТоваров",
															 "Код"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("НоменклатураСсылка",
															 Новый ОписаниеТипов("СправочникСсылка.Номенклатура"),
															 "КАНАТ_ТЗСводТоваров",
															 "Номенклатура"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ХарактеристикаСсылка",
															 Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"),
															 "КАНАТ_ТЗСводТоваров",
															 "Характеристика"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Количество",
															 Новый ОписаниеТипов("Число"),
															 "КАНАТ_ТЗСводТоваров",
															 "Количество"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Вес",
															 Новый ОписаниеТипов("Число"),
															 "КАНАТ_ТЗСводТоваров",
															 "Вес"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ЕдиницаИзмерения",
															 Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"),
															 "КАНАТ_ТЗСводТоваров",
															 "Ед. изм."));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Серии",
															 Новый ОписаниеТипов("Число"),
															 "КАНАТ_ТЗСводТоваров",
															 "Мест"));
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	//Элементы формы Свод Таблица
	ТаблицаФормы = Элементы.Добавить("КАНАТ_ТЗСводТоваров", Тип("ТаблицаФормы"), Элементы.КАНАТ_СтраницаСводТоваров);
	ТаблицаФормы.ПутьКДанным = "КАНАТ_ТЗСводТоваров"; 
	ТаблицаФормы.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	ТаблицаФормы.ТолькоПросмотр = Истина;
	
	НоваяКолонка = Элементы.Добавить("КАНАТ_ТЗСводТоваровНомер", Тип("ПолеФормы"), Элементы.КАНАТ_ТЗСводТоваров); 
	НоваяКолонка.Заголовок = "№"; 
	НоваяКолонка.ПутьКДанным = "КАНАТ_ТЗСводТоваров.Номер";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	
	НоваяКолонка = Элементы.Добавить("КАНАТ_ТЗСводТоваровКод", Тип("ПолеФормы"), Элементы.КАНАТ_ТЗСводТоваров); 
	НоваяКолонка.Заголовок = "Код"; 
	НоваяКолонка.ПутьКДанным = "КАНАТ_ТЗСводТоваров.Код";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	
	НоваяКолонка = Элементы.Добавить("КАНАТ_ТЗСводТоваровНоменклатура", Тип("ПолеФормы"), Элементы.КАНАТ_ТЗСводТоваров); 
	НоваяКолонка.Заголовок = "Номенклатура"; 
	НоваяКолонка.ПутьКДанным = "КАНАТ_ТЗСводТоваров.НоменклатураСсылка";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	
	НоваяКолонка = Элементы.Добавить("КАНАТ_ТЗСводТоваровХарактеристика", Тип("ПолеФормы"), Элементы.КАНАТ_ТЗСводТоваров); 
	НоваяКолонка.Заголовок = "Характеристика"; 
	НоваяКолонка.ПутьКДанным = "КАНАТ_ТЗСводТоваров.ХарактеристикаСсылка";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	
	НоваяКолонка = Элементы.Добавить("КАНАТ_ТЗСводТоваровКоличество", Тип("ПолеФормы"), Элементы.КАНАТ_ТЗСводТоваров); 
	НоваяКолонка.Заголовок = "Количество"; 
	НоваяКолонка.ПутьКДанным = "КАНАТ_ТЗСводТоваров.Количество";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	
	НоваяКолонка = Элементы.Добавить("КАНАТ_ТЗСводТоваровВес", Тип("ПолеФормы"), Элементы.КАНАТ_ТЗСводТоваров); 
	НоваяКолонка.Заголовок = "Вес"; 
	НоваяКолонка.ПутьКДанным = "КАНАТ_ТЗСводТоваров.Вес";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	
	НоваяКолонка = Элементы.Добавить("КАНАТ_ТЗСводТоваровЕдиницаИзмерения", Тип("ПолеФормы"), Элементы.КАНАТ_ТЗСводТоваров); 
	НоваяКолонка.Заголовок = "Ед. изм."; 
	НоваяКолонка.ПутьКДанным = "КАНАТ_ТЗСводТоваров.ЕдиницаИзмерения";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	
	НоваяКолонка = Элементы.Добавить("КАНАТ_ТЗСводТоваровНомерСерии", Тип("ПолеФормы"), Элементы.КАНАТ_ТЗСводТоваров); 
	НоваяКолонка.Заголовок = "Мест"; 
	НоваяКолонка.ПутьКДанным = "КАНАТ_ТЗСводТоваров.Серии";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	
	КАНАТ_ОбновитьТоварыСвод();
	
	КАНАТ_ОбновитьТоварыСвод();
	
	//-- Гурьев 30.08.23
КонецПроцедуры

&НаКлиенте
Процедура КАНАТ_ГруппаСтраницыПриСменеСтраницыПосле(Элемент, ТекущаяСтраница)
	//++ Гурьев 30.08.23 Обновление свода товаров при смене страницы
	Если ТекущаяСтраница.Имя = "КАНАТ_СтранциаСводТоваров" Тогда
		КАНАТ_ОбновитьТоварыСвод();
	КонецЕсли;
	//-- Гурьев 30.08.23
КонецПроцедуры

//++ Гурьев 30.08.23 Процедура, обновляющая таблицу ТоварыСвод
&НаСервере
Процедура КАНАТ_ОбновитьТоварыСвод()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ТаблицаТовары.Вес КАК Вес,
	|	ТаблицаТовары.Количество КАК Количество,
	|	ТаблицаТовары.Серия КАК Серия
	|ПОМЕСТИТЬ ВТБезГруппировки
	|ИЗ
	|	&Таблица КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.УпаковочныйЛист = ЗНАЧЕНИЕ(Документ.УпаковочныйЛист.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТовары.Номенклатура КАК НоменклатураСсылка,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	СУММА(ТаблицаТовары.Вес) КАК Вес,
	|	СУММА(ТаблицаТовары.Количество) КАК Количество,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТаблицаТовары.Серия) КАК Серия
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	ВТБезГруппировки КАК ТаблицаТовары
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТовары.Номенклатура,
	|	ТаблицаТовары.Характеристика
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Код КАК Код,
	|	ВТ.НоменклатураСсылка КАК НоменклатураСсылка,
	|	ВТ.Характеристика КАК ХарактеристикаСсылка,
	|	ВТ.Количество КАК Количество,
	|	ВТ.Вес КАК Вес,
	|	Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТ.Серия КАК Серии
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ПО ВТ.Характеристика = ХарактеристикиНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО ВТ.НоменклатураСсылка = Номенклатура.Ссылка";
	
	Запрос.УстановитьПараметр("Таблица", Объект.Товары.Выгрузить());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Счетчик = 0;
	
	ЭтотОбъект.КАНАТ_ТЗСводТоваров.Очистить();
	
	Пока Выборка.Следующий() Цикл
		
		Счетчик = Счетчик + 1;
		
		Строка = ЭтотОбъект.КАНАТ_ТЗСводТоваров.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, Выборка);
		Строка.Номер = Счетчик;
		
	КонецЦикла;
	
КонецПроцедуры 
//-- Гурьев 30.08.23
