
//&Вместо("ПродукцияИПолуфабрикатыДляФормированияЭтапов")
//Функция КАНАТ_ПродукцияИПолуфабрикатыДляФормированияЭтапов(МенеджерВременныхТаблиц)
//	Запрос = Новый Запрос(
//	"ВЫБРАТЬ
//	|	Таблица.Распоряжение КАК Распоряжение,
//	|	
//	|	Таблица.НазначениеПродукция КАК НазначениеПродукция,
//	|	Таблица.НазначениеМатериалы КАК НазначениеМатериалы,
//	|	
//	|	Таблица.Номенклатура   КАК Номенклатура,
//	|	Таблица.Характеристика КАК Характеристика,
//	|
//	|	Таблица.Отправитель    КАК Отправитель,
//	|	Таблица.Получатель     КАК Получатель,
//	|	
//	|	Таблица.ЭтапИсточник   КАК ЭтапИсточник,
//	|	Таблица.Назначение     КАК Назначение,
//	|	
//	|	Таблица.Спецификация   КАК Спецификация,
//	|
//	|	Таблица.СписатьНаРасходы         КАК СписатьНаРасходы,
//	|	Таблица.СтатьяРасходов           КАК СтатьяРасходов,
//	|	Таблица.АналитикаРасходов        КАК АналитикаРасходов,
//	|	Таблица.АналитикаАктивовПассивов КАК АналитикаАктивовПассивов,
//	|	
//	|	Таблица.НомерСтроки    КАК НомерСтроки,
//	|	
//	|	Таблица.Количество     КАК Количество,
//	|	
//	|	ВЫРАЗИТЬ(Таблица.Распоряжение КАК Документ.ЗаказНаПроизводство2_2).НачатьНеРанее           КАК ДатаЗапуска,
//	|	ВЫРАЗИТЬ(Таблица.Распоряжение КАК Документ.ЗаказНаПроизводство2_2).ДатаПотребности         КАК ДатаВыпуска,
//	|	ВЫРАЗИТЬ(Таблица.Распоряжение КАК Документ.ЗаказНаПроизводство2_2).РазмещениеВыпуска       КАК РазмещениеВыпуска,
//	|	ВЫРАЗИТЬ(Таблица.Распоряжение КАК Документ.ЗаказНаПроизводство2_2).НаправлениеДеятельности КАК НаправлениеДеятельности,
//	|	ВЫРАЗИТЬ(Таблица.Распоряжение КАК Документ.ЗаказНаПроизводство2_2).Подразделение           КАК ПодразделениеДиспетчер,
//	|
//	|	Таблица.ЭтапИсточник <> ЗНАЧЕНИЕ(Документ.ЭтапПроизводства2_2.ПустаяСсылка)                КАК ОбособитьПодРазобрку,
//	|//++ Гурьев 13.09.23 Добавление комментария к заказу
//	|	ЕСТЬNULL(Продукция.КАНАТ_КомментарийКЗаказу, """") КАК КАНАТ_КомментарийКЗаказу,
//	|	ЕСТЬNULL(Продукция.КАНАТ_Сертификат, """") КАК КАНАТ_Сертификат
//	|//-- Гурьев 13.09.23
//	|ИЗ
//	|	ВтДанныеДляФормированияЭтапов КАК Таблица
//	|//++ Гурьев 13.09.23 Добавление комментария к заказу
//	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаПроизводство2_2.Продукция КАК Продукция
//	|	ПО (Продукция.Ссылка = Таблица.Распоряжение
//	|		И Продукция.НомерСтроки = Таблица.НомерСтроки)
//	|//-- Гурьев 13.09.23
//	|	
//	|ГДЕ
//	|	Таблица.Спецификация <> ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)
//	|");
//	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
//	
//	Возврат Запрос.Выполнить().Выгрузить();
//	
//КонецФункции

&ИзменениеИКонтроль("ДобавитьКомандыСозданияНаОсновании")
Процедура КАНАТ_ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры)

	Документы.ВыработкаСотрудников.ДобавитьКомандуСоздатьНаОснованииСозданиеВыработкиСотрудников(КомандыСозданияНаОсновании);
    #Удаление
	Команда = Документы.ДвижениеПродукцииИМатериалов.ДобавитьКомандуСоздатьПередачуВПроизводствоНаОснованииЗаказа(КомандыСозданияНаОсновании);
	Если Команда <> Неопределено Тогда
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(Команда, "ПроизводствоНаСтороне", Ложь, ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;
    #КонецУдаления
	#Вставка
	//БИТ_Гурьев_ЧТЗ_3.7_06.03.24++
	Если Пользователи.ЭтоПолноправныйПользователь() Тогда
		
		Команда = Документы.ДвижениеПродукцииИМатериалов.ДобавитьКомандуСоздатьПередачуВПроизводствоНаОснованииЗаказа(КомандыСозданияНаОсновании);
		Если Команда <> Неопределено Тогда
			ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(Команда, "ПроизводствоНаСтороне", Ложь, ВидСравненияКомпоновкиДанных.Равно);
		КонецЕсли;
		
	КонецЕсли;
	Документы.КАНАТ_РезультатИспытаний.ДобавитьКомандуСоздатьРезультатИспытаний(КомандыСозданияНаОсновании);
	//БИТ_Гурьев_ЧТЗ_3.7_06.03.24--
	#КонецВставки
	Команда = Документы.ДвижениеПродукцииИМатериалов.ДобавитьКомандуСоздатьВозвратИзПроизводстваНаОснованииЗаказа(КомандыСозданияНаОсновании);
	Если Команда <> Неопределено Тогда
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(Команда, "ПроизводствоНаСтороне", Ложь, ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;

	Документы.РасходныйОрдерНаТовары.ДобавитьКомандуСоздатьНаОснованииРасходныйОрдерНаТовары(КомандыСозданияНаОсновании);

	Документы.ДвижениеПродукцииИМатериалов.ДобавитьКомандуСоздатьПередачуИзПроизводстваНаОснованииЗаказа(КомандыСозданияНаОсновании);

	Документы.КорректировкаНазначенияТоваров.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);

	Документы.АктВыполненныхВнутреннихРабот.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);

	Документы.ПлановаяКалькуляция2_2.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);

	Команда = Документы.ПроизводственнаяОперация2_2.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Если Команда <> Неопределено Тогда
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(Команда, "ПроизводствоНаСтороне", Ложь, ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;

	Команда = Документы.ЗаказПоставщику.ДобавитьКомандуСоздатьОбеспечивающийЗаказ(КомандыСозданияНаОсновании);
	Если Команда <> Неопределено Тогда
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(Команда, "ПроизводствоНаСтороне", Ложь, ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;

	Команда = Документы.ЗаказПоставщику.ДобавитьКомандуСоздатьНаОснованииЗаказыПоставщикам(КомандыСозданияНаОсновании);
	Если Команда <> Неопределено Тогда
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(Команда, "ПроизводствоНаСтороне", Ложь, ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;

	Команда = Обработки.СправочноеРазмещениеНоменклатуры.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);

	Если Команда <> Неопределено Тогда
		СтатусыДокумента = Новый Массив;
		СтатусыДокумента.Добавить(Перечисления.СтатусыЭтаповПроизводства2_2.Сформирован);
		СтатусыДокумента.Добавить(Перечисления.СтатусыЭтаповПроизводства2_2.КВыполнению);
		СтатусыДокумента.Добавить(Перечисления.СтатусыЭтаповПроизводства2_2.Начат);
		СтатусыДокумента.Добавить(Перечисления.СтатусыЭтаповПроизводства2_2.Завершен);

		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(Команда,
		"Статус",
		СтатусыДокумента,
		ВидСравненияКомпоновкиДанных.ВСписке);
	КонецЕсли;

	БизнесПроцессы.Задание.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);

	ЭтапПроизводства2_2Локализация.ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры);

КонецПроцедуры

&ИзменениеИКонтроль("ПродукцияИПолуфабрикатыДляФормированияЭтапов")
Функция КАНАТ_ПродукцияИПолуфабрикатыДляФормированияЭтапов1(МенеджерВременныхТаблиц)

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Таблица.Распоряжение КАК Распоряжение,
	|	
	|	Таблица.НазначениеПродукция КАК НазначениеПродукция,
	|	Таблица.НазначениеМатериалы КАК НазначениеМатериалы,
	|	
	|	Таблица.Номенклатура   КАК Номенклатура,
	|	Таблица.Характеристика КАК Характеристика,
	|
	|	Таблица.Отправитель    КАК Отправитель,
	|	Таблица.Получатель     КАК Получатель,
	|	
	|	Таблица.ЭтапИсточник   КАК ЭтапИсточник,
	|	Таблица.Назначение     КАК Назначение,
	|	
	|	Таблица.Спецификация   КАК Спецификация,
	|
	|	Таблица.СписатьНаРасходы         КАК СписатьНаРасходы,
	|	Таблица.СтатьяРасходов           КАК СтатьяРасходов,
	|	Таблица.АналитикаРасходов        КАК АналитикаРасходов,
	|	Таблица.АналитикаАктивовПассивов КАК АналитикаАктивовПассивов,
	|	
	|	Таблица.НомерСтроки    КАК НомерСтроки,
	|	
	|	Таблица.Количество     КАК Количество,
	|	
	|	ВЫРАЗИТЬ(Таблица.Распоряжение КАК Документ.ЗаказНаПроизводство2_2).НачатьНеРанее           КАК ДатаЗапуска,
	|	ВЫРАЗИТЬ(Таблица.Распоряжение КАК Документ.ЗаказНаПроизводство2_2).ДатаПотребности         КАК ДатаВыпуска,
	|	ВЫРАЗИТЬ(Таблица.Распоряжение КАК Документ.ЗаказНаПроизводство2_2).РазмещениеВыпуска       КАК РазмещениеВыпуска,
	|	ВЫРАЗИТЬ(Таблица.Распоряжение КАК Документ.ЗаказНаПроизводство2_2).НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ВЫРАЗИТЬ(Таблица.Распоряжение КАК Документ.ЗаказНаПроизводство2_2).Подразделение           КАК ПодразделениеДиспетчер,
	|
	|	Таблица.ЭтапИсточник <> ЗНАЧЕНИЕ(Документ.ЭтапПроизводства2_2.ПустаяСсылка)                КАК ОбособитьПодРазобрку 
	#Вставка
	|	,
	|//++ Гурьев 13.09.23 Добавление комментария к заказу
	|	ЕСТЬNULL(Продукция.КАНАТ_КомментарийКЗаказу, """") КАК КАНАТ_КомментарийКЗаказу,
	|	ЕСТЬNULL(Продукция.КАНАТ_Сертификат, """") КАК КАНАТ_Сертификат
	|//-- Гурьев 13.09.23
	|
	#КонецВставки
	|ИЗ
	|	ВтДанныеДляФормированияЭтапов КАК Таблица
	#Вставка
	|//++ Гурьев 13.09.23 Добавление комментария к заказу
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаПроизводство2_2.Продукция КАК Продукция
	|	ПО (Продукция.Ссылка = Таблица.Распоряжение
	|		И Продукция.НомерСтроки = Таблица.НомерСтроки)
	|//-- Гурьев 13.09.23
	#КонецВставки
	|	
	|ГДЕ
	|	Таблица.Спецификация <> ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)
	|");
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции
