
&НаКлиенте
Процедура Печать(Команда)
	
	ТабличныйДокумент = СформироватьТабличныйДокумент();
	
	Идентификатор = "ОтчетГособоронзаказПериод";
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(Идентификатор);
	
	КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокумент;
	КоллекцияПечатныхФорм[0].Экземпляров = 1;
	КоллекцияПечатныхФорм[0].СинонимМакета = "Отчет о реализации по гособоронзаказам за период";
	
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,Неопределено,ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция СформироватьТабличныйДокумент()
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.КАНАТ_ПоступлениеДСПоГосконтракту.КАНАТ_ПоступлениеДСПоГосКонтракту");
	
	//Шапка
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	
	ДанныеШапки = Новый Структура;
	ДанныеШапки.Вставить("Организация", БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация"));
	ДанныеШапки.Вставить("НачалоПериода", Формат(Период.ДатаНачала,"ДФ=dd.MM.yy"));
	ДанныеШапки.Вставить("КонецПериода", Формат(Период.ДатаОкончания,"ДФ=dd.MM.yy"));
	
	ОбластьШапка.Параметры.Заполнить(ДанныеШапки);
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	
	//Таблица
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ОбластьШапкаТаблицы");
	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА СчетНаОплату.Ссылка ЕСТЬ NULL
	|			ТОГДА ПоступлениеБезналичныхДС.ОбъектРасчетов
	|		ИНАЧЕ СчетНаОплату.ДоговорИзСчета
	|	КОНЕЦ КАК ДоговорДляРасчетов,
	|	ПоступлениеБезналичныхДС.ДатаПлатежногоПоручения КАК ДатаПлатежногоПоручения,
	|	ПоступлениеБезналичныхДС.НомерПлатежногоПоручения КАК НомерПлатежногоПоручения,
	|	ПоступлениеБезналичныхДС.СуммаПлатежногоПоручения КАК СуммаПлатежногоПоручения,
	|	ПоступлениеБезналичныхДС.ВалютаПлатежногоПоручения КАК ВалютаПлатежногоПоручения,
	|	СчетНаОплату.Дата КАК ДатаСчетаНаОплату,
	|	СчетНаОплату.Номер КАК НомерСчетаНаОплату,
	|	СчетНаОплату.СуммаДокумента КАК СуммаСчетаНаОплату,
	|	СчетНаОплату.Валюта КАК ВалютаСчетаНаОплату
	|ПОМЕСТИТЬ ВтСчетовИОплат
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.ОснованиеПлатежа КАК СсылкаДляСвязи,
	|		ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Дата КАК ДатаПлатежногоПоручения,
	|		ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Номер КАК НомерПлатежногоПоручения,
	|		ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.СуммаДокумента КАК СуммаПлатежногоПоручения,
	|		ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Валюта КАК ВалютаПлатежногоПоручения,
	|		ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.ОбъектРасчетов.Договор КАК ОбъектРасчетов
	|	ИЗ
	|		Документ.ПоступлениеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа
	|	ГДЕ
	|		ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.НомерСтроки = 1
	|		И ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Проведен) КАК ПоступлениеБезналичныхДС
	|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СчетНаОплатуКлиенту.Ссылка КАК Ссылка,
	|			СчетНаОплатуКлиенту.Номер КАК Номер,
	|			СчетНаОплатуКлиенту.Дата КАК Дата,
	|			СчетНаОплатуКлиенту.СуммаДокумента КАК СуммаДокумента,
	|			СчетНаОплатуКлиенту.Валюта КАК Валюта,
	|			СчетНаОплатуКлиенту.ДокументОснование КАК ДокументОснование,
	|			СчетНаОплатуКлиенту.Договор КАК ДоговорИзСчета
	|		ИЗ
	|			Документ.СчетНаОплатуКлиенту КАК СчетНаОплатуКлиенту
	|		ГДЕ
	|			СчетНаОплатуКлиенту.Проведен) КАК СчетНаОплату
	|		ПО ПоступлениеБезналичныхДС.СсылкаДляСвязи = СчетНаОплату.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Плательщик,
	|	ЕСТЬNULL(ГосударственныеКонтракты.Ссылка, ЗНАЧЕНИЕ(Справочник.ГосударственныеКонтракты.ПустаяСсылка)) КАК Госконтракт,
	|	ЕСТЬNULL(ГосударственныеКонтракты.НомерИГК, """") КАК НомерИГК,
	|	ДоговорыКонтрагентов.Сумма КАК СуммаКонтракта,
	|	ЕСТЬNULL(ВтСчетовИОплат.ДатаСчетаНаОплату, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаСчетаНаОплату,
	|	ЕСТЬNULL(ВтСчетовИОплат.НомерСчетаНаОплату, """") КАК НомерСчетаНаОплату,
	|	ЕСТЬNULL(ВтСчетовИОплат.СуммаСчетаНаОплату, 0) КАК СуммаСчетаНаОплату,
	|	ЕСТЬNULL(ВтСчетовИОплат.ВалютаСчетаНаОплату, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) КАК ВалютаСчетаНаОплату,
	|	ЕСТЬNULL(ВтСчетовИОплат.ДатаПлатежногоПоручения, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПлатежногоПоручения,
	|	ЕСТЬNULL(ВтСчетовИОплат.НомерПлатежногоПоручения, """") КАК НомерПлатежногоПоручения,
	|	ЕСТЬNULL(ВтСчетовИОплат.СуммаПлатежногоПоручения, 0) КАК СуммаПлатежногоПоручения,
	|	ЕСТЬNULL(ВтСчетовИОплат.ВалютаПлатежногоПоручения, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) КАК ВалютаПлатежногоПоручения,
	|	ДоговорыКонтрагентов.Ссылка КАК ДоговорыКонтрагентов
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГосударственныеКонтракты КАК ГосударственныеКонтракты
	|		ПО ДоговорыКонтрагентов.ГосударственныйКонтракт = ГосударственныеКонтракты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ДоговорыКонтрагентов.Контрагент = Контрагенты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтСчетовИОплат КАК ВтСчетовИОплат
	|		ПО ДоговорыКонтрагентов.Ссылка = ВтСчетовИОплат.ДоговорДляРасчетов
	|ГДЕ
	|	НЕ ДоговорыКонтрагентов.ПометкаУдаления
	|	И ДоговорыКонтрагентов.ДоговорСУчастникомГОЗ
	|	И (ДоговорыКонтрагентов.ДатаНачалаДействия МЕЖДУ &НачалоПериода И &КонецПериода
	|			ИЛИ НЕ &ИспользоватьПериод)
	|	И (Контрагенты.Ссылка = &Плательщик
	|			ИЛИ НЕ &ИспользоватьПлательщик)
	|	И (ГосударственныеКонтракты.Ссылка = &Госконтракт
	|			ИЛИ НЕ &ИспользоватьГосконтракт)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДоговорыКонтрагентов.ДатаНачалаДействия
	|ИТОГИ
	|	СУММА(СуммаКонтракта),
	|	СУММА(СуммаСчетаНаОплату),
	|	СУММА(СуммаПлатежногоПоручения)
	|ПО
	|	ОБЩИЕ,
	|	ДоговорыКонтрагентов";
	
	Запрос.УстановитьПараметр("Госконтракт"					,Госконтракт);
	Запрос.УстановитьПараметр("ЗаказКлиента"				,ЗаказКлиента);
	Запрос.УстановитьПараметр("ИспользоватьПериод"			,ИспользоватьПериод);
	Запрос.УстановитьПараметр("ИспользоватьГосконтракт"		,ИспользоватьГосконтракт);
	Запрос.УстановитьПараметр("ИспользоватьЗаказКлиента"	,ИспользоватьЗаказКлиента);
	Запрос.УстановитьПараметр("ИспользоватьПлательщик"		,ИспользоватьПлательщик);
	Запрос.УстановитьПараметр("КонецПериода"				,Период.ДатаОкончания);
	Запрос.УстановитьПараметр("НачалоПериода"				,Период.ДатаНачала);
	Запрос.УстановитьПараметр("Плательщик"					,Плательщик);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаОбщийИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВыборкаОбщийИтог.Следующий();		// Общий итог
	
	// Вставить обработку выборки ВыборкаОбщийИтог
	
	ВыборкаДоговорыКонтрагентов = ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДоговорыКонтрагентов.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДоговорыКонтрагентов
		
		ВыборкаДетальные = ВыборкаДоговорыКонтрагентов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Счетчик = 1;
		Пока ВыборкаДетальные.Следующий() Цикл
			ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("ОбластьТаблица");
			ЗаполнитьЗначенияСвойств(ОбластьСтрокаТаблицы.Параметры,ВыборкаДетальные);
			ОбластьСтрокаТаблицы.Параметры.НомерСтроки = Счетчик;
			
			ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);
			Счетчик	= Счетчик + 1;
		КонецЦикла;
	КонецЦикла;
	
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//ИтогоСуммаДоговор		= 0;
	//ИтогоСуммаСФ			= 0;
	//ИтогоСуммаРеализации	= 0;
	//Счетчик = 1;
	//
	//Пока Выборка.Следующий() Цикл
	//	
	//	ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("ОбластьТаблица");
	//	
	//	ДанныеСтроки = Новый Структура;
	//	ДанныеСтроки.Вставить("ПП",             Счетчик);
	//	ДанныеСтроки.Вставить("Номер",          Выборка.Номер);
	//	ДанныеСтроки.Вставить("Дата",           Выборка.Дата);
	//	ДанныеСтроки.Вставить("Плательщик",     Выборка.Плательщик);
	//	ДанныеСтроки.Вставить("СуммаКонтракта", Выборка.СуммаКонтракта);
	//	ДанныеСтроки.Вставить("СуммаСФ",        Выборка.СуммаПоСчетуФактуре);
	//	ДанныеСтроки.Вставить("Госконтракт",    Выборка.Представление);
	//	ДанныеСтроки.Вставить("ИГК",            Выборка.НомерИГК);
	//	ДанныеСтроки.Вставить("НомерРеализации",Выборка.НомерРеализации);
	//	ДанныеСтроки.Вставить("ДатаРеализации", Формат(Выборка.ДатаРеализации,"ДФ=dd.MM.yyyy"));
	//	ДанныеСтроки.Вставить("СуммаРеализации",Выборка.СуммаРеализации);
	//	
	//	ОбластьСтрокаТаблицы.Параметры.Заполнить(ДанныеСтроки);
	//	ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);
	//	
	//	Счетчик					= Счетчик + 1;
	//	ИтогоСуммаДоговор		= ИтогоСуммаДоговор + Выборка.СуммаКонтракта;
	//	ИтогоСуммаСФ			= ИтогоСуммаСФ + Выборка.СуммаПоСчетуФактуре;
	//	ИтогоСуммаРеализации	= ИтогоСуммаРеализации+ Выборка.СуммаРеализации;
	//КонецЦикла;
	
	ОбластьТаблицаПодвал = Макет.ПолучитьОбласть("ОбластьТаблицаПодвал");
	ЗаполнитьЗначенияСвойств(ОбластьТаблицаПодвал.Параметры,ВыборкаОбщийИтог);
	ТабличныйДокумент.Вывести(ОбластьТаблицаПодвал);
	
	//Подвал
	ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодвал");
	ДанныеПодвал = Новый Структура;
	ДанныеПодвал.Вставить("Пользователь", Пользователи.ТекущийПользователь());
	ДанныеПодвал.Вставить("Дата", ТекущаяДата());
	
	ОбластьПодвал.Параметры.Заполнить(ДанныеПодвал);
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИзменитьДоступностьЭлементов();
КонецПроцедуры

&НаСервере
Процедура ИзменитьДоступностьЭлементов()
	
	Если ИспользоватьГосконтракт Тогда
		Элементы.Госконтракт.Доступность = Истина;
	Иначе
		Госконтракт = Справочники.ГосударственныеКонтракты.ПустаяСсылка();
		Элементы.Госконтракт.Доступность = Ложь;
	КонецЕсли;
	
	Если ИспользоватьПлательщик Тогда
		Элементы.Плательщик.Доступность = Истина;
	Иначе
		Плательщик = Справочники.Контрагенты.ПустаяСсылка();
		Элементы.Плательщик.Доступность = Ложь;
	КонецЕсли;
	
	Если ИспользоватьЗаказКлиента Тогда
		Элементы.ЗаказКлиента.Доступность = Истина;
	Иначе
		Плательщик = Документы.ЗаказКлиента.ПустаяСсылка();
		Элементы.ЗаказКлиента.Доступность = Ложь;
	КонецЕсли;
	
	Если ИспользоватьПериод Тогда
		Элементы.Период.Доступность = Истина;
	Иначе
		Период.ДатаНачала= Дата("00010101");
		Период.ДатаОкончания = ТекущаяДата();
		Элементы.Период.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПериодПриИзменении(Элемент)
	ИзменитьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПлательщикПриИзменении(Элемент)
	ИзменитьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьГосконтрактПриИзменении(Элемент)
	ИзменитьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьЗаказКлиентаПриИзменении(Элемент)
	ИзменитьДоступностьЭлементов();
КонецПроцедуры


