
// <+БИТ> Руденков_Е.И. 25.02.2024 
// #000000159, Распоряжение на отгрузку и пропуск по выезд
&НаСервере
&ИзменениеИКонтроль("ВывестиРодительскиеОбъекты")
Процедура КАНАТ_ВывестиРодительскиеОбъекты(ТекущийОбъект, ДеревоРодитель, ВыведенныеОбъекты, СлужебныеОбъекты, ИндексСвязейОбъектов)

	МетаданныеОбъекта = ТекущийОбъект.Метаданные();
	СписокРеквизитов  = Новый Массив;

	Если СлужебныеОбъекты = Неопределено Тогда 
		СлужебныеОбъекты = Новый Соответствие;
	КонецЕсли;

	Если ИндексСвязейОбъектов = Неопределено Тогда 
		ИндексСвязейОбъектов = Новый Соответствие;
	КонецЕсли;

	Для Каждого Реквизит Из МетаданныеОбъекта.Реквизиты Цикл
		#Удаление
		Если Не Метаданные.КритерииОтбора.СвязанныеДокументы.Состав.Содержит(Реквизит) Тогда
			Продолжить;
		КонецЕсли;
		#КонецУдаления
		
		#Вставка 
		Если Не Метаданные.КритерииОтбора.СвязанныеДокументы.Состав.Содержит(Реквизит)
			И Не Метаданные.КритерииОтбора.КАНАТ_СвязанныеДокументыПроизводстваИРеализаций.Состав.Содержит(Реквизит) Тогда
			Продолжить;
		КонецЕсли;
		#КонецВставки

		Для Каждого ТекущийТип Из Реквизит.Тип.Типы() Цикл

			МетаданныеРеквизита = МетаданныеТипаРеквизита(ТекущийТип);
			Если МетаданныеРеквизита.Метаданные = Неопределено Тогда
				Продолжить;
			КонецЕсли;

			ЗначениеРеквизита = ТекущийОбъект[Реквизит.Имя];
			Если ЗначениеЗаполнено(ЗначениеРеквизита)
				И ТипЗнч(ЗначениеРеквизита) = ТекущийТип
				И ЗначениеРеквизита <> ТекущийОбъект
				И СписокРеквизитов.Найти(ЗначениеРеквизита) = Неопределено Тогда

				СписокРеквизитов.Добавить(ЗначениеРеквизита);
			КонецЕсли;
		КонецЦикла;

	КонецЦикла;

	Для Каждого ТабличнаяЧасть Из МетаданныеОбъекта.ТабличныеЧасти Цикл

		ИменаРеквизитов = "";
		СодержимоеТЧ = ТекущийОбъект[ТабличнаяЧасть.Имя].Выгрузить(); // ТаблицаЗначений
		Для Каждого Реквизит Из ТабличнаяЧасть.Реквизиты Цикл
			#Удаление
			Если Не Метаданные.КритерииОтбора.СвязанныеДокументы.Состав.Содержит(Реквизит) Тогда
				Продолжить;
			КонецЕсли;
			#КонецУдаления
			
			#Вставка 
			Если Не Метаданные.КритерииОтбора.СвязанныеДокументы.Состав.Содержит(Реквизит)
				И Не Метаданные.КритерииОтбора.КАНАТ_СвязанныеДокументыПроизводстваИРеализаций.Состав.Содержит(Реквизит) Тогда
				Продолжить;
			КонецЕсли;
			#КонецВставки
		
			Для Каждого ТекущийТип Из Реквизит.Тип.Типы() Цикл
				МетаданныеРеквизита = МетаданныеТипаРеквизита(ТекущийТип);
				Если МетаданныеРеквизита.Метаданные = Неопределено Тогда
					Продолжить;
				КонецЕсли;

				ИменаРеквизитов = ИменаРеквизитов + ?(ИменаРеквизитов = "", "", ", ") + Реквизит.Имя;
				Прервать;
			КонецЦикла;

		КонецЦикла;

		СодержимоеТЧ.Свернуть(ИменаРеквизитов);
		Для Каждого КолонкаТЧ Из СодержимоеТЧ.Колонки Цикл

			Для Каждого СтрокаТЧ Из СодержимоеТЧ Цикл

				ЗначениеРеквизита = СтрокаТЧ[КолонкаТЧ.Имя];
				МетаданныеЗначения = МетаданныеТипаРеквизита(ТипЗнч(ЗначениеРеквизита));
				Если МетаданныеЗначения.Метаданные = Неопределено Тогда
					Продолжить;
				КонецЕсли;

				Если ЗначениеРеквизита = ТекущийОбъект
					Или СписокРеквизитов.Найти(ЗначениеРеквизита) <> Неопределено Тогда
					Продолжить;
				КонецЕсли;

				СписокРеквизитов.Добавить(ЗначениеРеквизита);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

	Если СписокРеквизитов.Количество() > 0 Тогда
		ВыводимыеОбъекты = ЗапросПоРеквизитамОбъектов(СписокРеквизитов).Выполнить().Выгрузить();
		ВыводимыеОбъекты.Сортировать("Дата");
		Для каждого ВыводимыйОбъект Из ВыводимыеОбъекты Цикл 

			Если ИндексСвязейОбъектов[ТекущийОбъект] = ВыводимыйОбъект.Ссылка Тогда 
				Продолжить;
			КонецЕсли;

			ИндексСвязейОбъектов[ТекущийОбъект] = ВыводимыйОбъект.Ссылка;

			НоваяСтрока = ДобавитьСтрокуВДерево(ДеревоРодитель, ВыводимыйОбъект, ВыведенныеОбъекты);			
			Если НоваяСтрока <> Неопределено
				И Не ДобавляемыйОбъектИмеетсяСредиРодителей(ДеревоРодитель, ВыводимыйОбъект.Ссылка) Тогда

				// @skip-check query-in-loop - Рекурсивный алгоритм обработки дерева.
				ВывестиРодительскиеОбъекты(ВыводимыйОбъект.Ссылка, НоваяСтрока, ВыведенныеОбъекты,
				СлужебныеОбъекты, ИндексСвязейОбъектов);

			ИначеЕсли СлужебныеОбъекты[ВыводимыйОбъект.Ссылка] = Неопределено Тогда 

				СлужебныеОбъекты[ВыводимыйОбъект.Ссылка] = Истина;
				// @skip-check query-in-loop - Рекурсивный алгоритм обработки дерева.
				ВывестиРодительскиеОбъекты(ВыводимыйОбъект.Ссылка, ДеревоРодитель, ВыведенныеОбъекты,
				СлужебныеОбъекты, ИндексСвязейОбъектов);

			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ОбъектыПоКритериюОтбора")
Функция КАНАТ_ОбъектыПоКритериюОтбора(ЗначениеКритерияОтбора)

	ШаблонЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПсевдонимТаблицы.Ссылка КАК Ссылка
	|ИЗ
	|	ИмяТаблицы КАК ПсевдонимТаблицы
	|ГДЕ
	|	ПсевдонимТаблицы.ИмяРеквизита = &ЗначениеКритерияОтбора";

	ШаблонЗапросаОбъединения = "ВЫБРАТЬ
	|	ПсевдонимТаблицы.Ссылка КАК Ссылка
	|ИЗ
	|	ИмяТаблицы КАК ПсевдонимТаблицы
	|ГДЕ
	|	ПсевдонимТаблицы.ИмяРеквизита = &ЗначениеКритерияОтбора";

	ЧастиЗапроса = Новый Массив;
	ТекстЧастиЗапроса = "";
    #Удаление
	Для Каждого ЭлементСостава Из Метаданные.КритерииОтбора.СвязанныеДокументы.Состав Цикл
	#КонецУдаления 
	#Вставка
	МассивОбъектов = Новый Массив;
	Для Каждого ЭлементСостава Из Метаданные.КритерииОтбора.СвязанныеДокументы.Состав Цикл
		МассивОбъектов.Добавить(ЭлементСостава);
	КонецЦикла;
	
	Для Каждого ЭлементСостава Из Метаданные.КритерииОтбора.КАНАТ_СвязанныеДокументыПроизводстваИРеализаций.Состав Цикл
		МассивОбъектов.Добавить(ЭлементСостава);
	КонецЦикла;
	
	Для Каждого ЭлементСостава Из МассивОбъектов Цикл
	#КонецВставки
		Если НЕ ЭлементСостава.Тип.СодержитТип(ТипЗнч(ЗначениеКритерияОтбора)) Тогда
			Продолжить;
		КонецЕсли;

		ПутьКДанным = ЭлементСостава.ПолноеИмя();
		
		Если СтрНайти(ПутьКДанным, "ТабличнаяЧасть") Тогда
			ОбъектМетаданных = ЭлементСостава.Родитель().Родитель();
		Иначе
			ОбъектМетаданных = ЭлементСостава.Родитель();
		КонецЕсли;
				
		Если НЕ ПравоДоступа("Чтение", ОбъектМетаданных) Тогда
			Продолжить;
		КонецЕсли;

		Точка = СтрНайти(ПутьКДанным, ".", НаправлениеПоиска.СКонца);
		ИмяРеквизита = Сред(ПутьКДанным, Точка + 1);

		ИмяТаблицы = ЭлементСостава.Родитель().ПолноеИмя();
		ИмяТаблицы = СтрЗаменить(ИмяТаблицы, "ТабличнаяЧасть.", "");

		Точка = СтрНайти(ИмяТаблицы, ".", НаправлениеПоиска.СКонца);
		ПсевдонимТаблицы = "Таблица_" + Сред(ИмяТаблицы, Точка + 1);

		ТекстЧастиЗапроса = ?(ТекстЧастиЗапроса = "", ШаблонЗапроса, ШаблонЗапросаОбъединения);
		ТекстЧастиЗапроса = СтрЗаменить(ТекстЧастиЗапроса, "ИмяТаблицы", ИмяТаблицы);
		ТекстЧастиЗапроса = СтрЗаменить(ТекстЧастиЗапроса, "ПсевдонимТаблицы", ПсевдонимТаблицы);
		ТекстЧастиЗапроса = СтрЗаменить(ТекстЧастиЗапроса, "ИмяРеквизита", ИмяРеквизита);

		ЧастиЗапроса.Добавить(ТекстЧастиЗапроса);

	КонецЦикла;

	Если ЧастиЗапроса.Количество() > 0 Тогда
		Запрос = Новый Запрос;
		Разделитель = Символы.ПС + "ОБЪЕДИНИТЬ" + Символы.ПС;
		Запрос.Текст = СтрСоединить(ЧастиЗапроса, Разделитель);
		Запрос.УстановитьПараметр("ЗначениеКритерияОтбора", ЗначениеКритерияОтбора);
		Возврат Запрос.Выполнить().Выгрузить();
	Иначе
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;

КонецФункции // <-БИТ> Руденков_Е.И. 25.02.2024

//&НаСервере
//&ИзменениеИКонтроль("ВывестиРодительскиеОбъекты")
//Процедура КАНАТ_ВывестиРодительскиеОбъекты(ТекущийОбъект, ДеревоРодитель, ВыведенныеОбъекты, СлужебныеОбъекты, ИндексСвязейОбъектов)

//	МетаданныеОбъекта = ТекущийОбъект.Метаданные();
//	СписокРеквизитов  = Новый СписокЗначений;

//	Если СлужебныеОбъекты = Неопределено Тогда 
//		СлужебныеОбъекты = Новый Соответствие;
//	КонецЕсли;

//	Если ИндексСвязейОбъектов = Неопределено Тогда 
//		ИндексСвязейОбъектов = Новый Соответствие;
//	КонецЕсли;

//	Для Каждого Реквизит Из МетаданныеОбъекта.Реквизиты Цикл

//		#Удаление
//		Если Не Метаданные.КритерииОтбора.СвязанныеДокументы.Состав.Содержит(Реквизит) Тогда
//			Продолжить;
//		КонецЕсли;
//		#КонецУдаления

//		#Вставка 
//		Если Не Метаданные.КритерииОтбора.СвязанныеДокументы.Состав.Содержит(Реквизит)
//			И Не Метаданные.КритерииОтбора.КАНАТ_СвязанныеДокументы.Состав.Содержит(Реквизит) Тогда
//			Продолжить;
//		КонецЕсли;
//		#КонецВставки

//		Для Каждого ТекущийТип Из Реквизит.Тип.Типы() Цикл

//			МетаданныеРеквизита = Метаданные.НайтиПоТипу(ТекущийТип);
//			Если МетаданныеРеквизита = Неопределено Тогда
//				Продолжить;
//			КонецЕсли;

//			Если Не ОбщегоНазначения.ОбъектМетаданныхДоступенПоФункциональнымОпциям(МетаданныеРеквизита) 
//				Или Не ПравоДоступа("Чтение", МетаданныеРеквизита) Тогда
//				Продолжить;
//			КонецЕсли;

//			Если Не Метаданные.Документы.Содержит(МетаданныеРеквизита)
//				И Не Метаданные.Справочники.Содержит(МетаданныеРеквизита)
//				И Не Метаданные.ПланыВидовХарактеристик.Содержит(МетаданныеРеквизита) Тогда
//				Продолжить;
//			КонецЕсли;

//			ЗначениеРеквизита = ТекущийОбъект[Реквизит.Имя];
//			Если ЗначениеЗаполнено(ЗначениеРеквизита)
//				И ТипЗнч(ЗначениеРеквизита) = ТекущийТип
//				И ЗначениеРеквизита <> ТекущийОбъект
//				И СписокРеквизитов.НайтиПоЗначению(ЗначениеРеквизита) = Неопределено Тогда

//				ЯвляетсяДокументом  = ОбщегоНазначения.ЭтоДокумент(МетаданныеРеквизита);

//				Если ЯвляетсяДокументом Тогда
//					ДатаДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗначениеРеквизита, "Дата", Истина);
//					СписокРеквизитов.Добавить(ЗначениеРеквизита, Формат(ДатаДокумента, "ДЛФ=DT"));
//				Иначе
//					СписокРеквизитов.Добавить(ЗначениеРеквизита, Дата(1,1,1));
//				КонецЕсли;

//			КонецЕсли;
//		КонецЦикла;

//	КонецЦикла;

//	Для Каждого ТЧ Из МетаданныеОбъекта.ТабличныеЧасти Цикл

//		ИменаРеквизитов = "";
//		СодержимоеТЧ = ТекущийОбъект[ТЧ.Имя].Выгрузить(); // ТаблицаЗначений
//		Для Каждого Реквизит Из ТЧ.Реквизиты Цикл
//			
//			#Удаление
//			Если Не Метаданные.КритерииОтбора.СвязанныеДокументы.Состав.Содержит(Реквизит) Тогда
//				Продолжить;
//			КонецЕсли;
//			#КонецУдаления
//	
//			#Вставка 
//			Если Не Метаданные.КритерииОтбора.СвязанныеДокументы.Состав.Содержит(Реквизит)
//				И Не Метаданные.КритерииОтбора.КАНАТ_СвязанныеДокументы.Состав.Содержит(Реквизит) Тогда
//				Продолжить;
//			КонецЕсли;
//			#КонецВставки

//			Для Каждого ТекущийТип Из Реквизит.Тип.Типы() Цикл

//				МетаданныеРеквизита = Метаданные.НайтиПоТипу(ТекущийТип);
//				Если МетаданныеРеквизита = Неопределено Тогда
//					Продолжить;
//				КонецЕсли;

//				Если Не ОбщегоНазначения.ОбъектМетаданныхДоступенПоФункциональнымОпциям(МетаданныеРеквизита) 
//					Или Не ПравоДоступа("Чтение", МетаданныеРеквизита) Тогда
//					Продолжить;
//				КонецЕсли;

//				Если Не Метаданные.Документы.Содержит(МетаданныеРеквизита)
//					И Не Метаданные.Справочники.Содержит(МетаданныеРеквизита)
//					И Не Метаданные.ПланыВидовХарактеристик.Содержит(МетаданныеРеквизита) Тогда
//					Продолжить;
//				КонецЕсли;

//				ИменаРеквизитов = ИменаРеквизитов + ?(ИменаРеквизитов = "", "", ", ") + Реквизит.Имя;
//				Прервать;

//			КонецЦикла;

//		КонецЦикла;

//		СодержимоеТЧ.Свернуть(ИменаРеквизитов);
//		Для Каждого КолонкаТЧ Из СодержимоеТЧ.Колонки Цикл

//			Для Каждого СтрокаТЧ Из СодержимоеТЧ Цикл

//				ЗначениеРеквизита = СтрокаТЧ[КолонкаТЧ.Имя];
//				МетаданныеЗначения = Метаданные.НайтиПоТипу(ТипЗнч(ЗначениеРеквизита));
//				Если МетаданныеЗначения = Неопределено Тогда
//					Продолжить;
//				КонецЕсли;

//				Если Не ОбщегоНазначения.ОбъектМетаданныхДоступенПоФункциональнымОпциям(МетаданныеЗначения) 
//					Или Не ПравоДоступа("Чтение", МетаданныеЗначения) Тогда
//					Продолжить;
//				КонецЕсли;

//				Если ЗначениеРеквизита = ТекущийОбъект
//					Или СписокРеквизитов.НайтиПоЗначению(ЗначениеРеквизита) <> Неопределено Тогда
//					Продолжить;
//				КонецЕсли;

//				ЯвляетсяДокументом  = ОбщегоНазначения.ЭтоДокумент(МетаданныеЗначения);
//				Если Не ЯвляетсяДокументом И Не Метаданные.Справочники.Содержит(МетаданныеЗначения)
//					И Не Метаданные.ПланыВидовХарактеристик.Содержит(МетаданныеЗначения) Тогда
//					Продолжить;
//				КонецЕсли;

//				Если ЯвляетсяДокументом Тогда
//					ДатаДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗначениеРеквизита, "Дата", Истина);
//					СписокРеквизитов.Добавить(ЗначениеРеквизита, Формат(ДатаДокумента, "ДЛФ=DT"));
//				Иначе
//					СписокРеквизитов.Добавить(ЗначениеРеквизита, Дата(1, 1, 1));
//				КонецЕсли;

//			КонецЦикла;
//		КонецЦикла;
//	КонецЦикла;

//	СписокРеквизитов.СортироватьПоПредставлению();

//	Для каждого ЭлементСписка Из СписокРеквизитов Цикл

//		Выборка = ПолучитьВыборкуПоРеквизитамОбъекта(ЭлементСписка.Значение);

//		Если Выборка.Следующий() Тогда

//			Если ИндексСвязейОбъектов[ТекущийОбъект] = Выборка.Ссылка Тогда 
//				Продолжить;
//			КонецЕсли;

//			ИндексСвязейОбъектов.Вставить(ТекущийОбъект, Выборка.Ссылка);

//			НоваяСтрока = ДобавитьСтрокуВДерево(ДеревоРодитель, Выборка, ВыведенныеОбъекты);

//			Если НоваяСтрока <> Неопределено
//				И Не ДобавляемыйОбъектИмеетсяСредиРодителей(ДеревоРодитель, ЭлементСписка.Значение) Тогда

//				ВывестиРодительскиеОбъекты(ЭлементСписка.Значение, НоваяСтрока, ВыведенныеОбъекты,
//				СлужебныеОбъекты, ИндексСвязейОбъектов);

//			ИначеЕсли СлужебныеОбъекты[ЭлементСписка.Значение] = Неопределено Тогда 

//				СлужебныеОбъекты.Вставить(ЭлементСписка.Значение, Истина);
//				ВывестиРодительскиеОбъекты(ЭлементСписка.Значение, ДеревоРодитель, ВыведенныеОбъекты,
//				СлужебныеОбъекты, ИндексСвязейОбъектов);

//			КонецЕсли;
//		КонецЕсли;

//	КонецЦикла;

//КонецПроцедуры 

//&НаСервере
//&ИзменениеИКонтроль("ОбъектыПоКритериюОтбора")
//Функция ИТ_ОбъектыПоКритериюОтбора(ЗначениеКритерияОтбора)

//	#Удаление
//	Если Не Метаданные.КритерииОтбора.СвязанныеДокументы.Тип.СодержитТип(ТипЗнч(ЗначениеКритерияОтбора))  Тогда
//		Возврат Неопределено;
//	КонецЕсли;
//	
//	УстановитьПривилегированныйРежим(Истина);

//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	|	СвязанныеДокументы.Ссылка
//	|ИЗ
//	|	КритерийОтбора.СвязанныеДокументы(&ЗначениеКритерияОтбора) КАК СвязанныеДокументы";
//	#КонецУдаления

//	#Вставка 
//	Если Не Метаданные.КритерииОтбора.СвязанныеДокументы.Тип.СодержитТип(ТипЗнч(ЗначениеКритерияОтбора))  
//		И Не Метаданные.КритерииОтбора.КАНАТ_СвязанныеДокументы.Тип.СодержитТип(ТипЗнч(ЗначениеКритерияОтбора))  Тогда
//		Возврат Неопределено;
//		КонецЕсли; 
//	
//	УстановитьПривилегированныйРежим(Истина);

//	Запрос = Новый Запрос;   
//	ТекстДляЗапроса="";
//	Если Метаданные.КритерииОтбора.СвязанныеДокументы.Тип.СодержитТип(ТипЗнч(ЗначениеКритерияОтбора)) Тогда
//		ТекстДляЗапроса = ТекстДляЗапроса+"ВЫБРАТЬ
//		|	СвязанныеДокументы.Ссылка КАК Ссылка
//		|ИЗ
//		|	КритерийОтбора.СвязанныеДокументы(&ЗначениеКритерияОтбора) КАК СвязанныеДокументы";
//		КонецЕсли;
//	Если Метаданные.КритерииОтбора.КАНАТ_СвязанныеДокументы.Тип.СодержитТип(ТипЗнч(ЗначениеКритерияОтбора)) Тогда  
//		Если НЕ ПустаяСтрока(ТекстДляЗапроса) Тогда
//			ТекстДляЗапроса=ТекстДляЗапроса+"
//			|
//			|ОБЪЕДИНИТЬ ВСЕ
//			|";
//		КонецЕсли;
//                ТекстДляЗапроса = ТекстДляЗапроса+"ВЫБРАТЬ
//		|	ИТ_СвязанныеДокументы.Ссылка
//		|ИЗ
//		|	КритерийОтбора.ИТ_СвязанныеДокументы(&ЗначениеКритерияОтбора) КАК ИТ_СвязанныеДокументы";
//	КонецЕсли; 
//	Запрос.Текст = ТекстДляЗапроса;
//	#КонецВставки

//	Запрос.УстановитьПараметр("ЗначениеКритерияОтбора", ЗначениеКритерияОтбора);
//    
//    #Вставка
//    //Это простой костыль от бага в команде "Запрос.Выполнить().Выгрузить()"
//    //Команда ".Выгрузить()" из результата запроса работает с БАГОМ для смешанных ссылок
//    //на объекты из основной конфигурации и на объекты из расширения. 
//    НовыйТЗ = Новый ТаблицаЗначений;
//    НовыйТЗ.Колонки.Добавить("Ссылка");
//    Выборка = Запрос.Выполнить().Выбрать();
//    Пока Выборка.Следующий() Цикл
//        НоваяСтрока = НовыйТЗ.Добавить();
//        НоваяСтрока.Ссылка = Выборка.Ссылка;
//    КонецЦикла;
//    Возврат НовыйТЗ;
//    #КонецВставки 
//	Возврат Запрос.Выполнить().Выгрузить();
//КонецФункции
