
&ИзменениеИКонтроль("ЗагрузитьФайлВТаблицу")
Процедура КАНАТ_ЗагрузитьФайлВТаблицу(ПараметрыВызоваСервера, АдресХранилища)

	Расширение = ПараметрыВызоваСервера.Расширение;
	ШаблонСДанными = ПараметрыВызоваСервера.ШаблонСДанными;
	ИмяВременногоФайла = ПараметрыВызоваСервера.ИмяВременногоФайла;
	ИнформацияПоКолонкам = ПараметрыВызоваСервера.ИнформацияПоКолонкам;

	Попытка

		Если Расширение = "csv" Тогда
			ЗагрузитьCSVФайлВТаблицу(ИмяВременногоФайла, ШаблонСДанными, ИнформацияПоКолонкам);
		Иначе

			// Проверка доступности файла
			ДвоичныеДанныеИзФайла = Новый ДвоичныеДанные(ИмяВременногоФайла);
			ДвоичныеДанныеИзФайла = Неопределено;

			ЗагруженныйШаблонСДанными = Новый ТабличныйДокумент;
			Попытка
				ЗагруженныйШаблонСДанными.Прочитать(ИмяВременногоФайла);
			Исключение

				ИнформацияОбОшибке = ИнформацияОбОшибке();

				Если Не ИнформацияОбОшибке.ЯвляетсяОшибкойКатегории(КатегорияОшибки.ОшибкаДоступаКЛокальномуФайлу, Истина) Тогда
					ВызватьИсключение;
				КонецЕсли;

				// Замена непредвиденной ошибки на ошибку для пользователя.
				Уточнение = ОбщегоНазначенияКлиентСервер.УточнениеИсключения(ИнформацияОбОшибке);
				УточненныйТекст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1
				|
				|Убедитесь в корректности данных в файле.';
				|en = '%1
				|
				|Make sure the file data is valid.'"), Уточнение.Текст);

				ВызватьИсключение(УточненныйТекст,,,, ИнформацияОбОшибке);

			КонецПопытки;

			НомерСтрокиСШапкойТаблицы = ?(ЗагрузкаДанныхИзФайлаКлиентСервер.КолонкиИмеютГруппировку(ИнформацияПоКолонкам), 2, 1);

			Адрес = "";
			ТабличныйДокументВТаблицуЗначений(ЗагруженныйШаблонСДанными, ИнформацияПоКолонкам, Адрес);
			ЗагруженныеДанные = ПолучитьИзВременногоХранилища(Адрес);

			ОбластьВывода = ШаблонСДанными.ПолучитьОбласть(НомерСтрокиСШапкойТаблицы + 1, 1, НомерСтрокиСШапкойТаблицы + 1, ЗагруженныеДанные.Колонки.Количество());

			Для Счетчик = 1 По ЗагруженныеДанные.Колонки.Количество() Цикл
				ОбластьЗаполнения = ОбластьВывода.Область(1, Счетчик, 1, Счетчик);
				Колонка = ИнформацияПоКолонкам.Найти(Счетчик, "Позиция");
				Если Колонка <> Неопределено И Колонка.Видимость Тогда
					ОбластьЗаполнения.Параметр = Колонка.ИмяКолонки;
					ОбластьЗаполнения.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Параметр;
				КонецЕсли;
			КонецЦикла;

			ВсегоСтрок = ЗагруженныеДанные.Количество();
			НомерСтроки = 1;
			Для Каждого Выборка Из ЗагруженныеДанные Цикл
				УстановитьПроцентПрогресса(ВсегоСтрок, НомерСтроки);
				#Вставка  
				ОбластьВЫвода.Параметры.Заполнить(Выборка);
				Если ЗагруженныеДанные.Колонки.Найти("Партнер") <> Неопределено тогда
					ОбластьВывода.Параметры.Партнер = Выборка.Партнер.Код;
				КонецЕсли;
				#КонецВставки
				#Удаление
				ОбластьВывода.Параметры.Заполнить(Выборка);         
				#КонецУдаления
				ШаблонСДанными.Вывести(ОбластьВывода);
				НомерСтроки = НомерСтроки + 1;
			КонецЦикла;

		КонецЕсли;

		АдресХранилища = ПоместитьВоВременноеХранилище(ШаблонСДанными, АдресХранилища);
	Исключение

		УдалитьВременныйФайл(ИмяВременногоФайла);
		ВызватьИсключение;

	КонецПопытки;

	УдалитьВременныйФайл(ИмяВременногоФайла);

КонецПроцедуры
