
&ИзменениеИКонтроль("ЗагрузитьФайлВТаблицу")
Процедура КАНАТ_ЗагрузитьФайлВТаблицу(ПараметрыВызоваСервера, АдресХранилища)

	Расширение = ПараметрыВызоваСервера.Расширение;
	ШаблонСДанными = ПараметрыВызоваСервера.ШаблонСДанными;
	ИмяВременногоФайла = ПараметрыВызоваСервера.ИмяВременногоФайла;
	ИнформацияПоКолонкам = ПараметрыВызоваСервера.ИнформацияПоКолонкам;

	Попытка

		Если Расширение = "csv" Тогда
			ЗагрузитьCSVФайлВТаблицу(ИмяВременногоФайла, ШаблонСДанными, ИнформацияПоКолонкам);
		Иначе

			// Проверка доступности файла
			ДвоичныеДанныеИзФайла = Новый ДвоичныеДанные(ИмяВременногоФайла);
			ДвоичныеДанныеИзФайла = Неопределено;

			ЗагруженныйШаблонСДанными = Новый ТабличныйДокумент;
			Попытка
				ЗагруженныйШаблонСДанными.Прочитать(ИмяВременногоФайла);
			Исключение

				ИнформацияОбОшибке = ИнформацияОбОшибке();

				Если Не ИнформацияОбОшибке.ЯвляетсяОшибкойКатегории(КатегорияОшибки.ОшибкаДоступаКЛокальномуФайлу, Истина) Тогда
					ВызватьИсключение;
				КонецЕсли;

				// Замена непредвиденной ошибки на ошибку для пользователя.
				Уточнение = ОбщегоНазначенияКлиентСервер.УточнениеИсключения(ИнформацияОбОшибке);
				УточненныйТекст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1
				|
				|Убедитесь в корректности данных в файле.';
				|en = '%1
				|
				|Make sure the file data is valid.'"), Уточнение.Текст);

				ВызватьИсключение(УточненныйТекст,,,, ИнформацияОбОшибке);

			КонецПопытки;

			НомерСтрокиСШапкойТаблицы = ?(ЗагрузкаДанныхИзФайлаКлиентСервер.КолонкиИмеютГруппировку(ИнформацияПоКолонкам), 2, 1);

			Адрес = "";
			ТабличныйДокументВТаблицуЗначений(ЗагруженныйШаблонСДанными, ИнформацияПоКолонкам, Адрес);
			ЗагруженныеДанные = ПолучитьИзВременногоХранилища(Адрес);

			ОбластьВывода = ШаблонСДанными.ПолучитьОбласть(НомерСтрокиСШапкойТаблицы + 1, 1, НомерСтрокиСШапкойТаблицы + 1, ЗагруженныеДанные.Колонки.Количество());

			Для Счетчик = 1 По ЗагруженныеДанные.Колонки.Количество() Цикл
				ОбластьЗаполнения = ОбластьВывода.Область(1, Счетчик, 1, Счетчик);
				Колонка = ИнформацияПоКолонкам.Найти(Счетчик, "Позиция");
				Если Колонка <> Неопределено И Колонка.Видимость Тогда
					ОбластьЗаполнения.Параметр = Колонка.ИмяКолонки;
					ОбластьЗаполнения.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Параметр;
				КонецЕсли;
			КонецЦикла;

			ВсегоСтрок = ЗагруженныеДанные.Количество();
			НомерСтроки = 1;
			Для Каждого Выборка Из ЗагруженныеДанные Цикл
				УстановитьПроцентПрогресса(ВсегоСтрок, НомерСтроки);
				#Вставка  
				ОбластьВЫвода.Параметры.Заполнить(Выборка);
				Если ЗагруженныеДанные.Колонки.Найти("Партнер") <> Неопределено  тогда
					ОбластьВывода.Параметры.Партнер = Выборка.Партнер.Код;
				КонецЕсли;
				Если ЗагруженныеДанные.Колонки.Найти("Владелец") <> Неопределено  тогда
					ОбластьВывода.Параметры.Владелец = Выборка.Владелец.партнер.Код;
				КонецЕсли;
				#КонецВставки
				#Удаление
				ОбластьВывода.Параметры.Заполнить(Выборка);         
				#КонецУдаления
				ШаблонСДанными.Вывести(ОбластьВывода);
				НомерСтроки = НомерСтроки + 1;
			КонецЦикла;

		КонецЕсли;

		АдресХранилища = ПоместитьВоВременноеХранилище(ШаблонСДанными, АдресХранилища);
	Исключение

		УдалитьВременныйФайл(ИмяВременногоФайла);
		ВызватьИсключение;

	КонецПопытки;

	УдалитьВременныйФайл(ИмяВременногоФайла);

КонецПроцедуры

&ИзменениеИКонтроль("ЗначениеЯчейки")
Функция КАНАТ_ЗначениеЯчейки(Колонка, ЗначениеЯчейки)

	ДанныеЯчейки = "";
	Для каждого ТипДанных Из Колонка.ТипКолонки.Типы() Цикл
		ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипДанных);

		Если ОбъектМетаданных = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		ОписаниеОбъекта = РазложитьПолноеИмяОбъекта(ОбъектМетаданных.ПолноеИмя());
		Если ОписаниеОбъекта.ТипОбъекта = "Справочник" Тогда
			#Удаление
			Если Не ОбъектМетаданных.Автонумерация 
				И ОбъектМетаданных.ДлинаКода > 0 Тогда
			#КонецУдаления	
				#Вставка
				Если Не ОбъектМетаданных.Автонумерация 
				И (ОбъектМетаданных.ДлинаКода > 0 или ОписаниеОбъекта.НазваниеОбъекта = "Контрагенты")  Тогда
				Если ОписаниеОбъекта.НазваниеОбъекта = "Контрагенты" Тогда
						аа = Справочники.Партнеры.НайтиПоКоду(ЗначениеЯчейки);
					ДанныеЯчейки = Справочники.Контрагенты.НайтиПоРеквизиту("Партнер",аа);
				Иначе
					ДанныеЯчейки = Справочники[ОписаниеОбъекта.НазваниеОбъекта].НайтиПоКоду(ЗначениеЯчейки, Истина);
				КонецЕсли;
				#КонецВставки
				#Удаление
				ДанныеЯчейки = Справочники[ОписаниеОбъекта.НазваниеОбъекта].НайтиПоКоду(ЗначениеЯчейки, Истина);
				#КонецУдаления	
			КонецЕсли;
			Если Не ЗначениеЗаполнено(ДанныеЯчейки)
				И ЗначениеЗаполнено(ЗначениеЯчейки)
				И ОбъектМетаданных.ДлинаНаименования > 0 Тогда
				//@skip-check query-in-loop - штучные запросы разнородных данных.
				ДанныеЯчейки = НайтиПоНаименованию(ЗначениеЯчейки, ОбъектМетаданных, Колонка);
			КонецЕсли;
			Если Не ЗначениеЗаполнено(ДанныеЯчейки)
				И ОбъектМетаданных.ДлинаКода > 0 Тогда 
				Если ОбъектМетаданных.СерииКодов = Метаданные.СвойстваОбъектов.СерииКодовСправочника.ВоВсемСправочнике Тогда
					#Удаление
					ДанныеЯчейки = Справочники[ОписаниеОбъекта.НазваниеОбъекта].НайтиПоКоду(ЗначениеЯчейки);
					#КонецУдаления
					#Вставка
					ДанныеЯчейки = Справочники[ОписаниеОбъекта.НазваниеОбъекта].НайтиПоКоду(ЗначениеЯчейки,Истина);
					#КонецВставки
				Иначе
					ДанныеЯчейки = Справочники[ОписаниеОбъекта.НазваниеОбъекта].НайтиПоКоду(ЗначениеЯчейки, Истина);
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли ОписаниеОбъекта.ТипОбъекта = "Перечисление" Тогда 
			Для каждого ЗначениеПеречисления Из Перечисления[ОписаниеОбъекта.НазваниеОбъекта] Цикл 
				Если Строка(ЗначениеПеречисления) = СокрЛП(ЗначениеЯчейки) Тогда 
					ДанныеЯчейки = ЗначениеПеречисления; 
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли ОписаниеОбъекта.ТипОбъекта = "ПланСчетов" Тогда
			ДанныеЯчейки = ПланыСчетов[ОписаниеОбъекта.НазваниеОбъекта].НайтиПоКоду(ЗначениеЯчейки);
			Если ДанныеЯчейки.Пустая() Тогда 
				ДанныеЯчейки = ПланыСчетов[ОписаниеОбъекта.НазваниеОбъекта].НайтиПоНаименованию(ЗначениеЯчейки, Истина);
			КонецЕсли;
		ИначеЕсли ОписаниеОбъекта.ТипОбъекта = "ПланВидовХарактеристик" Тогда
			Если Не ОбъектМетаданных.Автонумерация И ОбъектМетаданных.ДлинаКода > 0 Тогда 
				ДанныеЯчейки = ПланыВидовХарактеристик[ОписаниеОбъекта.НазваниеОбъекта].НайтиПоКоду(ЗначениеЯчейки);
			КонецЕсли;
			Если Не ЗначениеЗаполнено(ДанныеЯчейки) Тогда 
				ДанныеЯчейки = ПланыВидовХарактеристик[ОписаниеОбъекта.НазваниеОбъекта].НайтиПоНаименованию(ЗначениеЯчейки, Истина);
			КонецЕсли;
		Иначе
			ДанныеЯчейки =  Строка(ЗначениеЯчейки);
		КонецЕсли;
		Если ЗначениеЗаполнено(ДанныеЯчейки) Тогда 
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Возврат ДанныеЯчейки;

КонецФункции

