//БИТ_Гурьев__01.04.24++
&НаСервере
Процедура КАНАТ_ЗаполнитьВодителя(Отказ, ТекущийОбъект)
	
	МассивВодители = Новый Массив;
	
	Для Каждого РаспоряженияСтрока Из Объект.Распоряжения Цикл
		
		Распоряжение = РаспоряженияСтрока.Распоряжение;
		
		Если ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
			
			Водитель = Распоряжение.КАНАТ_ВодительСсылка;
			
			Если ЗначениеЗаполнено(Водитель) И Не ЗначениеЗаполнено(МассивВодители.Найти(Водитель)) Тогда
				
				МассивВодители.Добавить(Водитель);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивВодители.Количество() = 1 Тогда
		
		ТекущийОбъект.Водитель = МассивВодители[0];
		
		ПараметрыТТН = Новый Структура;
		ПараметрыТТН.Вставить("ВодительФИО");
		ПараметрыТТН.Вставить("УдостоверениеСерия");
		ПараметрыТТН.Вставить("УдостоверениеНомер");
		
		Если ЗначениеЗаполнено(ТекущийОбъект.ТранспортноеСредство) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ФизическиеЛица.Наименование КАК ВодительФИО,
			|	ДокументыФизическихЛиц.Серия КАК УдостоверениеСерия,
			|	ДокументыФизическихЛиц.Номер КАК УдостоверениеНомер
			|ИЗ
			|	Справочник.ФизическиеЛица КАК ФизическиеЛица
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних КАК ДокументыФизическихЛиц
			|		ПО ФизическиеЛица.Ссылка = ДокументыФизическихЛиц.Физлицо
			|			И (ДокументыФизическихЛиц.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ВодительскоеУдостоверение))
			|ГДЕ
			|	ФизическиеЛица.Ссылка = &Ссылка";
			
			Запрос.УстановитьПараметр("Ссылка", ТекущийОбъект.Водитель);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				ЗаполнитьЗначенияСвойств(ПараметрыТТН, Выборка);
			КонецЕсли;			
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ТекущийОбъект, ПараметрыТТН)
	ИначеЕсли МассивВодители.Количество() > 1 Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось заполнить водителя из распоряжений. Причина: в распоряжениях указаны разные водители.";
		Сообщение.Сообщить();
		
	КонецЕсли;

КонецПроцедуры //БИТ_Гурьев__01.04.24--

&НаСервере
Процедура КАНАТ_ПередЗаписьюНаСервереПеред(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//БИТ_Гурьев__01.04.24++
	Если Отказ = Ложь И Не ЗначениеЗаполнено(Объект.Водитель) Тогда
		
		КАНАТ_ЗаполнитьВодителя(Отказ, ТекущийОбъект);
		
	КонецЕсли;
	//БИТ_Гурьев__01.04.24--
КонецПроцедуры
