// <+БИТ> Руденков_Е.И. 25.07.2024  
// ЧТЗ ШК-1 Канат Процесс штрихкодирования
// Создаёт набор записей в регистр сведений ШтрихкодыНоменклатуры
//
// Параметры:
//  НаборСтрок  - Массив - Содержит структуры значений измерений, ресурсов, реквизитов регистра
//
Процедура СоздатьЗаписьВРегистр(НаборСтрок)Экспорт

	Для каждого ТекСтрока Из НаборСтрок Цикл
		НоваяЗапись = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(НоваяЗапись,ТекСтрока);	
		НоваяЗапись.Записать();
	КонецЦикла;	

КонецПроцедуры // <-БИТ> Руденков_Е.И. 25.07.2024