
// Функция возвращает структуру с описанием выпуска документа ЭтапПроизводства2_2
// Параметры:
//  СсылкаНаЭтап - ссылка на документ ЭтапПроизводства2_2
// Ключи возвращаемой структуры
//  Строки - сгруппированные строки ТЧ ВыходныеИзделия (сгруппированы по ключевым для назначения серий полям)
//  ПрисвоитьСерии - булево, равно Истина, если количество серий меньше чем количество выпуска
Функция ПолучитьСтруктуруСтрокВыпуска(СсылкаНаЭтап,ТекущийЭтапОбъект=Неопределено)Экспорт
	
	СтруктураСтрокВыпуска = Новый Структура("Строки,ПрисвоитьСерии");
	СтруктураСтрокВыпуска.ПрисвоитьСерии = Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	
	Если ТипЗнч(ТекущийЭтапОбъект) = Тип("Структура") Тогда
		Запрос.УстановитьПараметр("ВыходныеИзделияСерии"	,ПолучитьТЗИзМассиваСтруктур(ТекущийЭтапОбъект.ВыходныеИзделияСерии));
		Запрос.УстановитьПараметр("ВыходныеИзделия"			,ПолучитьТЗИзМассиваСтруктур(ТекущийЭтапОбъект.ВыходныеИзделия));
		Запрос.Текст = 
		"ВЫБРАТЬ *
		|Поместить ВтВыходныеИзделия
		|ИЗ
		|	&ВыходныеИзделия КАК ЭтапПроизводства2_2ВыходныеИзделия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ *
		|Поместить ВтВыходныеИзделияСерии
		|ИЗ
		|	&ВыходныеИзделияСерии КАК ЭтапПроизводства2_2ВыходныеИзделияСерии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////";
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + ?(ТипЗнч(ТекущийЭтапОбъект) = Тип("Структура"),Символы.ПС,"") +
	"ВЫБРАТЬ
	|	ЭтапПроизводства2_2ВыходныеИзделияСерии.ДатаПроизводства КАК ДатаПроизводства,
	|	ЭтапПроизводства2_2ВыходныеИзделияСерии.Назначение КАК Назначение,
	|	ЭтапПроизводства2_2ВыходныеИзделияСерии.Номенклатура КАК Номенклатура,
	|	ЭтапПроизводства2_2ВыходныеИзделияСерии.Отменено КАК Отменено,
	|	ЭтапПроизводства2_2ВыходныеИзделияСерии.Подразделение КАК Подразделение,
	|	ЭтапПроизводства2_2ВыходныеИзделияСерии.Получатель КАК Получатель,
	|	ЭтапПроизводства2_2ВыходныеИзделияСерии.Произведено КАК Произведено,
	|	ЭтапПроизводства2_2ВыходныеИзделияСерии.Характеристика КАК Характеристика,
	|	СУММА(ЭтапПроизводства2_2ВыходныеИзделияСерии.Количество) КАК Количество,
	|	МИНИМУМ(ЭтапПроизводства2_2ВыходныеИзделияСерии.НомерСтроки) КАК НомерСтроки
	|ПОМЕСТИТЬ ВтСерии
	|ИЗ
	|	Документ.ЭтапПроизводства2_2.ВыходныеИзделияСерии КАК ЭтапПроизводства2_2ВыходныеИзделияСерии
	|ГДЕ
	|	ЭтапПроизводства2_2ВыходныеИзделияСерии.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЭтапПроизводства2_2ВыходныеИзделияСерии.ДатаПроизводства,
	|	ЭтапПроизводства2_2ВыходныеИзделияСерии.Назначение,
	|	ЭтапПроизводства2_2ВыходныеИзделияСерии.Номенклатура,
	|	ЭтапПроизводства2_2ВыходныеИзделияСерии.Отменено,
	|	ЭтапПроизводства2_2ВыходныеИзделияСерии.Подразделение,
	|	ЭтапПроизводства2_2ВыходныеИзделияСерии.Получатель,
	|	ЭтапПроизводства2_2ВыходныеИзделияСерии.Произведено,
	|	ЭтапПроизводства2_2ВыходныеИзделияСерии.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЭтапПроизводства2_2ВыходныеИзделия.ДатаПроизводства КАК ДатаПроизводства,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Назначение КАК Назначение,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура КАК Номенклатура,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Отменено КАК Отменено,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Подразделение КАК Подразделение,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Получатель КАК Получатель,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Произведено КАК Произведено,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Характеристика КАК Характеристика,
	|	СУММА(ЭтапПроизводства2_2ВыходныеИзделия.Количество) КАК Количество,
	|	МИНИМУМ(ЭтапПроизводства2_2ВыходныеИзделия.НомерСтроки) КАК НомерСтроки,
	|	ЕСТЬNULL(ВтСерии.Количество, 0) КАК КоличествоСерий
	|ИЗ
	|	Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ЭтапПроизводства2_2ВыходныеИзделия
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтСерии КАК ВтСерии
	|		ПО (ВтСерии.ДатаПроизводства = ЭтапПроизводства2_2ВыходныеИзделия.ДатаПроизводства)
	|			И (ВтСерии.Назначение = ЭтапПроизводства2_2ВыходныеИзделия.Назначение)
	|			И (ВтСерии.Номенклатура = ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура)
	|			И (ВтСерии.Отменено = ЭтапПроизводства2_2ВыходныеИзделия.Отменено)
	|			И (ВтСерии.Подразделение = ЭтапПроизводства2_2ВыходныеИзделия.Подразделение)
	|			И (ВтСерии.Получатель = ЭтапПроизводства2_2ВыходныеИзделия.Получатель)
	|			И (ВтСерии.Произведено = ЭтапПроизводства2_2ВыходныеИзделия.Произведено)
	|			И (ВтСерии.Характеристика = ЭтапПроизводства2_2ВыходныеИзделия.Характеристика)
	|ГДЕ
	|	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЭтапПроизводства2_2ВыходныеИзделия.ДатаПроизводства,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Назначение,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Отменено,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Подразделение,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Получатель,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Произведено,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Характеристика,
	|	ЕСТЬNULL(ВтСерии.Количество, 0)";
	
	Если ТипЗнч(ТекущийЭтапОбъект) = Тип("Структура") Тогда
		//Секции ИЗ
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"Документ.ЭтапПроизводства2_2.ВыходныеИзделияСерии КАК ЭтапПроизводства2_2ВыходныеИзделияСерии",
									"ВтВыходныеИзделияСерии КАК ЭтапПроизводства2_2ВыходныеИзделияСерии");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ЭтапПроизводства2_2ВыходныеИзделия",
									"ВтВыходныеИзделия КАК ЭтапПроизводства2_2ВыходныеИзделия");
		
		//Секции ГДЕ
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ЭтапПроизводства2_2ВыходныеИзделияСерии.Ссылка = &Ссылка",
									"Истина");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ЭтапПроизводства2_2ВыходныеИзделия.Ссылка = &Ссылка",
									"Истина");
	КонецЕсли;
	Запрос.УстановитьПараметр("Ссылка",СсылкаНаЭтап);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выгрузка = РезультатЗапроса.Выгрузить();
	СтруктураСтрокВыпуска.Строки = ОбщегоНазначения.ТаблицаЗначенийВМассив(Выгрузка);
	
	Для каждого СтрокаТЗ Из Выгрузка Цикл
		Если СтрокаТЗ.КоличествоСерий < СтрокаТЗ.Количество Тогда
			СтруктураСтрокВыпуска.ПрисвоитьСерии = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтруктураСтрокВыпуска;
	
КонецФункции

Функция ПолучитьТЗИзМассиваСтруктур(МассивСтруктур)
	
	СоответсвиеТипов = Новый Соответствие;
	СоответсвиеТипов.Вставить(Тип("Число")											,Новый ОписаниеТипов("Число"));
	СоответсвиеТипов.Вставить(Тип("Строка")											,Новый ОписаниеТипов("Строка"));
	СоответсвиеТипов.Вставить(Тип("Дата")											,Новый ОписаниеТипов("Дата"));
	СоответсвиеТипов.Вставить(Тип("Булево")											,Новый ОписаниеТипов("Булево"));
	СоответсвиеТипов.Вставить(Тип("СправочникСсылка.Номенклатура")					,Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	СоответсвиеТипов.Вставить(Тип("СправочникСсылка.ХарактеристикиНоменклатуры")	,Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	СоответсвиеТипов.Вставить(Тип("СправочникСсылка.УпаковкиЕдиницыИзмерения")		,Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	СоответсвиеТипов.Вставить(Тип("СправочникСсылка.СтруктураПредприятия")			,Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"));
	СоответсвиеТипов.Вставить(Тип("СправочникСсылка.Склады")						,Новый ОписаниеТипов("СправочникСсылка.Склады"));
	СоответсвиеТипов.Вставить(Тип("СправочникСсылка.Назначения")					,Новый ОписаниеТипов("СправочникСсылка.Назначения"));
	СоответсвиеТипов.Вставить(Тип("СправочникСсылка.СерииНоменклатуры")				,Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
	//СоответсвиеТипов.Вставить(Тип("ПланВидовХарактеристикСсылка.СтатьиРасходов")	,Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.СтатьиРасходов"));
	//СоответсвиеТипов.Вставить(Тип("ПланВидовХарактеристикСсылка.СтатьиАктивовПассивов"),Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.СтатьиАктивовПассивов"));
	//СоответсвиеТипов.Вставить(Тип("Характеристика.СтатьиРасходов")					,Новый ОписаниеТипов("Характеристика.СтатьиРасходов"));
	//СоответсвиеТипов.Вставить(Тип("Характеристика.СтатьиАктивовПассивов")			,Новый ОписаниеТипов("Характеристика.СтатьиАктивовПассивов"));
	СоответсвиеТипов.Вставить(Тип("СправочникСсылка.КлючиАналитикиУчетаНоменклатуры"),Новый ОписаниеТипов("СправочникСсылка.КлючиАналитикиУчетаНоменклатуры"));
	СоответсвиеТипов.Вставить(Тип("СправочникСсылка.РесурсныеСпецификации")			,Новый ОписаниеТипов("СправочникСсылка.РесурсныеСпецификации"));
	СоответсвиеТипов.Вставить(Тип("СправочникСсылка.ПричиныОтменыПроизводства")		,Новый ОписаниеТипов("СправочникСсылка.ПричиныОтменыПроизводства"));
	СоответсвиеТипов.Вставить(Тип("ДокументСсылка.ЭтапПроизводства2_2")				,Новый ОписаниеТипов("ДокументСсылка.ЭтапПроизводства2_2"));
	СоответсвиеТипов.Вставить(Тип("СправочникСсылка.СтруктураПредприятия")			,Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"));
	СоответсвиеТипов.Вставить(Тип("СправочникСсылка.НастройкиСчетовУчетаПрочихОпераций"),Новый ОписаниеТипов("СправочникСсылка.НастройкиСчетовУчетаПрочихОпераций"));
	СоответсвиеТипов.Вставить(Тип("СправочникСсылка.СерииНоменклатуры")				,Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
	
	Если МассивСтруктур.Количество() > 0 Тогда
		ПерваяСтруктура = МассивСтруктур[0];
		ТЗ = Новый ТаблицаЗначений;
		Для Каждого КлючЗначение из ПерваяСтруктура Цикл
			Если СоответсвиеТипов.Получить(ТипЗнч(КлючЗначение.Значение)) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ТЗ.Колонки.Добавить(КлючЗначение.Ключ, СоответсвиеТипов.Получить(ТипЗнч(КлючЗначение.Значение)));
		КонецЦикла;
		Для каждого СтрокаТЧ Из МассивСтруктур Цикл
			НоваяСтрока = ТЗ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТЧ);
		КонецЦикла;
		Возврат ТЗ;
	Иначе
		Возврат МассивСтруктур;
	КонецЕсли;
	
КонецФункции

