&НаСервере
&ИзменениеИКонтроль("ЗаполнитьСписокОпераций")
Процедура КАНАТ_ЗаполнитьСписокОпераций()

	ОперацииВПорядкеДобавления = Новый Массив();
	ОперацииВПорядкеДобавления.Добавить(Перечисления.ХозяйственныеОперации.ПередачаПродукцииИзПроизводства);
	ОперацииВПорядкеДобавления.Добавить(Перечисления.ХозяйственныеОперации.ПередачаПродукцииИзКладовой);
	#Удаление
	ОперацииВПорядкеДобавления.Добавить(Перечисления.ХозяйственныеОперации.ПередачаМатериаловВПроизводство);
	#КонецУдаления
	#Вставка
	//БИТ_Гурьев_ЧТЗ_3.7_06.03.24++
	Если Пользователи.ЭтоПолноправныйПользователь() Тогда
		
		ОперацииВПорядкеДобавления.Добавить(Перечисления.ХозяйственныеОперации.ПередачаМатериаловВПроизводство);
		
	КонецЕсли;
	//БИТ_Гурьев_ЧТЗ_3.7_06.03.24--
	#КонецВставки
	ОперацииВПорядкеДобавления.Добавить(Перечисления.ХозяйственныеОперации.ПередачаМатериаловВКладовую);
	ОперацииВПорядкеДобавления.Добавить(Перечисления.ХозяйственныеОперации.ВозвратМатериаловИзПроизводства);
	ОперацииВПорядкеДобавления.Добавить(Перечисления.ХозяйственныеОперации.ВозвратМатериаловИзКладовой);
	ОперацииВПорядкеДобавления.Добавить(Перечисления.ХозяйственныеОперации.ПеремещениеПолуфабрикатов);
	ОперацииВПорядкеДобавления.Добавить(Перечисления.ХозяйственныеОперации.ПеремещениеПолуфабрикатовМеждуФилиалами);

	ДоступныеОперации = Документы.ДвижениеПродукцииИМатериалов.СписокОпераций();

	Элементы.ХозяйственнаяОперация.СписокВыбора.Очистить();
	Для каждого ЭлементКоллекции Из ОперацииВПорядкеДобавления Цикл

		ДоступнаяОперация = ДоступныеОперации.НайтиПоЗначению(ЭлементКоллекции);
		Если ДоступнаяОперация <> Неопределено Тогда
			Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(ДоступнаяОперация.Значение, ДоступнаяОперация.Представление);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ОткрытьПодборСерий")
Процедура КАНАТ_ОткрытьПодборСерий(Текст = "", ТекущиеДанные = Неопределено)

	Если НоменклатураКлиент.ДляУказанияСерийНуженСерверныйВызов(ЭтаФорма,ПараметрыУказанияСерий,Текст, ТекущиеДанные)Тогда

		Если ТекущиеДанные = Неопределено Тогда
			ТекущиеДанныеИдентификатор = Элементы.Товары.ТекущиеДанные.ПолучитьИдентификатор();
		Иначе
			ТекущиеДанныеИдентификатор = ТекущиеДанные.ПолучитьИдентификатор();
		КонецЕсли;

		ПараметрыФормыУказанияСерий = ПараметрыФормыУказанияСерий(ТекущиеДанныеИдентификатор);
		ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьПодборСерийЗавершение", 
														ЭтотОбъект, 
														Новый Структура("ПараметрыФормыУказанияСерий", ПараметрыФормыУказанияСерий));
		#Вставка
		//ПараметрыФормыУказанияСерий.ИмяФормы = "Обработка.ПодборСерийВДокументы.Форма.КАНАТ_РегистрацияИПодборСерийПоОднойСтрокеТоваров_РасходныйОрдер";
		//	ПараметрыФормыУказанияСерий.ТолькоПросмотр = Истина;
		//ПараметрыФормыУказанияСерий.Вставить("КоличествоКОтгрузке",ТекущиеДанные.КоличествоУпаковок);
		#КонецВставки
		ОткрытьФорму(ПараметрыФормыУказанияСерий.ИмяФормы,
						ПараметрыФормыУказанияСерий,ЭтаФорма,,,, 
						ОписаниеОповещения,
						РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ОбработатьУказаниеСерийСервер")
Процедура КАНАТ_ОбработатьУказаниеСерийСервер(ПараметрыФормыУказанияСерий)

	НоменклатураСервер.ОбработатьУказаниеСерий(Объект,ПараметрыУказанияСерий,ПараметрыФормыУказанияСерий);
    #Вставка  
	// 
	//Объект.Товары[0].Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ДвижениеПродукцииИМатериалов") Тогда
		НайденныеТовары = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура,Характеристика,Серия",ПараметрыФормыУказанияСерий.Номенклатура,ПараметрыФормыУказанияСерий.Характеристика,Справочники.СерииНоменклатуры.ПустаяСсылка()));
		//НайденныеСерии = Объект.Серии.НайтиСтроки(Новый Структура("Номенклатура,Характеристика,Серия",ПараметрыФормыУказанияСерий.Номенклатура,ПараметрыФормыУказанияСерий.Характеристика,Справочники.СерииНоменклатуры.ПустаяСсылка()));
		Если НайденныеТовары.Количество() = 1 ТОгда 
			ТЗ = ПолучитьИзВременногоХранилища(ПараметрыФормыУказанияСерий.АдресВоВременномХранилище); 
			НайденныеТовары[0].Серия = ТЗ[0].Серия; 
			Объект.ВидыЗапасов[0].Серия = ТЗ[0].Серия; 
			//НайденныеСерии[0].Серия = ТЗ[0].Серия; 
			//НовСтрСерия = Объект.Серии.Добавить();
			//НовСтрСерия.Номенклатура = ПараметрыФормыУказанияСерий.Номенклатура; 
			//НовСтрСерия.Характеристика = ПараметрыФормыУказанияСерий.характеристика;
			//НовСтрСерия.Серия = ТЗ[0].Серия;
			//НовСтрСерия.Количество = ТЗ[0].Количество;
			//
			//Найденные[0].Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
			НайденныеТовары[0].Количество = ТЗ[0].Количество;
			НайденныеТовары[0].КоличествоУпаковок = ТЗ[0].КоличествоУпаковок; 
			//НайденныеСерии[0].КоличествоУпаковок = ТЗ[0].КоличествоУпаковок;
		КонецЕсли;
		
	КонецЕсли; 
	//ЭтаФорма.Прочитать();
	#КонецВставки
КонецПроцедуры

&НаСервере
Функция КАНАТ_ПолучитьКоличествоКОтгрузке(Ссылка, Номенклатура, Характеристика)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ДвижениеПродукцииИМатериаловТовары.КоличествоУпаковок) КАК КоличествоУпаковок
		|ИЗ
		|	Документ.ДвижениеПродукцииИМатериалов.Товары КАК ДвижениеПродукцииИМатериаловТовары
		|ГДЕ
		|	ДвижениеПродукцииИМатериаловТовары.Ссылка = &Ссылка
		|	И ДвижениеПродукцииИМатериаловТовары.Номенклатура = &Номенклатура
		|	И ДвижениеПродукцииИМатериаловТовары.Характеристика = &Характеристика";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Возврат ВыборкаДетальныеЗаписи.КоличествоУпаковок;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

