// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов - см. УправлениеПечатьюПереопределяемый.ПриПечати.МассивОбъектов
//  ПараметрыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ПараметрыПечати
//  КоллекцияПечатныхФорм - см. УправлениеПечатьюПереопределяемый.ПриПечати.КоллекцияПечатныхФорм
//  ОбъектыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ОбъектыПечати
//  ПараметрыВывода - см. УправлениеПечатьюПереопределяемый.ПриПечати.ПараметрыВывода
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Для Каждого Документ Из МассивОбъектов Цикл
		
		//Если ТипЗнч(Документ) = Тип("ДокументСсылка.КАНАТ_СпецификацияКДоговору") Тогда
		//	Док = Документ.ДокументОснование;
		//Иначе
		//	Док = Документ;
		//КонецЕсли;
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПечатьСпецификации") Тогда
			СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
				КоллекцияПечатныхФорм,
				"ПечатьСпецификации",
				"Печать спецификации",
				СформироватьПечатьСпецификации(Документ));
		КонецЕсли;
	
	КонецЦикла;
	ФормированиеПечатныхФорм.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
	
КонецПроцедуры

//++ Гурьев 04.09.23 формирование печатной формы для печати спецификации
Функция СформироватьПечатьСпецификации(Документ)
	
	ДанныеПечати = ПолучитьДанныеПечати(Документ);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.КАНАТ_ПечатьСпецификацииЗаказКлиента.ПФ_MXL_ПечатьСпецификакии");
	ОбластьПустаяСтрока = Макет.ПолучитьОбласть("ОбластьПустаяСтрока");
	//Шапка
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	ДанныеШапки = Новый Структура;
	ДанныеШапки.Вставить("НомерСпецификации",       ДанныеПечати[0].КАНАТ_СпецификацияНомер);
	ДанныеШапки.Вставить("НомерДоговора",           ДанныеПечати[0].НомерДоговора);
	ДанныеШапки.Вставить("ДатаДоговора",            Формат(ДанныеПечати[0].ДатаДоговора,"ДФ=dd.MM.yyyy"));
	ДанныеШапки.Вставить("ОрганизацияНаименование", ДанныеПечати[0].ОрганизацияНаименование);
	ДанныеШапки.Вставить("КонтрагентНаименование",  ДанныеПечати[0].КонтрагентСокрНаименование);
	ОбластьШапка.Параметры.Заполнить(ДанныеШапки);
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	ТабличныйДокумент.Вывести(ОбластьПустаяСтрока);
	
	ОбластьШапкаДатаАдрес = Макет.ПолучитьОбласть("ОбластьШапкаДатаАдрес");
	ДанныеШапкаДатаАдрес = Новый Структура;
	ДанныеШапкаДатаАдрес.Вставить("Дата",  Формат(ДанныеПечати[0].КАНАТ_ДатаСпецификации,"ДФ=dd.MM.yyyy; ДП='-'"));
	ДанныеШапкаДатаАдрес.Вставить("Адрес", "г. Коломна Московская обл.");
	ОбластьШапкаДатаАдрес.Параметры.Заполнить(ДанныеШапкаДатаАдрес);
	
	ТабличныйДокумент.Вывести(ОбластьШапкаДатаАдрес);
	ТабличныйДокумент.Вывести(ОбластьПустаяСтрока);
	
	ОбластьШапкаУсловия = Макет.ПолучитьОбласть("ОбластьШапкаУсловия");
	
	ТабличныйДокумент.Вывести(ОбластьШапкаУсловия);
	ТабличныйДокумент.Вывести(ОбластьПустаяСтрока);
	
	//Таблица
	ОбластьТаблицаШапка = Макет.ПолучитьОбласть("ОбластьТаблицаШапка");
	ТабличныйДокумент.Вывести(ОбластьТаблицаШапка);
	
	СуммаИтого = 0;
	
	Для Каждого Строка Из ДанныеПечати Цикл 
		
		ОбластьТаблицаСтрока = Макет.ПолучитьОбласть("ОбластьТаблицаСтрока");
		ОбластьТаблицаСтрока.Параметры.Заполнить(Строка);
		ТабличныйДокумент.Вывести(ОбластьТаблицаСтрока);
		
		СуммаИтого = СуммаИтого + Строка.СуммаСНДС;
		
	КонецЦикла;
	
	ОбластьТаблицаИтого = Макет.ПолучитьОбласть("ОбластьТаблицаИтого");
	ДанныеТаблицаИтого = Новый Структура;
	ДанныеТаблицаИтого.Вставить("ИтогоСумма", СуммаИтого);
	ОбластьТаблицаИтого.Параметры.Заполнить(ДанныеТаблицаИтого);
	ТабличныйДокумент.Вывести(ОбластьТаблицаИтого);
	ТабличныйДокумент.Вывести(ОбластьПустаяСтрока);
	
	//Комментарии
	ОбластьКомментарии = Макет.ПолучитьОбласть("ОбластьКомментарии");
	ДанныеОбластьКомментарии = Новый Структура;
	ДанныеОбластьКомментарии.Вставить("Примечание",      ДанныеПечати[0].КАНАТ_ПримечаниеКСпецификацииДоговора);
	ДанныеОбластьКомментарии.Вставить("ДанныеДоставка",  ДанныеПечати[0].КАНАТ_ДоставкаСпецификацияКДоговору);
	ДанныеОбластьКомментарии.Вставить("Дата",            Формат(ДанныеПечати[0].КАНАТ_ДатаСпецификации,"ДФ=dd.MM.yyyy; ДП='-'"));
	ДанныеОбластьКомментарии.Вставить("УсловияОплаты",   ПолучитьДанныеОплаты(Документ.ДокументОснование));
	//ДанныеОбластьКомментарии.Вставить("СпособОтгрузки",  ДанныеПечати[0].СпособДоставки);
	//ДанныеОбластьКомментарии.Вставить("Грузополучатель", ДанныеПечати[0].Грузополучатель);
	ДанныеОбластьКомментарии.Вставить("НомерДоговора",   ДанныеПечати[0].НомерДоговора);
	ДанныеОбластьКомментарии.Вставить("ДатаДоговора",    Формат(ДанныеПечати[0].ДатаДоговора,"ДФ=dd.MM.yyyy; ДП='-'"));
	ОбластьКомментарии.Параметры.Заполнить(ДанныеОбластьКомментарии);
	ТабличныйДокумент.Вывести(ОбластьКомментарии);
	ТабличныйДокумент.Вывести(ОбластьПустаяСтрока);
	
	//Подвал
	ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодвал");
	ДанныеПодвал = Новый Структура;
	//ДанныеПодвал.Вставить("Поставщик",  ?(ЗначениеЗаполнено(ДанныеПечати[0].Руководитель),
	//									  ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ДанныеПечати[0].Руководитель),
	//									  ""));
	Поставщик = РегистрыСведений.КАНАТ_ЛицаПодписывающиеЗаПодразделения.ПолучитьСотрудникаПоДолжности(Перечисления.КАНАТ_РолиПодписантов.ГенДиректор, ДанныеПечати[0].КАНАТ_ДатаСпецификации);
	ДанныеПодвал.Вставить("Поставщик",  ?(ЗначениеЗаполнено(Поставщик),
										  ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Поставщик.Наименование),
										  ""));
	ДанныеПодвал.Вставить("ПоставщикДолжность", "Ген. директор");
	
	ПокупательСтруктура = ПолучитьПокупателя(ДанныеПечати[0].Контрагент);
	//ДанныеПодвал.Вставить("Покупатель", ?(ЗначениеЗаполнено(ДанныеПечати[0].КонтактноеЛицо),
	//									  ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ДанныеПечати[0].КонтактноеЛицо),
	//									  ""));
	ДанныеПодвал.Вставить("ПокупательДолжность", ПокупательСтруктура.Должность);
	ДанныеПодвал.Вставить("Покупатель", ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ПокупательСтруктура.Наименование));
	
	ОбластьПодвал.Параметры.Заполнить(ДанныеПодвал);
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	ТабличныйДокумент.Вывести(ОбластьПустаяСтрока);
	
	//Скидки
	Если ДанныеПечати[0].ВыводитьСкидки Тогда
		Скидки = ДействиеСкидокНаценокПоИсточнику(Константы.КАНАТ_СоглашениеДляТиповогоТекстаСкидок.Получить(), ТекущаяДата());
		Если Скидки.Количество() > 0 Тогда
			
			ОбластьСкидка = Макет.ПолучитьОбласть("ОбластьСкидка");
			ТекстСкидки = "";
			Для Каждого Скидка Из Скидки Цикл
				
				ТекстСкидки = ТекстСкидки + Скидка.Наименование + Символы.ПС;
				
			КонецЦикла;
			
			ОбластьСкидка.Параметры.ТекстСкидки = ТекстСкидки;
			ТабличныйДокумент.Вывести(ОбластьСкидка);
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции
//-- Гурьев 04.09.23

Функция ПолучитьДанныеПечати_устар(Документ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказКлиента.КАНАТ_СпецификацияНомер КАК КАНАТ_СпецификацияНомер,
	|	ДоговорыКонтрагентов.Номер КАК НомерДоговора,
	|	ДоговорыКонтрагентов.Дата КАК ДатаДоговора,
	|	ЗаказКлиента.Организация.Наименование КАК ОрганизацияНаименование,
	|	ЗаказКлиента.Контрагент.Наименование КАК КонтрагентНаименование,
	|	ЗаказКлиента.КАНАТ_ДатаСпецификации КАК КАНАТ_ДатаСпецификации,
	|	ЗаказКлиентаТовары.КАНАТ_КомментарийКЗаказу КАК КАНАТ_КомментарийКЗаказу,
	|	ЗаказКлиентаТовары.Номенклатура.Наименование КАК НоменклатураНаименование,
	|	ЗаказКлиентаТовары.Количество КАК Количество,
	|	ЗаказКлиентаТовары.СтавкаНДС КАК СтавкаНДС,
	|	ЗаказКлиентаТовары.СуммаСНДС КАК СуммаСНДС,
	|	ЗаказКлиентаТовары.Цена КАК Цена,
	|	ЗаказКлиентаТовары.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЗаказКлиента.СпособДоставки КАК СпособДоставки,
	|	ЗаказКлиента.Грузополучатель КАК Грузополучатель,
	|	ЗаказКлиента.Руководитель.ФизическоеЛицо.ФИО КАК Руководитель,
	|	ДоговорыКонтрагентов.КонтактноеЛицо.Наименование КАК КонтактноеЛицо,
	|	ЕСТЬNULL(СоглашенияСКлиентами.КАНАТ_ВыводитьСкидки, ЛОЖЬ) КАК ВыводитьСкидки
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ЗаказКлиента.Договор = ДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|		ПО ЗаказКлиента.Ссылка = ЗаказКлиентаТовары.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами КАК СоглашенияСКлиентами
	|		ПО ЗаказКлиента.Соглашение = СоглашенияСКлиентами.Ссылка
	|ГДЕ
	|	ЗаказКлиента.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Документ);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьДанныеОплаты(Документ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиентаЭтапыГрафикаОплаты.ПроцентПлатежа КАК ПроцентПлатежа,
		|	ЗаказКлиентаЭтапыГрафикаОплаты.ВариантОтсчета КАК ВариантОтсчета
		|ИЗ
		|	Документ.ЗаказКлиента.ЭтапыГрафикаОплаты КАК ЗаказКлиентаЭтапыГрафикаОплаты
		|ГДЕ
		|	ЗаказКлиентаЭтапыГрафикаОплаты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Документ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат "По договору"
		
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ПроцентПредоплаты = 0;
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ВариантОтсчета <> Перечисления.ВариантыОтсчетаДатыПлатежа.ОтДатыОтгрузки Тогда
			
			ПроцентПредоплаты = ПроцентПредоплаты + Выборка.ПроцентПлатежа;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ПроцентПредоплаты > 0 Тогда 
		
		Возврат "Предоплата " + Строка(ПроцентПредоплаты) + "%";
		
	Иначе
		
		Возврат "Постоплата";
		
	КонецЕсли;
	
КонецФункции

Функция ДействиеСкидокНаценокПоИсточнику(Источник, Дата)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка                                                              КАК СкидкаНаценка,
	|	ЕСТЬNULL(ДействиеСкидокНаценокСрезПоследних.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыДействияСкидок.НеДействует)) КАК Статус,
	|	
	|	ВЫБОР
	|		КОГДА ДействиеСкидокНаценокСрезПоследних.Статус ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Использование,
	|	
	|	ЕСТЬNULL(ДействиеСкидокНаценокСрезПоследних.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаНачала,
	|	
	|	ВЫБОР КОГДА ДействиеСкидокНаценокСрезПоследних.Период ЕСТЬ NULL ТОГДА
	|		ЕСТЬNULL(ДобавитьКДате(ДействиеСкидокНаценокСрезПервых.Период, ДЕНЬ, -1), ДАТАВРЕМЯ(1, 1, 1)) 
	|	ИНАЧЕ
	|		ЕСТЬNULL(ДобавитьКДате(Таблица.Период, ДЕНЬ, -1), ДАТАВРЕМЯ(1, 1, 1))
	|	КОНЕЦ КАК ДатаОкончания,
	|	ТаблицаСкидкиНаценки.Наименование КАК Наименование
	|	
	|ИЗ
	|	Справочник.СкидкиНаценки КАК ТаблицаСкидкиНаценки
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			РегистрСведений.ДействиеСкидокНаценок.СрезПоследних(&ДатаСреза, Источник = &Источник) КАК ДействиеСкидокНаценокСрезПоследних
	|			ПО ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка = ТаблицаСкидкиНаценки.Ссылка
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МИНИМУМ(Т.Период) КАК Период,
	|			Т.СкидкаНаценка КАК СкидкаНаценка
	|		ИЗ
	|			РегистрСведений.ДействиеСкидокНаценок.СрезПоследних(&ДатаСреза, Источник = &Источник) КАК Срез
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДействиеСкидокНаценок КАК Т
	|				ПО (Т.СкидкаНаценка = Срез.СкидкаНаценка)
	|					И Т.Источник = Срез.Источник
	|					И Т.Период > Срез.Период
	|					И Т.Статус <> Срез.Статус
	|		СГРУППИРОВАТЬ ПО
	|			Т.СкидкаНаценка) КАК Таблица
	|		ПО (Таблица.СкидкаНаценка = ТаблицаСкидкиНаценки.Ссылка)
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДействиеСкидокНаценок.СрезПервых(
	|				&ДатаСреза,
	|				Источник = &Источник) КАК ДействиеСкидокНаценокСрезПервых
	|		ПО ДействиеСкидокНаценокСрезПервых.СкидкаНаценка = ТаблицаСкидкиНаценки.Ссылка
	|ГДЕ
	|	    (НЕ ДействиеСкидокНаценокСрезПоследних.Период ЕСТЬ NULL
	|	ИЛИ НЕ ДействиеСкидокНаценокСрезПервых.Период ЕСТЬ NULL)
	|	И ЕСТЬNULL(ДействиеСкидокНаценокСрезПоследних.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыДействияСкидок.НеДействует)) = ЗНАЧЕНИЕ(Перечисление.СтатусыДействияСкидок.Действует)
	|");
	
	Запрос.УстановитьПараметр("ДатаСреза", Дата);
	Запрос.УстановитьПараметр("Источник", Источник);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьДанныеПечати(Документ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Номер КАК НомерДоговора,
	|	ДоговорыКонтрагентов.Дата КАК ДатаДоговора,
	|	ЗаказКлиента.Организация.Наименование КАК ОрганизацияНаименование,
	|	ЗаказКлиента.Руководитель.ФизическоеЛицо.ФИО КАК Руководитель,
	|	ДоговорыКонтрагентов.КонтактноеЛицо.Наименование КАК КонтактноеЛицо,
	|	ЕСТЬNULL(СоглашенияСКлиентами.КАНАТ_ВыводитьСкидки, ЛОЖЬ) КАК ВыводитьСкидки,
	|	МАКСИМУМ(КАНАТ_СпецификацияКДоговору.ПорядковыйНомер) КАК КАНАТ_СпецификацияНомер,
	|	КАНАТ_СпецификацияКДоговору.Контрагент.Наименование КАК КонтрагентНаименование,
	|	КАНАТ_СпецификацияКДоговору.Контрагент.НаименованиеПолное КАК КонтрагентСокрНаименование,
	|	КАНАТ_СпецификацияКДоговору.Дата КАК КАНАТ_ДатаСпецификации,
	|	КАНАТ_СпецификацияКДоговоруТовары.Номенклатура.Наименование КАК НоменклатураНаименование,
	|	СУММА(КАНАТ_СпецификацияКДоговоруТовары.Количество) КАК Количество,
	|	КАНАТ_СпецификацияКДоговоруТовары.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(КАНАТ_СпецификацияКДоговоруТовары.СуммаСНДС) КАК СуммаСНДС,
	|	КАНАТ_СпецификацияКДоговоруТовары.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	КАНАТ_СпецификацияКДоговоруТовары.КАНАТ_КомментарийКЗаказу КАК КАНАТ_КомментарийКЗаказу,
	|	КАНАТ_СпецификацияКДоговоруТовары.СуммаБезНДС / КАНАТ_СпецификацияКДоговоруТовары.Количество КАК Цена,
	|	КАНАТ_СпецификацияКДоговору.КАНАТ_ПримечаниеКСпецификацииДоговора КАК КАНАТ_ПримечаниеКСпецификацииДоговора,
	|	КАНАТ_СпецификацияКДоговору.КАНАТ_ДоставкаСпецификацияКДоговору КАК КАНАТ_ДоставкаСпецификацияКДоговору,
	|	КАНАТ_СпецификацияКДоговору.Контрагент КАК Контрагент
	|ИЗ
	|	Документ.КАНАТ_СпецификацияКДоговору КАК КАНАТ_СпецификацияКДоговору
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ПО КАНАТ_СпецификацияКДоговору.ДокументОснование = ЗаказКлиента.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КАНАТ_СпецификацияКДоговору.Товары КАК КАНАТ_СпецификацияКДоговоруТовары
	|		ПО (КАНАТ_СпецификацияКДоговоруТовары.Ссылка = КАНАТ_СпецификацияКДоговору.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО КАНАТ_СпецификацияКДоговору.Договор = ДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами КАК СоглашенияСКлиентами
	|		ПО КАНАТ_СпецификацияКДоговору.Соглашение = СоглашенияСКлиентами.Ссылка
	|ГДЕ
	|	КАНАТ_СпецификацияКДоговору.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоговорыКонтрагентов.Номер,
	|	ДоговорыКонтрагентов.Дата,
	|	ЗаказКлиента.Организация.Наименование,
	|	ЗаказКлиента.Руководитель.ФизическоеЛицо.ФИО,
	|	ДоговорыКонтрагентов.КонтактноеЛицо.Наименование,
	|	ЕСТЬNULL(СоглашенияСКлиентами.КАНАТ_ВыводитьСкидки, ЛОЖЬ),
	|	КАНАТ_СпецификацияКДоговору.Контрагент.Наименование,
	|	КАНАТ_СпецификацияКДоговору.Контрагент.НаименованиеПолное,
	|	КАНАТ_СпецификацияКДоговору.Дата,
	|	КАНАТ_СпецификацияКДоговоруТовары.Номенклатура.Наименование,
	|	КАНАТ_СпецификацияКДоговоруТовары.СтавкаНДС,
	|	КАНАТ_СпецификацияКДоговоруТовары.Номенклатура.ЕдиницаИзмерения,
	|	КАНАТ_СпецификацияКДоговоруТовары.КАНАТ_КомментарийКЗаказу,
	|	КАНАТ_СпецификацияКДоговору.Контрагент,
	|	КАНАТ_СпецификацияКДоговору.КАНАТ_ПримечаниеКСпецификацииДоговора,
	|	КАНАТ_СпецификацияКДоговору.КАНАТ_ДоставкаСпецификацияКДоговору,
	|	КАНАТ_СпецификацияКДоговоруТовары.СуммаБезНДС / КАНАТ_СпецификацияКДоговоруТовары.Количество";
	
	Запрос.УстановитьПараметр("Ссылка", Документ);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьПокупателя(Контрагент)
	
	Результат = Новый Структура;
	Результат.Вставить("Наименование", "");
	Результат.Вставить("Должность", "");
	
	Если ЗначениеЗаполнено(Контрагент) И ЗначениеЗаполнено(Контрагент.Партнер) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	КонтактныеЛицаПартнеров.Наименование КАК Наименование,
			|	КонтактныеЛицаПартнеров.ДолжностьПоВизитке КАК ДолжностьПоВизитке
			|ИЗ
			|	Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
			|ГДЕ
			|	КонтактныеЛицаПартнеров.Владелец = &Владелец
			|	И КонтактныеЛицаПартнеров.КАНАТ_Подписант = ИСТИНА";
		
		Запрос.УстановитьПараметр("Владелец", Контрагент.Партнер);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Результат.Наименование = ВыборкаДетальныеЗаписи.Наименование;
			Результат.Должность = ВыборкаДетальныеЗаписи.ДолжностьПоВизитке;
		КонецЦикла;
		
	КонецЕсли;

	Возврат Результат;
	
КонецФункции