
&ИзменениеИКонтроль("СписокОпераций")
Функция КАНАТ_СписокОпераций()

	СписокОпераций = Новый СписокЗначений;

	ПеремещениеПолуфабрикатов               = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПеремещениеПолуфабрикатов");
	ПеремещениеПолуфабрикатовМеждуФилиалами = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПеремещениеПолуфабрикатовМеждуФилиалами");

	ПередачаПродукцииИзКладовой     = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаПродукцииИзКладовой");
	ПередачаМатериаловВКладовую     = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаМатериаловВКладовую");
	ВозвратМатериаловИзКладовой     = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВозвратМатериаловИзКладовой");

	//++ НЕ УТКА
	ПередачаПродукцииИзПроизводства = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаПродукцииИзПроизводства");
	#Удаление
	ПередачаМатериаловВПроизводство = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаМатериаловВПроизводство");
	#КонецУдаления
	#Вставка
	//БИТ_Гурьев_ЧТЗ_3.7_06.03.24++
	Если Пользователи.ЭтоПолноправныйПользователь() Тогда
		
		ПередачаМатериаловВПроизводство = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаМатериаловВПроизводство");
		
	КонецЕсли;
	//БИТ_Гурьев_ЧТЗ_3.7_06.03.24--
	#конецВставки
	ВозвратМатериаловИзПроизводства = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВозвратМатериаловИзПроизводства");

	СписокОпераций.Добавить(ПередачаПродукцииИзПроизводства, НСтр("ru = 'Передача продукции из производства';
	|en = 'Transfer of products from production'"));
	СписокОпераций.Добавить(ПередачаМатериаловВПроизводство, НСтр("ru = 'Передача материалов в производство';
	|en = 'Transfer of materials to production'"));
	СписокОпераций.Добавить(ВозвратМатериаловИзПроизводства, НСтр("ru = 'Возврат материалов из производства';
	|en = 'Return of materials from production'"));
	//-- НЕ УТКА

	Если ПолучитьФункциональнуюОпцию("ИспользоватьОбособленныеПодразделенияВыделенныеНаБаланс") Тогда
		СписокОпераций.Добавить(ПеремещениеПолуфабрикатовМеждуФилиалами, НСтр("ru = 'Перемещение полуфабрикатов между филиалами';
		|en = 'Transfer of semi-finished products between branch offices'"));
	КонецЕсли;

	Если ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоСкладов") Тогда

		СписокОпераций.Добавить(ПередачаПродукцииИзКладовой, НСтр("ru = 'Передача продукции из кладовой';
		|en = 'Transfer of products from shop floor stockroom'"));
		СписокОпераций.Добавить(ПередачаМатериаловВКладовую, НСтр("ru = 'Передача материалов в кладовую';
		|en = 'Transfer of materials to shop floor stockroom'"));
		СписокОпераций.Добавить(ВозвратМатериаловИзКладовой, НСтр("ru = 'Возврат материалов из кладовой';
		|en = 'Return of materials from storeroom'"));
		СписокОпераций.Добавить(ПеремещениеПолуфабрикатов,   НСтр("ru = 'Перемещение полуфабрикатов';
		|en = 'Transfer of semi-finished products'"));

	КонецЕсли;

	ДоступныеХозяйственныеОперации = ОбщегоНазначенияУТВызовСервера.ДоступныеХозяйственныеОперации("Документ.ДвижениеПродукцииИМатериалов");

	Если ДоступныеХозяйственныеОперации <> Неопределено Тогда

		Индекс = СписокОпераций.Количество()-1;

		Пока Индекс >= 0 Цикл

			Если ДоступныеХозяйственныеОперации.Найти(СписокОпераций[Индекс].Значение) = Неопределено Тогда
				СписокОпераций.Удалить(Индекс);
			КонецЕсли;

			Индекс = Индекс -1;

		КонецЦикла;

	КонецЕсли;

	Возврат СписокОпераций;

КонецФункции
