
&Перед("ОбработкаПроведения")
Процедура КАНАТ_ОбработкаПроведенияПеред(Отказ, РежимПроведения)
	//БИТ_Гурьев_ЧТЗ_3.7_26.02.24++
	Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаМатериаловВКладовую
		//ИЛИ ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаМатериаловВПроизводство)
		И Отказ = Ложь Тогда
		
		ОтменитьПроведениеСборокТоваров();
		
	КонецЕсли;
	//БИТ_Гурьев_ЧТЗ_3.7_26.02.24--
КонецПроцедуры

&После("ОбработкаПроведения")
Процедура КАНАТ_ОбработкаПроведенияПосле(Отказ, РежимПроведения)
	//БИТ_Гурьев_ЧТЗ_3.7_26.02.24++
	Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаМатериаловВКладовую
		//ИЛИ ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаМатериаловВПроизводство)
		И Отказ = Ложь Тогда
		
		СоздатьСборкуНоменклатурыБезХарактеристик();
		
	КонецЕсли;
	//БИТ_Гурьев_ЧТЗ_3.7_26.02.24--
КонецПроцедуры

//БИТ_Гурьев_ЧТЗ_3.7_26.02.24++
Процедура СоздатьСборкуНоменклатурыБезХарактеристик()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Номенклатура,
		|	ВариантыКомплектацииНоменклатурыТовары.Характеристика КАК Характеристика,
		|	ВариантыКомплектацииНоменклатуры.Владелец КАК Владелец,
		|	СборкаТоваров.Ссылка КАК СборкаТоваровСсылка,
		|	СУММА(ДвижениеПродукцииИМатериаловТовары.КоличествоУпаковок) КАК КоличествоУпаковок,
		|	СУММА(ДвижениеПродукцииИМатериаловТовары.Количество) КАК Количество,
		|	ДвижениеПродукцииИМатериаловТовары.Упаковка КАК Упаковка, 
		|	ДвижениеПродукцииИМатериаловТовары.Серия,
		|	ДвижениеПродукцииИМатериаловТовары.СтатусУказанияСерий,
		|	СборкаТоваров.Дата КАК СборкаТоваровДата
		|ИЗ
		|	Документ.ДвижениеПродукцииИМатериалов.Товары КАК ДвижениеПродукцииИМатериаловТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
		|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.СборкаТоваров КАК СборкаТоваров
		|				ПО (СборкаТоваров.КАНАТ_ДвижениеПродукцииИМатериалов = &Ссылка
		|					И СборкаТоваров.Номенклатура = ВариантыКомплектацииНоменклатуры.Владелец
		|					И СборкаТоваров.ПометкаУдаления = Ложь)
		|			ПО (ВариантыКомплектацииНоменклатурыТовары.Ссылка = ВариантыКомплектацииНоменклатуры.Ссылка
		|				И ВариантыКомплектацииНоменклатуры.Основной = Истина
		|				И ВариантыКомплектацииНоменклатуры.ПометкаУдаления = Ложь)
		|		ПО (ДвижениеПродукцииИМатериаловТовары.Номенклатура = ВариантыКомплектацииНоменклатурыТовары.Номенклатура
		|			И ДвижениеПродукцииИМатериаловТовары.Характеристика = ВариантыКомплектацииНоменклатурыТовары.Характеристика)
		|ГДЕ
		|	ДвижениеПродукцииИМатериаловТовары.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура,
		|	ВариантыКомплектацииНоменклатурыТовары.Характеристика,
		|	ДвижениеПродукцииИМатериаловТовары.Серия,    
		|	ДвижениеПродукцииИМатериаловТовары.СтатусУказанияСерий,
		|	ВариантыКомплектацииНоменклатуры.Владелец,
		|	СборкаТоваров.Ссылка,
		|	ДвижениеПродукцииИМатериаловТовары.Упаковка,
		|	СборкаТоваров.Дата
		|УПОРЯДОЧИТЬ ПО
		|	СборкаТоваровДата ВОЗР
		|ИТОГИ
		|	СУММА(КоличествоУпаковок),
		|	СУММА(Количество)
		|ПО
		|	Владелец, СборкаТоваровСсылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	ЗначениеВСтрокуВнутр(Новый Структура("Текст,Параметры",Запрос.Текст,Запрос.Параметры));
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаВладелец = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаВладелец.Следующий() Цикл
		
		ВыборкаСборкаТоваров = ВыборкаВладелец.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		СборкаТоваровОбъект = Неопределено;
		
		Пока ВыборкаСборкаТоваров.Следующий() Цикл
			
			СборкаТоваровСсылка = ВыборкаСборкаТоваров.СборкаТоваровСсылка;
			
			Если ЗначениеЗаполнено(СборкаТоваровСсылка) Тогда
				
				СборкаТоваровОбъект = СборкаТоваровСсылка.ПолучитьОбъект();
				
			ИначеЕсли СборкаТоваровОбъект = Неопределено Тогда
				
				СборкаТоваровОбъект = Документы.СборкаТоваров.СоздатьДокумент();
				
			Иначе
				
				Продолжить;
				
			КонецЕсли;
			
			СборкаТоваровОбъект.Дата = Дата+100;
			СборкаТоваровОбъект.Склад = ?(ТипЗнч(Получатель) = Тип("СправочникСсылка.Склады"),
																	Получатель,
																	Справочники.Склады.ПустаяСсылка());
			СборкаТоваровОбъект.Организация = Организация;
			СборкаТоваровОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СборкаТоваров;
			СборкаТоваровОбъект.Номенклатура = ВыборкаВладелец.Владелец;
			СборкаТоваровОбъект.Комментарий = СтрШаблон("Создано автоматически на основании документа передачи №%1 от %2",
														Номер,
														Дата);
			СборкаТоваровОбъект.КоличествоУпаковок = ВыборкаВладелец.КоличествоУпаковок;
			СборкаТоваровОбъект.Количество = ВыборкаВладелец.Количество;
			СборкаТоваровОбъект.СборкаПодДеятельность = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
			СборкаТоваровОбъект.КАНАТ_ДвижениеПродукцииИМатериалов = Ссылка;
			СборкаТоваровОбъект.ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;
			СборкаТоваровОбъект.Статус = Перечисления.СтатусыСборокТоваров.СобраноРазобрано;
			
			СборкаТоваровОбъект.Товары.Очистить();
			ВыборкаДетальныеЗаписи = ВыборкаСборкаТоваров.Выбрать();
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
				Строка = СборкаТоваровОбъект.Товары.Добавить();
				
				ЗаполнитьЗначенияСвойств(Строка, ВыборкаДетальныеЗаписи); 
				Найденные = Серии.НайтиСтроки(Новый Структура("Номенклатура,Характеристика,Количество",ВыборкаДетальныеЗаписи.Номенклатура,ВыборкаДетальныеЗаписи.Характеристика,ВыборкаДетальныеЗаписи.Количество));
				Если Найденные.Количество() > 0 ТОгда
					Строка.Серия = Найденные[0].Серия;    
					
					Строка = СборкаТоваровОбъект.Серии.Добавить();
					ЗаполнитьЗначенияСвойств(Строка, ВыборкаДетальныеЗаписи); 
					Строка.Серия = Найденные[0].Серия;    
				КонецЕсли;	

			КонецЦикла;
			
		КонецЦикла;
			
		СборкаТоваровОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);


КонецПроцедуры //БИТ_Гурьев_ЧТЗ_3.7_26.02.24--

//БИТ_Гурьев_ЧТЗ_3.7_26.02.24++
Процедура ОтменитьПроведениеСборокТоваров()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СборкаТоваров.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СборкаТоваров КАК СборкаТоваров
		|ГДЕ
		|	СборкаТоваров.КАНАТ_ДвижениеПродукцииИМатериалов = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СборкаТоваровОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		СборкаТоваровОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры //БИТ_Гурьев_ЧТЗ_3.7_26.02.24--

&После("ОбработкаУдаленияПроведения")
Процедура КАНАТ_ОбработкаУдаленияПроведения(Отказ)
	//БИТ_Гурьев_ЧТЗ_3.7_26.02.24++
	ОтменитьПроведениеСборокТоваров();
	//БИТ_Гурьев_ЧТЗ_3.7_26.02.24--
КонецПроцедуры
