
&НаСервере
Процедура КАНАТ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	КАНАТ_ДобавитьЭлементыФормы();
КонецПроцедуры


&НаСервере
Процедура КАНАТ_ДобавитьЭлементыФормы()
	Элемент = Элементы.Добавить("КАНАТ_ГруппаФинансовогоУчетаВспомогательногоСырья",Тип("ПолеФормы"), Элементы.ГруппаШапкаГоризонтальная);
	Элемент.Вид = ВидПоляФормы.ПолеФлажка;
	Элемент.Заголовок = "Вспомогательное сырьё (КАНАТ)";
	Элемент.ПутьКДанным = "Объект.КАНАТ_ГруппаФинансовогоУчетаВспомогательногоСырья";
    Элемент.Доступность = Истина;
	Элемент.ТолькоПросмотр = Ложь;
КонецПроцедуры
