// <+БИТ> Руденков_Е.И. 25.07.2024  
// ШК-1 Канат Процесс штрихкодирования
&НаСервере
&ИзменениеИКонтроль("ЗаполнитьФорму")
Процедура КАНАТ_ЗаполнитьФорму()

	СтруктураОрдера = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка,
	"Склад, Комментарий, Помещение, ЗонаПриемки, Исполнитель, НомерВходящегоДокумента, ДатаВходящегоДокумента, Товары");

	Склад       = СтруктураОрдера.Склад;
	Комментарий = СтруктураОрдера.Комментарий;
	Помещение   = СтруктураОрдера.Помещение;
	ЗонаПриемки = СтруктураОрдера.ЗонаПриемки;
	Исполнитель = СтруктураОрдера.Исполнитель;
	НомерВходящегоДокумента = СтруктураОрдера.НомерВходящегоДокумента;
	ДатаВходящегоДокумента  = СтруктураОрдера.ДатаВходящегоДокумента;

	СвойстваСклада = Обработки.МобильноеРабочееМестоКладовщика.СвойстваСклада(Склад);

	ИспользоватьАдресноеХранение            = СвойстваСклада.ИспользоватьАдресноеХранение;
	ИспользоватьОрдернуюСхемуПриПоступлении = СвойстваСклада.ИспользоватьОрдернуюСхемуПриПоступлении;

	Если СвойстваСклада.ИспользоватьСкладскиеПомещения Тогда
		СтруктураПомещения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Помещение, "ИспользоватьАдресноеХранение");
		ИспользоватьАдресноеХранение = СтруктураПомещения.ИспользоватьАдресноеХранение;
	КонецЕсли;

	ТоварыКПоступлению.Загрузить(СтруктураОрдера.Товары.Выгрузить());
    #Удаление
	Для Каждого Строка Из СтруктураОрдера.Товары.Выгрузить() Цикл

		Если Строка.Количество > 0 Тогда
			НоваяСтрока = ТоварыПринято.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		КонецЕсли;

	КонецЦикла;
    #КонецУдаления
	СтруктураРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "ШтрихкодыУпаковок");
	Для Каждого Строка Из СтруктураРеквизитов.ШтрихкодыУпаковок.Выгрузить() Цикл

		СтрокаШтрихкод = ШтрихкодыУпаковок.Добавить();
		СтрокаШтрихкод.ШтрихкодУпаковки = Строка.ШтрихкодУпаковки;

		СтруктураРеквизитовШтрихкода = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Строка.ШтрихкодУпаковки,
		"Номенклатура, Характеристика");

		СтрокаШтрихкод.Номенклатура = СтруктураРеквизитовШтрихкода.Номенклатура;
		СтрокаШтрихкод.Характеристика = СтруктураРеквизитовШтрихкода.Характеристика;

	КонецЦикла;

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ОбновитьФормуНаСервере")
Процедура КАНАТ_ОбновитьФормуНаСервере(Результат)

	КоэффициентУпаковки = Справочники.УпаковкиЕдиницыИзмерения.КоэффициентУпаковки(Результат.Упаковка, Результат.Номенклатура);

	Если Результат.Режим = "РедактированиеПриемка" Тогда

		Литерал = "НомерСтроки";
		НомерСтроки = Результат[Литерал];

		ТоварыПринято[НомерСтроки].Упаковка           = Результат.Упаковка;
		ТоварыПринято[НомерСтроки].КоличествоУпаковок = Результат.КоличествоУпаковок;
		ТоварыПринято[НомерСтроки].Количество         = ТоварыПринято[НомерСтроки].КоличествоУпаковок * КоэффициентУпаковки;
		ТоварыПринято[НомерСтроки].Серия              = Результат.Серия;
		ТоварыПринято[НомерСтроки].Назначение         = Результат.Назначение;

	Иначе

		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Номенклатура", Результат.Номенклатура);
		СтруктураПоиска.Вставить("Характеристика", Результат.Характеристика);
		СтруктураПоиска.Вставить("Серия", Результат.Серия);
		СтруктураПоиска.Вставить("Упаковка", Результат.Упаковка);
		СтруктураПоиска.Вставить("Назначение", Результат.Назначение);

		РезультатПоиска = ТоварыПринято.НайтиСтроки(СтруктураПоиска);
		Если РезультатПоиска.Количество() > 0 Тогда
			РезультатПоиска[0].КоличествоУпаковок = РезультатПоиска[0].КоличествоУпаковок + Результат.КоличествоУпаковок;
			РезультатПоиска[0].Количество = РезультатПоиска[0].КоличествоУпаковок * КоэффициентУпаковки;
		Иначе
			НоваяСтрока = ТоварыПринято.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Результат);
			НоваяСтрока.Количество = НоваяСтрока.КоличествоУпаковок * КоэффициентУпаковки;
		КонецЕсли;
		
		#Вставка
		СтрокиКПримке = ТоварыКПоступлению.НайтиСтроки(СтруктураПоиска);
		Если СтрокиКПримке.Количество() > 0 Тогда
			УменьшитьТоварыКПоступлению(СтрокиКПримке,Результат);
		Иначе//Поиск с пустой серией
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("Номенклатура", Результат.Номенклатура);
			СтруктураПоиска.Вставить("Характеристика", Результат.Характеристика);
			СтруктураПоиска.Вставить("Серия", Справочники.СерииНоменклатуры.ПустаяСсылка());
			СтруктураПоиска.Вставить("Упаковка", Результат.Упаковка);
			//СтруктураПоиска.Вставить("Назначение", Результат.Назначение);
			
			СтрокиКПримке = ТоварыКПоступлению.НайтиСтроки(СтруктураПоиска);
			Если СтрокиКПримке.Количество() > 0 Тогда
				УменьшитьТоварыКПоступлению(СтрокиКПримке,Результат);
			Иначе//Поиск с пустой упаковкой
				СтруктураПоиска = Новый Структура;
				СтруктураПоиска.Вставить("Номенклатура", Результат.Номенклатура);
				СтруктураПоиска.Вставить("Характеристика", Результат.Характеристика);
				СтруктураПоиска.Вставить("Серия", Результат.Серия);
				СтруктураПоиска.Вставить("Упаковка", Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка());
				//СтруктураПоиска.Вставить("Назначение", Результат.Назначение);
				
				СтрокиКПримке = ТоварыКПоступлению.НайтиСтроки(СтруктураПоиска);
				Если СтрокиКПримке.Количество() > 0 Тогда
					УменьшитьТоварыКПоступлению(СтрокиКПримке,Результат);
				Иначе//Поиск с пустой серией и пустой упаковкой
					СтруктураПоиска = Новый Структура;
					СтруктураПоиска.Вставить("Номенклатура", Результат.Номенклатура);
					СтруктураПоиска.Вставить("Характеристика", Результат.Характеристика);
					СтруктураПоиска.Вставить("Серия", Справочники.СерииНоменклатуры.ПустаяСсылка());
					СтруктураПоиска.Вставить("Упаковка", Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка());
					//СтруктураПоиска.Вставить("Назначение", Результат.Назначение);
					
					СтрокиКПримке = ТоварыКПоступлению.НайтиСтроки(СтруктураПоиска);
					Если СтрокиКПримке.Количество() > 0 Тогда
						УменьшитьТоварыКПоступлению(СтрокиКПримке,Результат);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		#КонецВставки
	КонецЕсли;

	Для Каждого СтрокаКодМаркировки Из Результат.ШтрихкодыУпаковок Цикл

		НоваяСтрока = ШтрихкодыУпаковок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаКодМаркировки);

	КонецЦикла;

	СформироватьЗаголовкиКомандМеню();

КонецПроцедуры

Процедура УменьшитьТоварыКПоступлению(СтрокиКПримке,Результат)
	Если СтрокиКПримке[0].КоличествоУпаковок <= Результат.КоличествоУпаковок Тогда
		ТоварыКПоступлению.Удалить(СтрокиКПримке[0]);
	Иначе
		СтрокиКПримке[0].КоличествоУпаковок = СтрокиКПримке[0].КоличествоУпаковок - Результат.КоличествоУпаковок;
	КонецЕсли;
КонецПроцедуры

// <-БИТ> Руденков_Е.И. 25.07.2024