//++БИТ_Гурьев_26.12.23 Форма подбора для сырья в документ Результат испытаний

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Период = Параметры.Период;
	Склад = Параметры.Склад;
	Период.ДатаНачала    = НачалоМесяца(ТекущаяДата());
	Период.ДатаОкончания = КонецМесяца(ТекущаяДата()); 
	ОбновитьТаблицуСырья();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	
	ОбновитьТаблицуСырья();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ОбновитьТаблицуСырья();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Перенести(Команда)
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ПереносСырья", Истина);
	
	ЭтаФорма.Закрыть(СписокСырья.НайтиСтроки(СтруктураОтбора));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьТаблицуСырья()
	
	Запрос = Новый Запрос;
	////БИТ_Гурьев_ПравкиПоПодборуТоваров_19.09.24++
	//Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	//               |	ТоварыНаСкладахОстаткиИОбороты.Номенклатура КАК Сырье,
	//               |	ТоварыНаСкладахОстаткиИОбороты.Характеристика КАК Характеристика,
	//               |	ТоварыНаСкладахОстаткиИОбороты.Склад КАК Склад,
	//               |	ТоварыНаСкладахОстаткиИОбороты.ВНаличииПриход КАК Приход,
	//               |	ТоварыНаСкладахОстаткиИОбороты.ВНаличииНачальныйОстаток КАК НачОстаток
	//               |ИЗ
	//               |	РегистрНакопления.ТоварыНаСкладах.ОстаткиИОбороты(&ДатаНачала, &ДатаОкончания, Авто, , ) КАК ТоварыНаСкладахОстаткиИОбороты
	//               |		ПОЛНОЕ СОЕДИНЕНИЕ Документ.ДвижениеПродукцииИМатериалов.Товары КАК ДвижениеПродукцииИМатериаловТовары
	//               |		ПО (ДвижениеПродукцииИМатериаловТовары.Номенклатура = ТоварыНаСкладахОстаткиИОбороты.Номенклатура)
	//               |			И (ДвижениеПродукцииИМатериаловТовары.Характеристика = ТоварыНаСкладахОстаткиИОбороты.Характеристика)
	//               |ГДЕ
	//               |	ТоварыНаСкладахОстаткиИОбороты.Склад = &Склад
	//               |	И (ТоварыНаСкладахОстаткиИОбороты.ВНаличииПриход > 0
	//               |			ИЛИ ТоварыНаСкладахОстаткиИОбороты.ВНаличииНачальныйОстаток > 0)
	//               |	И ДвижениеПродукцииИМатериаловТовары.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаМатериаловВКладовую)
	//               |			И ДвижениеПродукцииИМатериаловТовары.Ссылка.Проведен = ИСТИНА
	//               |
	//               |УПОРЯДОЧИТЬ ПО
	//               |	Сырье";
	//БИТ_Гурьев_ПравкиПоПодборуТоваров_19.09.24--
	
	//БИТ_Шамсиев++ 10.10.2024 Письмо от 01.10.24:
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТоварыНаСкладахОстаткиИОбороты.Номенклатура КАК Сырье,
	|	ТоварыНаСкладахОстаткиИОбороты.Характеристика КАК Характеристика,
	|	ТоварыНаСкладахОстаткиИОбороты.Склад КАК Склад,
	|	ТоварыНаСкладахОстаткиИОбороты.ВНаличииПриход КАК Приход,
	|	ТоварыНаСкладахОстаткиИОбороты.ВНаличииНачальныйОстаток КАК НачОстаток,
	|	ТоварыНаСкладахОстаткиИОбороты.Регистратор КАК Регистратор,
	//++Бит Трейгер П.М. 19.12.2024 Блок Качества. Переделка.
	|   ТоварыНаСкладахОстаткиИОбороты.Серия как Серия
	//--Бит Трейгер П.М. 19.12.2024 Блок Качества. Переделка. добавил параметр серия
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.ОстаткиИОбороты(&ДатаНачала, &ДатаОкончания, Авто, , Склад = &Склад) КАК ТоварыНаСкладахОстаткиИОбороты
	|ГДЕ
	|	(ТоварыНаСкладахОстаткиИОбороты.ВНаличииПриход > 0
	|			ИЛИ ТоварыНаСкладахОстаткиИОбороты.ВНаличииНачальныйОстаток > 0)
	|	И ТИПЗНАЧЕНИЯ(ТоварыНаСкладахОстаткиИОбороты.Регистратор.Ссылка) = ТИП(Документ.ДвижениеПродукцииИМатериалов)
	//++Бит Трейгер П.М. 19.12.2024 Блок Качества. Переделка. добавил параметр серия
	//|   и ТоварыНаСкладахОстаткиИОбороты.Серия = &Серия
	//--Бит Трейгер П.М. 19.12.2024 Блок Качества. Переделка. добавил параметр серия
	|УПОРЯДОЧИТЬ ПО
	|	Сырье";   
	//БИТ_Шамсиев-- 10.10.2024 Письмо от 01.10.24:

	Запрос.УстановитьПараметр("Склад",         Склад);
	Запрос.УстановитьПараметр("ДатаНачала",    Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Период.ДатаОкончания);
	//++Бит Трейгер П.М. 19.12.2024 Блок Качества. Переделка.
	//Запрос.УстановитьПараметр("Серия", Серия);
	//--Бит Трейгер П.М. 19.12.2024 Блок Качества. Переделка.
	ТЗСырье = Запрос.Выполнить().Выгрузить();
	СписокСырья.Загрузить(ТЗСырье);
	
КонецПроцедуры

#КонецОбласти