// <+БИТ> Руденков_Е.И. 28.10.2024  
// Пересчет норм по ресурсной спецификации
&НаСервере
Процедура КАНАТ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ДобавитьЭлементыРасширения();
	
КонецПроцедуры // <-БИТ> Руденков_Е.И. 28.10.2024

// <+БИТ> Руденков_Е.И. 28.10.2024  
// Пересчет норм по ресурсной спецификации
Процедура ДобавитьЭлементыРасширения()
	
	//КАНАТ_ИсполнительРабот
	ПолеВвода = Элементы.Добавить(
		"КАНАТ_ИсполнительРабот",    //Имя элемента формы
		Тип("ПолеФормы"), //Тип, всегда ПолеФормы
		ЭтаФорма);	      //Контейнер для поля ввода (Форма,Группа,Страница)
		
	ПолеВвода.Заголовок = "Исполнитель работ";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	
	//Установка связи элемента с данными
	ПолеВвода.ПутьКДанным = "Объект.КАНАТ_ИсполнительРабот";
	
	
КонецПроцедуры // <-БИТ> Руденков_Е.И. 28.10.2024
