
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИзменитьДоступностьЭлементов();
	
КонецПроцедуры


&НаСервере
Процедура ИзменитьДоступностьЭлементов()
	
	Если ИспользоватьПлательщик Тогда
		Элементы.Плательщик.Доступность = Истина;
	Иначе
		Плательщик = Справочники.Контрагенты.ПустаяСсылка();
		Элементы.Плательщик.Доступность = Ложь;
	КонецЕсли;
	
	Если ИспользоватьПериод Тогда
		Элементы.Период.Доступность = Истина;
	Иначе
		Период.ДатаНачала= Дата("00010101");
		Период.ДатаОкончания = ТекущаяДата();
		Элементы.Период.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПериодПриИзменении(Элемент)
	ИзменитьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПлательщикПриИзменении(Элемент)
	ИзменитьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьГосконтрактПриИзменении(Элемент)
	ИзменитьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	Если Госконтракт.Пустая() Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Поле = "Госконтракт";
		Сообщение.Текст = "Необходимо заполнить госконтракт.";
		Сообщение.Сообщить();
		
		Возврат;
		
	КонецЕсли;
	
	ТабличныйДокумент = СформироватьТабличныйДокумент();
	
	Идентификатор = "ОтчетГособоронзаказПериод";
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(Идентификатор);
	
	КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокумент;
	КоллекцияПечатныхФорм[0].Экземпляров = 1;
	КоллекцияПечатныхФорм[0].СинонимМакета = "Отчет о реализации по гособоронзаказам за период";
	
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,Неопределено,ЭтаФорма);
	
КонецПроцедуры 

&НаСервере
Функция СформироватьТабличныйДокумент()
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.КАНАТ_ОтчетОтгрузкиГособоронзаказ.КАНАТ_ПФ_РеализацияГособоронЗаказ");
	
	//Шапка
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	
	ДанныеШапки = Новый Структура;
	ДанныеШапки.Вставить("Организация", БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация"));
	ДанныеШапки.Вставить("НачалоПериода", Формат(Период.ДатаНачала,"ДФ=dd.MM.yy"));
	ДанныеШапки.Вставить("КонецПериода", Формат(Период.ДатаОкончания,"ДФ=dd.MM.yy"));
	
	//Таблица
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ОбластьШапкаТаблицы");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетФактураВыданный.Номер КАК Номер,
		|	СчетФактураВыданный.Дата КАК Дата,
		|	СчетФактураВыданный.Контрагент КАК Плательщик,
		|	ЕСТЬNULL(ДоговорыКонтрагентов.Сумма, 0) КАК СуммаКонтракта,
		|	ЕСТЬNULL(СУММА(СчетФактураВыданныйТовары.Сумма), 0) КАК СуммаПоСФ,
		|	ГосударственныеКонтракты.Представление КАК Представление,
		|	ГосударственныеКонтракты.НомерИГК КАК НомерИГК,
		|	ЖурналУчетаСчетовФактурСрезПоследних.СуммаПоСчетуФактуре КАК СуммаПоСчетуФактуре
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГосударственныеКонтракты КАК ГосударственныеКонтракты
		|			ПО ДоговорыКонтрагентов.ГосударственныйКонтракт = ГосударственныеКонтракты.Ссылка
		|		ПО СчетФактураВыданный.Договор = ДоговорыКонтрагентов.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.Товары КАК СчетФактураВыданныйТовары
		|		ПО СчетФактураВыданный.Ссылка = СчетФактураВыданныйТовары.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналУчетаСчетовФактур.СрезПоследних КАК ЖурналУчетаСчетовФактурСрезПоследних
		|		ПО СчетФактураВыданный.Ссылка = ЖурналУчетаСчетовФактурСрезПоследних.СчетФактура
		|ГДЕ
		|	(СчетФактураВыданный.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|			ИЛИ НЕ &ИспользоватьПериод)
		|	И (СчетФактураВыданный.Контрагент = &Плательщик
		|			ИЛИ НЕ &ИспользоватьПлательщик)
		|	И ГосударственныеКонтракты.Ссылка = &Госконтракт
		|	И ДоговорыКонтрагентов.ДоговорСУчастникомГОЗ
		|	И СчетФактураВыданный.Проведен = ИСТИНА
		|	И СчетФактураВыданный.ПометкаУдаления = ЛОЖЬ
		|	И ДоговорыКонтрагентов.ПометкаУдаления = ЛОЖЬ
		|	И ГосударственныеКонтракты.ПометкаУдаления = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	СчетФактураВыданный.Номер,
		|	СчетФактураВыданный.Дата,
		|	СчетФактураВыданный.Контрагент,
		|	ДоговорыКонтрагентов.Сумма,
		|	ГосударственныеКонтракты.Представление,
		|	ГосударственныеКонтракты.НомерИГК,
		|	ЖурналУчетаСчетовФактурСрезПоследних.СуммаПоСчетуФактуре";
	
	Запрос.УстановитьПараметр("Госконтракт", Госконтракт);
	Запрос.УстановитьПараметр("ИспользоватьГосконтракт", ИспользоватьГосконтракт);
	Запрос.УстановитьПараметр("ИспользоватьПериод", ИспользоватьПериод);
	Запрос.УстановитьПараметр("ИспользоватьПлательщик", ИспользоватьПлательщик);
	Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	Запрос.УстановитьПараметр("Плательщик", Плательщик);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ИтогоСуммаДоговор = 0;
	ИтогоСуммаСФ = 0;
	Счетчик = 1;
	
	ТабличныйДокументТаблица = Новый ТабличныйДокумент;
	
	ЗаполнитьШапку = Истина;
	
	Пока Выборка.Следующий() Цикл
		
		Если ЗаполнитьШапку Тогда
			
			ДанныеШапки.Вставить("Госконтракт",    Выборка.Представление);
			ДанныеШапки.Вставить("ИГК",            Выборка.НомерИГК);
			ДанныеШапки.Вставить("Плательщик",     Выборка.Плательщик);
			
			ЗаполнитьШапку = Ложь;
			
		КонецЕсли;
		
		ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("ОбластьТаблица");
		
		ДанныеСтроки = Новый Структура;
		ДанныеСтроки.Вставить("ПП",             Счетчик);
		ДанныеСтроки.Вставить("Номер",          Выборка.Номер);
		ДанныеСтроки.Вставить("Дата",           Выборка.Дата);
		ДанныеСтроки.Вставить("СуммаСФ",      Выборка.СуммаПоСчетуФактуре);
		ДанныеСтроки.Вставить("Плательщик",     Выборка.Плательщик);
		
		ОбластьСтрокаТаблицы.Параметры.Заполнить(ДанныеСтроки);
		ТабличныйДокументТаблица.Вывести(ОбластьСтрокаТаблицы);
		
		Счетчик           = Счетчик + 1;
		ИтогоСуммаДоговор = ИтогоСуммаДоговор + Выборка.СуммаКонтракта;
		ИтогоСуммаСФ      = ИтогоСуммаСФ + Выборка.СуммаПоСчетуФактуре;
		
	КонецЦикла;
	
	ДанныеШапки.Вставить("ИтогоСуммаКонтракт", ИтогоСуммаДоговор);
	
	ОбластьТаблицаПодвал = Макет.ПолучитьОбласть("ОбластьТаблицаПодвал");
	ДанныеИтоги = Новый Структура;
	ДанныеИтоги.Вставить("ИтогоСуммаСФ",       ИтогоСуммаСФ);
	
	//Подвал
	ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодвал");
	ДанныеПодвал = Новый Структура;
	ДанныеПодвал.Вставить("Пользователь", Пользователи.ТекущийПользователь());
	ДанныеПодвал.Вставить("Дата", ТекущаяДата());
	
	//Вывод
	ОбластьШапка.Параметры.Заполнить(ДанныеШапки);
	ОбластьТаблицаПодвал.Параметры.Заполнить(ДанныеИтоги);
	ОбластьПодвал.Параметры.Заполнить(ДанныеПодвал);
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
	ТабличныйДокумент.Вывести(ТабличныйДокументТаблица);
	ТабличныйДокумент.Вывести(ОбластьТаблицаПодвал);
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
	Возврат ТабличныйДокумент;
	
КонецФункции
