
&После("ДобавитьКомандыПечати")
Процедура КАНАТ_ДобавитьКомандыПечати(КомандыПечати)
	
	//Удаление печати счета на оплату из заказа клиента
	Индекс = 0;
	
	Пока Индекс < КомандыПечати.Количество() Цикл
		
		Если КомандыПечати[Индекс].МенеджерПечати = "Обработка.ПечатьСчетовНаОплату" Тогда
			КомандыПечати.Удалить(Индекс);
		Иначе		
			Индекс = Индекс + 1;
		КонецЕсли;
		
	КонецЦикла;		
	
	//++ Гурьев 04.09.23 формирование печатной формы для печати спецификации
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.МенеджерПечати = "Обработка.КАНАТ_ПечатьСпецификацииЗаказКлиента";
	//КомандаПечати.Идентификатор = "ПечатьСпецификации";
	//КомандаПечати.Представление = "Печать спецификации";
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	//-- Гурьев 04.09.23
	
	//++ Гурьев 25.09.23 ЧТЗ_2.10
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.МенеджерПечати = "Обработка.КАНАТ_ПечатьПропускНаВъездВыезд";
	//КомандаПечати.Идентификатор = "ПропускНаВъезд";
	//КомандаПечати.Представление = "Пропуск на въезд";
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	//-- Гурьев 25.09.23
КонецПроцедуры

//&Вместо("ТоварыДокументаДляСозданияОбеспечивающегоЗаказа")
//Процедура КАНАТ_ТоварыДокументаДляСозданияОбеспечивающегоЗаказа(Ссылка, ПараметрыСоздания, МенеджерВременныхТаблиц)
//	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Статус,Проведен");
//	ПроверитьВозможностьВводаНаОсновании(Ссылка, Реквизиты.Статус, Не Реквизиты.Проведен, Истина);
//	
//	Запрос = Новый Запрос();
//	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
//	Запрос.УстановитьПараметр("ТипыНоменклатуры", ПараметрыСоздания.ТипыНоменклатуры);
//	Запрос.УстановитьПараметр("Ссылка", Ссылка);
//	Запрос.Текст =
//		"ВЫБРАТЬ
//		|	Товары.НомерСтроки КАК НомерСтроки,
//		|	Товары.Номенклатура КАК Номенклатура,
//		|	Товары.Характеристика КАК Характеристика,
//		|	Товары.Упаковка КАК Упаковка,
//		|	Товары.Склад КАК Склад,
//		|	Товары.Подразделение КАК Подразделение,
//		|	ВЫБОР
//		|		КОГДА Товары.Обособленно
//		|			ТОГДА Товары.Ссылка.Назначение
//		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
//		|	КОНЕЦ КАК Назначение,
//		|	Товары.ВариантОбеспечения КАК ВариантОбеспечения,
//		|	Товары.Обособленно КАК Обособленно,
//		|	Товары.ДатаОтгрузки КАК ДатаОтгрузки,
//		|	Товары.Количество КАК КоличествоЕдиницПоДокументу,
//		|	Товары.КоличествоУпаковок КАК КоличествоПоДокументу,
//		|//++ Гурьев 11.09.23 Комментарии к заказу
//		|	Товары.КАНАТ_КомментарийКЗаказу,
//		|	Товары.КАНАТ_Сертификат 
//		|//-- Гурьев 11.09.23
//		|ПОМЕСТИТЬ ТоварыДокумента
//		|ИЗ
//		|	Документ.ЗаказКлиента.Товары КАК Товары
//		|ГДЕ
//		|	Товары.Ссылка = &Ссылка
//		|		И НЕ Товары.Отменено
//		|		И Товары.Номенклатура.ТипНоменклатуры В(&ТипыНоменклатуры)";
//	
//	Запрос.Выполнить();
//КонецПроцедуры

//++ Гурьев 19.09.23 ЧТЗ_2.3
Функция КАНАТ_ПолучитьНовыйНомерСпецификации(ЗаказКлиента, Договор) Экспорт
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗаказКлиента.КАНАТ_СпецификацияНомер КАК КАНАТ_СпецификацияНомер
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|ГДЕ
		|	ЗаказКлиента.Ссылка <> &ЗаказКлиента
		|	И ЗаказКлиента.Договор = &Договор
		|	И ЗаказКлиента.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	КАНАТ_СпецификацияНомер УБЫВ";
	
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.КАНАТ_СпецификацияНомер + 1;
		
	Иначе
		
		Возврат 1;
		
	КонецЕсли;

	
КонецФункции
//-- Гурьев 19.09.23 ЧТЗ_2.3

&После("ДобавитьКомандыСозданияНаОсновании")
Процедура КАНАТ_ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры)
	//++ Гурьев 10.11.23 ЧТЗ_2.3 Ввод на основании спецификации к договору
	Документы.КАНАТ_СпецификацияКДоговору.ДобавитьКомандуСоздатьСпецификациюКДоговору(КомандыСозданияНаОсновании);
	//-- Гурьев 10.11.23
	//++ Гурьев 15.11.23 ЧТЗ_2.10 Ввод на основании распоряжения на отгрузку
	Документы.КАНАТ_РаспоряжениеНаОтгрузку.ДобавитьКомандуСоздатьРаспоряжениеНаОтгрузку(КомандыСозданияНаОсновании);
	//-- Гурьев 15.11.23
КонецПроцедуры

&ИзменениеИКонтроль("ТоварыДокументаДляСозданияОбеспечивающегоЗаказа")
Процедура КАНАТ_ТоварыДокументаДляСозданияОбеспечивающегоЗаказа(Ссылка, ПараметрыСоздания, МенеджерВременныхТаблиц)

	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Статус,Проведен");
	ПроверитьВозможностьВводаНаОсновании(Ссылка, Реквизиты.Статус, Не Реквизиты.Проведен, Истина);

	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТипыНоменклатуры", ПараметрыСоздания.ТипыНоменклатуры);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Упаковка КАК Упаковка,
	|	Товары.Склад КАК Склад,
	|	Товары.Подразделение КАК Подразделение,
	|	ВЫБОР
	|		КОГДА Товары.Обособленно
	|			ТОГДА Товары.Ссылка.Назначение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	КОНЕЦ КАК Назначение,
	|	Товары.ВариантОбеспечения КАК ВариантОбеспечения,
	|	Товары.Обособленно КАК Обособленно,
	|	Товары.ДатаОтгрузки КАК ДатаОтгрузки,
	|	Товары.Количество КАК КоличествоЕдиницПоДокументу,  
	#Вставка
	|//++ Гурьев 11.09.23 Комментарии к заказу
	|	Товары.КАНАТ_КомментарийКЗаказу,
	|	Товары.КАНАТ_Сертификат, 
	|//-- Гурьев 11.09.23
	#КонецВставки
	|	Товары.КоличествоУпаковок КАК КоличествоПоДокументу
	|ПОМЕСТИТЬ ТоварыДокумента
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|		И НЕ Товары.Отменено
	|		И Товары.Номенклатура.ТипНоменклатуры В(&ТипыНоменклатуры)";

	Запрос.Выполнить();

КонецПроцедуры
