
&После("ОбработкаЗаполнения")
Процедура КАНАТ_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//++ Гурьев 08.09.23
	УстановитьПривилегированныйРежим(Истина);
	БанковскийСчет = Константы.КАНАТ_ОсновнойСчетОрганизации.Получить();
	УстановитьПривилегированныйРежим(Ложь);
	//-- Гурьев 08.09.23
КонецПроцедуры

&После("ПередЗаписью")
Процедура КАНАТ_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//БИТ_Гурьев__26.03.24++
	Если Не ЗначениеЗаполнено(Грузополучатель) Тогда
		
		Грузополучатель = Контрагент;
		
	КонецЕсли;
	//БИТ_Гурьев__26.03.24--
КонецПроцедуры
