
&После("ДобавитьКомандыПечати")
Процедура КАНАТ_ДобавитьКомандыПечати(КомандыПечати)
	//++ Гурьев 06.09.23 Команда печати для печати спецификации
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Обработка.КАНАТ_ПечатьРасходнойСпецификации";
	КомандаПечати.Идентификатор = "ПечатьСпецификации";
	КомандаПечати.Представление = "Печать спецификации";
	//-- Гурьев 06.09.23
КонецПроцедуры

//++ Гурьев 07.09.23 Получение документа основания (заказа клиента)
Функция ПолучитьРодителя(Документ) Экспорт 
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ЗаказКлиента.Ссылка КАК Ссылка
	//	|ИЗ
	//	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	//	|ГДЕ
	//	|	ЗаказКлиента.ПометкаУдаления = ЛОЖЬ
	//	|	И ЗаказКлиента.Проведен = ИСТИНА";
	//
	//ЗаказыКлиента = Запрос.Выполнить().Выгрузить(); 
	//
	//Запрос = Новый Запрос;
	//
	//ТекстЗапроса = "";
	//Счетчик = 0;
	//Для Каждого Строка Из ЗаказыКлиента Цикл
	//	
	//	Счетчик = Счетчик + 1;
	//	
	//	Если Не ПустаяСтрока(ТекстЗапроса) Тогда
	//		
	//		ТекстЗапроса = ТекстЗапроса + "
	//		|
	//		|ОБЪЕДИНИТЬ
	//		|";
	//		
	//	КонецЕсли;
	//	
	//	ТекстЗапроса = ТекстЗапроса + "
	//	|ВЫБРАТЬ 
	//	|	СвязанныеДокументы.Ссылка КАК РасходныйОрдерНаТоварыСсылка,
	//	|	ЗаказКлиента.Ссылка КАК ЗаказКлиентаСсылка
	//	|ИЗ
	//	|	КритерийОтбора.СвязанныеДокументы(&ДокументЗаказКлиента" + Строка(Счетчик) + ") КАК СвязанныеДокументы, 
	//	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	//	|ГДЕ
	//	|	СвязанныеДокументы.Ссылка = &ДокументРасходныйОрдерНаТовары
	//	|	И ЗаказКлиента.Ссылка = &ДокументЗаказКлиента" + Строка(Счетчик);
	//	
	//	Запрос.УстановитьПараметр("ДокументЗаказКлиента" + Строка(Счетчик), Строка.Ссылка);
	//	
	//КонецЦикла;
	//
	//Запрос.УстановитьПараметр("ДокументРасходныйОрдерНаТовары", Документ);
	//Запрос.Текст = ТекстЗапроса;
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение КАК Распоряжение
		|ИЗ
		|	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
		|ГДЕ
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка = &Ссылка
		|	И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение ССЫЛКА Документ.ЗаказКлиента";
	
	Запрос.УстановитьПараметр("Ссылка", Документ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Распоряжение;
		
	Иначе
		
		Возврат Документы.ЗаказКлиента.ПустаяСсылка();
		
	КонецЕсли;
	
КонецФункции
//-- Гурьев 07.09.23

//++ Гурьев 07.09.23 Получение реализации на товары ,созданной по расходному оредру
Функция устар_ПолучитьРеализациюТоваровУслуг(Документ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДвиженияСерийТоваров1.Документ КАК Реализация
		|ИЗ
		|	РегистрНакопления.ДвиженияСерийТоваров КАК ДвиженияСерийТоваров
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДвиженияСерийТоваров КАК ДвиженияСерийТоваров1
		|		ПО ДвиженияСерийТоваров.Серия = ДвиженияСерийТоваров1.Серия
		|ГДЕ
		|	ДвиженияСерийТоваров1.Документ ССЫЛКА Документ.РеализацияТоваровУслуг
		|	И ДвиженияСерийТоваров.Документ = &Документ
		|	И ДвиженияСерийТоваров1.Документ.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Реализация;
		
	КонецЕсли;
	
	Возврат Документы.РеализацияТоваровУслуг.ПустаяСсылка();
	
КонецФункции
//-- Гурьев 07.09.23

Функция ПолучитьРеализациюТоваровУслуг(Документ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	СчетФактураВыданный.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.РасходныйОрдерНаТовары КАК РасходныйОрдерНаТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиентаДокумент
	               |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |					ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	               |					ПО РеализацияТоваровУслуг.Ссылка = СчетФактураВыданный.ДокументОснование
	               |				ПО ЗаказКлиентаДокумент.Ссылка = РеализацияТоваровУслуг.ЗаказКлиента
	               |			ПО РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение = ЗаказКлиента.Ссылка
	               |		ПО РасходныйОрдерНаТовары.Ссылка = РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка
	               |ГДЕ
	               |	РасходныйОрдерНаТовары.Ссылка = &Документ
	               |	И РеализацияТоваровУслуг.Дата >= РасходныйОрдерНаТовары.Дата 
				   |	И СчетФактураВыданный.Проведен
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	РеализацияТоваровУслуг.Дата";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Ссылка;
		
	КонецЕсли;
	
	Возврат Документы.СчетФактураВыданный.ПустаяСсылка();
	
КонецФункции
