
&После("ОбработкаЗаполнения")
Процедура КАНАТ_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//++ Гурьев ЧТЗ_2.3 15.09.23
	КАНАТ_ЗаполнитьКомментарийТоварыПоРаспоряжениям();
	КАНАТ_ЗаполнитьКомментарийОтгружаемыеТовары();
	//-- Гурьев ЧТЗ_2.3 15.09.23
КонецПроцедуры

//++ Гурьев ЧТЗ_2.3 15.09.23
Процедура КАНАТ_ЗаполнитьКомментарийТоварыПоРаспоряжениям()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"
		|ВЫБРАТЬ
		|	*
		|ПОМЕСТИТЬ ВТТоварыПоРаспоряжениям
		|ИЗ &ТоварыПоРаспоряжениям КАК ТоварыПоРаспоряжениям;
		|
		|///////////////////////////////
		|ВЫБРАТЬ
		|	ВТТоварыПоРаспоряжениям.НомерСтроки КАК НомерСтроки,
		|	ЗаказКлиентаТовары.КАНАТ_КомментарийКЗаказу КАК КАНАТ_КомментарийКЗаказу,
		|	ЗаказКлиентаТовары.КАНАТ_Сертификат КАК КАНАТ_Сертификат
		|ИЗ
		|	ВТТоварыПоРаспоряжениям КАК ВТТоварыПоРаспоряжениям
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|		ПО ВТТоварыПоРаспоряжениям.Распоряжение = ЗаказКлиентаТовары.Ссылка
		|ГДЕ
		|	ВТТоварыПоРаспоряжениям.Номенклатура = ЗаказКлиентаТовары.Номенклатура 
		|	И ВТТоварыПоРаспоряжениям.Характеристика = ЗаказКлиентаТовары.Характеристика
		|	И ВТТоварыПоРаспоряжениям.Серия = ЗаказКлиентаТовары.Серия
		|	И ЗаказКлиентаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
		|	И ЗаказКлиентаТовары.КАНАТ_КомментарийКЗаказу <> """"
		|ИТОГИ ПО
		|	НомерСтроки";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ТоварыПоРаспоряжениям", ТоварыПоРаспоряжениям.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаНомерСтроки = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаНомерСтроки.Следующий() Цикл
		
		ВыборкаДетальныеЗаписи = ВыборкаНомерСтроки.Выбрать();
	
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			
			ЭтотОбъект.ТоварыПоРаспоряжениям[ВыборкаНомерСтроки.НомерСтроки-1].КАНАТ_КомментарийКЗаказу = ВыборкаДетальныеЗаписи.КАНАТ_КомментарийКЗаказу;
			ЭтотОбъект.ТоварыПоРаспоряжениям[ВыборкаНомерСтроки.НомерСтроки-1].КАНАТ_Сертификат = ВыборкаДетальныеЗаписи.КАНАТ_Сертификат;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
//-- Гурьев ЧТЗ_2.3 15.09.23


//++ Гурьев ЧТЗ_2.3 15.09.23
Процедура КАНАТ_ЗаполнитьКомментарийОтгружаемыеТовары() Экспорт
	
	Для Каждого СтрокаОтгружаемыеТовары Из ОтгружаемыеТовары Цикл
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Номенклатура",   СтрокаОтгружаемыеТовары.Номенклатура);
		СтруктураОтбора.Вставить("Характеристика", СтрокаОтгружаемыеТовары.Характеристика);
		СтрокиТоварыПоРаспоряжениям = ТоварыПоРаспоряжениям.НайтиСтроки(СтруктураОтбора);
		Если СтрокиТоварыПоРаспоряжениям.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		КАНАТ_КомментарийКЗаказу = "";
		КАНАТ_Сертификат = "";
		
		Для Каждого Строка Из СтрокиТоварыПоРаспоряжениям Цикл 
			
			Если Не ПустаяСтрока(КАНАТ_КомментарийКЗаказу) Тогда
				КАНАТ_КомментарийКЗаказу = КАНАТ_КомментарийКЗаказу + "; ";
			КонецЕсли;
			
			КАНАТ_КомментарийКЗаказу = КАНАТ_КомментарийКЗаказу + Строка.КАНАТ_КомментарийКЗаказу;
			
			Если Не ПустаяСтрока(КАНАТ_Сертификат) Тогда
				КАНАТ_Сертификат = КАНАТ_Сертификат + "; ";
			КонецЕсли;
			
			КАНАТ_Сертификат = КАНАТ_Сертификат + Строка.КАНАТ_Сертификат
			
		КонецЦикла;
		
		СтрокаОтгружаемыеТовары.КАНАТ_КомментарийКЗаказу = КАНАТ_КомментарийКЗаказу;
		СтрокаОтгружаемыеТовары.КАНАТ_Сертификат = КАНАТ_Сертификат;
		
	КонецЦикла
	
КонецПроцедуры
//-- Гурьев ЧТЗ_2.3 15.09.23