


&НаКлиенте
Процедура КАНАТ_ГрузополучательПриИзмененииПосле(Элемент)
	КАНАТ_ИзменитьАдресДоставки("Грузополучатель");
КонецПроцедуры

&НаСервере
Процедура КАНАТ_ИзменитьАдресДоставки(ИмяРеквизита)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтрагентыКонтактнаяИнформация.Представление КАК Представление
		|ИЗ
		|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
		|ГДЕ
		|	КонтрагентыКонтактнаяИнформация.Тип = &Тип
		|	И КонтрагентыКонтактнаяИнформация.Вид = &Вид
		|	И КонтрагентыКонтактнаяИнформация.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента);
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес);
	Запрос.УстановитьПараметр("Ссылка", ЭтаФорма[ИмяРеквизита]);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		АдресДоставки = Выборка.Представление;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура КАНАТ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//++БИТ_Гурьев_11.01.24
	Элементы.Грузополучатель.Видимость = Ложь;
	//--БИТ_Гурьев_11.01.24
КонецПроцедуры
