
//&Вместо("ПриВыводеСтрокиТоварыПечатнуюФорму")
//Процедура КАНАТ_ПриВыводеСтрокиТоварыПечатнуюФорму(ТабличныйДокумент, СтрокаТовары, ОбластьСтрокаТаблицыТовары, ИменованнаяОбластьСтрокаТовары, ДополнительныеПараметрыВывода, СтандартнаяОбработка)
//	
//	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьНаборы") Тогда 
//		Возврат;
//	КонецЕсли;
//	
//	СтандартнаяОбработка = Ложь;
//	
//	Если ДополнительныеПараметрыВывода = Неопределено Тогда
//		 ДополнительныеПараметрыВывода = Новый Структура;
//	КонецЕсли;
//	
//	Если НЕ ДополнительныеПараметрыВывода.Свойство("НомерСтроки")  Тогда
//		 ДополнительныеПараметрыВывода.Вставить("НомерСтроки", 0);
//	КонецЕсли;
//	
//	Если НаборыСервер.ИспользоватьОбластьНабор(СтрокаТовары, Истина) Тогда
//		
//		Если СтрокаТовары.ВариантПредставленияНабораВПечатныхФормах = Перечисления.ВариантыПредставленияНаборовВПечатныхФормах.НаборИКомплектующие Тогда
//			
//			Если СтрокаТовары.ВариантРасчетаЦеныНабора = Перечисления.ВариантыРасчетаЦенНаборов.РассчитываетсяИзЦенКомплектующих Тогда
//			
//				ДанныеСтроки = Новый Структура;
//				ДанныеСтроки.Вставить("НомерСтроки",      "");
//				ДанныеСтроки.Вставить("Номенклатура",     "");
//				ДанныеСтроки.Вставить("Количество",       "");
//				ДанныеСтроки.Вставить("ЕдиницаИзмерения", "");
//				ДанныеСтроки.Вставить("СрокПоставки",     "");
//				ДанныеСтроки.Вставить("Цена",             "");
//				ДанныеСтроки.Вставить("СуммаСкидки",      "");
//				ДанныеСтроки.Вставить("СуммаСНДС",        "");
//				//·++·Гурьев·21.08.23·#2.9·Заполнение новых столбцов таблицы
//				ДанныеСтроки.Вставить("Сумма",            "");
//				ДанныеСтроки.Вставить("СуммаНДС",         "");
//			    //·--·Гурьев·21.08.23
//			
//				ОбластьСтрокаТаблицыТовары.Параметры.Заполнить(ДанныеСтроки);
//				ОбластьСтрокаТаблицыТовары.Параметры.Номенклатура = СтрокаТовары.Номенклатура;
//				
//			Иначе
//				
//				ЗаполнитьЗначенияСвойств(ОбластьСтрокаТаблицыТовары.Параметры, СтрокаТовары);
//				
//			КонецЕсли;
//			
//		Иначе
//			
//			ДополнительныеПараметрыВывода.НомерСтроки = ДополнительныеПараметрыВывода.НомерСтроки + 1;
//			ОбластьСтрокаТаблицыТовары.Параметры.НомерСтроки = ДополнительныеПараметрыВывода.НомерСтроки;
//			
//		КонецЕсли;
//		
//		ОбластьСтрокаТаблицыТовары.Области[ИменованнаяОбластьСтрокаТовары].ГраницаСверху = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1, 0);
//		ОбластьСтрокаТаблицыТовары.Области[ИменованнаяОбластьСтрокаТовары].ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
//		ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицыТовары);
//		
//	ИначеЕсли НаборыСервер.ИспользоватьОбластьКомплектующие(СтрокаТовары, Истина) Тогда
//		
//		ДополнительныеПараметрыВывода.НомерСтроки = ДополнительныеПараметрыВывода.НомерСтроки + 1;
//		
//		Если СтрокаТовары.ВариантПредставленияНабораВПечатныхФормах = Перечисления.ВариантыПредставленияНаборовВПечатныхФормах.НаборИКомплектующие Тогда
//			
//			Если СтрокаТовары.ВариантРасчетаЦеныНабора = Перечисления.ВариантыРасчетаЦенНаборов.РассчитываетсяИзЦенКомплектующих Тогда
//				
//				ЗаполнитьЗначенияСвойств(ОбластьСтрокаТаблицыТовары.Параметры, СтрокаТовары);
//				
//			Иначе
//				
//				ДанныеСтроки = Новый Структура;
//				ДанныеСтроки.Вставить("НомерСтроки",      "");
//				ДанныеСтроки.Вставить("Номенклатура",     "");
//				ДанныеСтроки.Вставить("Количество",       "");
//				ДанныеСтроки.Вставить("ЕдиницаИзмерения", "");
//				ДанныеСтроки.Вставить("СрокПоставки",     "");
//				ДанныеСтроки.Вставить("Цена",             "");
//				ДанныеСтроки.Вставить("СуммаСкидки",      "");
//				ДанныеСтроки.Вставить("СуммаСНДС",        "");
//				//·++·Гурьев·21.08.23·#2.9·Заполнение новых столбцов таблицы
//				ДанныеСтроки.Вставить("Сумма",            "");
//				ДанныеСтроки.Вставить("СуммаНДС",         "");
//			    //·--·Гурьев·21.08.23
//				
//				ОбластьСтрокаТаблицыТовары.Параметры.Заполнить(ДанныеСтроки);
//				СтрокаТовары.Номенклатура = СтрШаблон(НСтр("ru = '%1, %2 %3';
//															|en = '%1, %2 %3'"), СтрокаТовары.Номенклатура, СтрокаТовары.Количество, СтрокаТовары.ЕдиницаИзмерения);
//				
//			КонецЕсли;
//			
//		Иначе
//			
//			ЗаполнитьЗначенияСвойств(ОбластьСтрокаТаблицыТовары.Параметры, СтрокаТовары);
//			
//		КонецЕсли;
//		
//		ПараметрыОбласти = ОбластьСтрокаТаблицыТовары.Параметры; // ПараметрыМакетаТабличногоДокумента
//		ПараметрыОбласти.НомерСтроки = ДополнительныеПараметрыВывода.НомерСтроки;
//		ОбластьСтрокаТаблицыТовары.Параметры.Номенклатура = " - " + СтрокаТовары.Номенклатура;
//		
//		ОбластьСтрокаТаблицыТовары.Области[ИменованнаяОбластьСтрокаТовары].ГраницаСверху = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
//		
//		ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицыТовары);
//		
//	Иначе
//		
//		ДополнительныеПараметрыВывода.НомерСтроки = ДополнительныеПараметрыВывода.НомерСтроки + 1;
//		
//		ЗаполнитьЗначенияСвойств(ОбластьСтрокаТаблицыТовары.Параметры, СтрокаТовары);
//		ОбластьСтрокаТаблицыТовары.Параметры.НомерСтроки = ДополнительныеПараметрыВывода.НомерСтроки;
//		
//		ОбластьСтрокаТаблицыТовары.Области[ИменованнаяОбластьСтрокаТовары].ГраницаСверху = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1, 0);
//		ОбластьСтрокаТаблицыТовары.Области[ИменованнаяОбластьСтрокаТовары].ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1, 0);
//		
//		ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицыТовары);
//		
//		Возврат;
//		
//	КонецЕсли;
//КонецПроцедуры

&ИзменениеИКонтроль("ПриВыводеСтрокиТоварыПечатнуюФорму")
Процедура КАНАТ_ПриВыводеСтрокиТоварыПечатнуюФорму(ТабличныйДокумент, СтрокаТовары, ОбластьСтрокаТаблицыТовары, ИменованнаяОбластьСтрокаТовары, ДополнительныеПараметрыВывода, СтандартнаяОбработка)
    #Удаление
	КоммерческиеПредложенияДокументыУТ.ПриВыводеСтрокиТоварыПечатнуюФорму(ТабличныйДокумент, 
	СтрокаТовары, 
	ОбластьСтрокаТаблицыТовары, 
	ИменованнаяОбластьСтрокаТовары, 
	ДополнительныеПараметрыВывода, 
	СтандартнаяОбработка);
 	#КонецУдаления
	#Вставка    
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьНаборы") Тогда 
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Если ДополнительныеПараметрыВывода = Неопределено Тогда
		 ДополнительныеПараметрыВывода = Новый Структура;
	КонецЕсли;
	
	Если НЕ ДополнительныеПараметрыВывода.Свойство("НомерСтроки")  Тогда
		 ДополнительныеПараметрыВывода.Вставить("НомерСтроки", 0);
	КонецЕсли;
	
	Если НаборыСервер.ИспользоватьОбластьНабор(СтрокаТовары, Истина) Тогда
		
		Если СтрокаТовары.ВариантПредставленияНабораВПечатныхФормах = Перечисления.ВариантыПредставленияНаборовВПечатныхФормах.НаборИКомплектующие Тогда
			
			Если СтрокаТовары.ВариантРасчетаЦеныНабора = Перечисления.ВариантыРасчетаЦенНаборов.РассчитываетсяИзЦенКомплектующих Тогда
			
				ДанныеСтроки = Новый Структура;
				ДанныеСтроки.Вставить("НомерСтроки",      "");
				ДанныеСтроки.Вставить("Номенклатура",     "");
				ДанныеСтроки.Вставить("Количество",       "");
				ДанныеСтроки.Вставить("ЕдиницаИзмерения", "");
				ДанныеСтроки.Вставить("СрокПоставки",     "");
				ДанныеСтроки.Вставить("Цена",             "");
				ДанныеСтроки.Вставить("СуммаСкидки",      "");
				ДанныеСтроки.Вставить("СуммаСНДС",        "");
				//·++·Гурьев·21.08.23·#2.9·Заполнение новых столбцов таблицы
				ДанныеСтроки.Вставить("Сумма",            "");
				ДанныеСтроки.Вставить("СуммаНДС",         "");
			    //·--·Гурьев·21.08.23
			
				ОбластьСтрокаТаблицыТовары.Параметры.Заполнить(ДанныеСтроки);
				ОбластьСтрокаТаблицыТовары.Параметры.Номенклатура = СтрокаТовары.Номенклатура;
				
			Иначе
				
				ЗаполнитьЗначенияСвойств(ОбластьСтрокаТаблицыТовары.Параметры, СтрокаТовары);
				
			КонецЕсли;
			
		Иначе
			
			ДополнительныеПараметрыВывода.НомерСтроки = ДополнительныеПараметрыВывода.НомерСтроки + 1;
			ОбластьСтрокаТаблицыТовары.Параметры.НомерСтроки = ДополнительныеПараметрыВывода.НомерСтроки;
			
		КонецЕсли;
		
		ОбластьСтрокаТаблицыТовары.Области[ИменованнаяОбластьСтрокаТовары].ГраницаСверху = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1, 0);
		ОбластьСтрокаТаблицыТовары.Области[ИменованнаяОбластьСтрокаТовары].ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
		ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицыТовары);
		
	ИначеЕсли НаборыСервер.ИспользоватьОбластьКомплектующие(СтрокаТовары, Истина) Тогда
		
		ДополнительныеПараметрыВывода.НомерСтроки = ДополнительныеПараметрыВывода.НомерСтроки + 1;
		
		Если СтрокаТовары.ВариантПредставленияНабораВПечатныхФормах = Перечисления.ВариантыПредставленияНаборовВПечатныхФормах.НаборИКомплектующие Тогда
			
			Если СтрокаТовары.ВариантРасчетаЦеныНабора = Перечисления.ВариантыРасчетаЦенНаборов.РассчитываетсяИзЦенКомплектующих Тогда
				
				ЗаполнитьЗначенияСвойств(ОбластьСтрокаТаблицыТовары.Параметры, СтрокаТовары);
				
			Иначе
				
				ДанныеСтроки = Новый Структура;
				ДанныеСтроки.Вставить("НомерСтроки",      "");
				ДанныеСтроки.Вставить("Номенклатура",     "");
				ДанныеСтроки.Вставить("Количество",       "");
				ДанныеСтроки.Вставить("ЕдиницаИзмерения", "");
				ДанныеСтроки.Вставить("СрокПоставки",     "");
				ДанныеСтроки.Вставить("Цена",             "");
				ДанныеСтроки.Вставить("СуммаСкидки",      "");
				ДанныеСтроки.Вставить("СуммаСНДС",        "");
				//·++·Гурьев·21.08.23·#2.9·Заполнение новых столбцов таблицы
				ДанныеСтроки.Вставить("Сумма",            "");
				ДанныеСтроки.Вставить("СуммаНДС",         "");
			    //·--·Гурьев·21.08.23
				
				ОбластьСтрокаТаблицыТовары.Параметры.Заполнить(ДанныеСтроки);
				СтрокаТовары.Номенклатура = СтрШаблон(НСтр("ru = '%1, %2 %3';
															|en = '%1, %2 %3'"), СтрокаТовары.Номенклатура, СтрокаТовары.Количество, СтрокаТовары.ЕдиницаИзмерения);
				
			КонецЕсли;
			
		Иначе
			
			ЗаполнитьЗначенияСвойств(ОбластьСтрокаТаблицыТовары.Параметры, СтрокаТовары);
			
		КонецЕсли;
		
		ПараметрыОбласти = ОбластьСтрокаТаблицыТовары.Параметры; // ПараметрыМакетаТабличногоДокумента
		ПараметрыОбласти.НомерСтроки = ДополнительныеПараметрыВывода.НомерСтроки;
		ОбластьСтрокаТаблицыТовары.Параметры.Номенклатура = " - " + СтрокаТовары.Номенклатура;
		
		ОбластьСтрокаТаблицыТовары.Области[ИменованнаяОбластьСтрокаТовары].ГраницаСверху = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
		
		ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицыТовары);
		
	Иначе
		
		ДополнительныеПараметрыВывода.НомерСтроки = ДополнительныеПараметрыВывода.НомерСтроки + 1;
		
		ЗаполнитьЗначенияСвойств(ОбластьСтрокаТаблицыТовары.Параметры, СтрокаТовары);
		ОбластьСтрокаТаблицыТовары.Параметры.НомерСтроки = ДополнительныеПараметрыВывода.НомерСтроки;
		
		ОбластьСтрокаТаблицыТовары.Области[ИменованнаяОбластьСтрокаТовары].ГраницаСверху = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1, 0);
		ОбластьСтрокаТаблицыТовары.Области[ИменованнаяОбластьСтрокаТовары].ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1, 0);
		
		ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицыТовары);
		
		Возврат;
		
	КонецЕсли;
	#КонецВставки
КонецПроцедуры
