// <+БИТ> Руденков_Е.И. 25.07.2024  
// ЧТЗ ШК-1 Канат Процесс штрихкодирования
&ИзменениеИКонтроль("НайтиТоварПоШК")
Функция КАНАТ_НайтиТоварПоШК(ЗначениеШтрихкода)

	СтруктураТовара = Новый Структура;
	СтруктураТовара.Вставить("Номенклатура", "");
	СтруктураТовара.Вставить("Характеристика", "");
	СтруктураТовара.Вставить("Упаковка", "");
	СтруктураТовара.Вставить("Количество", 1);
	#Вставка
	СтруктураТовара.Вставить("Серия","");
	#КонецВставки

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
	#Вставка
	|	ШтрихкодыНоменклатуры.КАНАТ_Серия КАК Серия,
	#КонецВставки
	|	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ШтрихкодыНоменклатуры.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ШтрихкодыНоменклатуры.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ШтрихкодыНоменклатуры.Упаковка
	|	КОНЕЦ КАК Упаковка
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод";

	Запрос.УстановитьПараметр("Штрихкод", ЗначениеШтрихкода);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтруктураТовара, ВыборкаДетальныеЗаписи);
	КонецЦикла;

	Возврат СтруктураТовара;

КонецФункции

// Возвращает статус указания серии
//
// Параметры:
//  Серия  - справочник СерииНоменклатуры - серия номенклатуры
//
// Возвращаемое значение:
//   Число   - число соответсвующее статусу. 6 - серия со сроком годности. 8 - серия без срока годности.
//
Функция ПолучитьСтатусУказанияСерий(Серия)Экспорт
	
	СтатусУказанияСерий = 7;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЗначениеЗаполнено(Серия) Тогда	
		СрокГодности = Серия.ГоденДо;
		Если ЗначениеЗаполнено(СрокГодности) Тогда
			 СтатусУказанияСерий = 6;
		Иначе
			СтатусУказанияСерий = 8;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат СтатусУказанияСерий;

КонецФункции

// <-БИТ> Руденков_Е.И. 25.07.2024
