
&После("ОбработкаЗаполнения")
Процедура КАНАТ_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Если Не ДанныеЗаполнения.ЗаказКлиента.Пустая() Тогда
			
			ДанныеЗаказаКлиента = ОбщегоНазначенияУТВызовСервера.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения.ЗаказКлиента,
										"КАНАТ_ФИОСопроводителя, КАНАТ_Водитель, КАНАТ_ГосНомер, КАНАТ_АвтомобильМарка");
			
			КАНАТ_ФИОСопроводителя = ДанныеЗаказаКлиента.КАНАТ_ФИОСопроводителя;
			АвтомобильМарка = ДанныеЗаказаКлиента.КАНАТ_АвтомобильМарка;
			Водитель = ДанныеЗаказаКлиента.КАНАТ_Водитель;
			АвтомобильГосударственныйНомер = ДанныеЗаказаКлиента.КАНАТ_ГосНомер;
			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
