// <+БИТ> Руденков_Е.И. 26.02.2024 
// #000000054, ЧТЗ_3_8 Артикул=код
&ИзменениеИКонтроль("УстановитьПрефикс")
Процедура КАНАТ_УстановитьПрефикс(Источник, Префикс, УстановитьПрефиксИнформационнойБазы, УстановитьПрефиксОрганизации)

	ПрефиксИнформационнойБазы = "";
	ПрефиксОрганизации        = "";

	Если УстановитьПрефиксИнформационнойБазы Тогда

		ПриОпределенииПрефиксаИнформационнойБазы(ПрефиксИнформационнойБазы);

		ДополнитьСтрокуНулямиСлева(ПрефиксИнформационнойБазы, 2);
	КонецЕсли;

	Если УстановитьПрефиксОрганизации Тогда

		Если РеквизитОрганизацияДоступен(Источник) Тогда

			ПриОпределенииПрефиксаОрганизации(
			Источник[ИмяРеквизитаОрганизация(Источник.Метаданные())], ПрефиксОрганизации);
			// Если задана пустая ссылка на организацию.
			Если ПрефиксОрганизации = Ложь Тогда

				ПрефиксОрганизации = "";

			КонецЕсли;

		КонецЕсли;

		ДополнитьСтрокуНулямиСлева(ПрефиксОрганизации, 2);
	КонецЕсли;

	ШаблонПрефикса = "[ОР][ИБ]-[Префикс]";
	ШаблонПрефикса = СтрЗаменить(ШаблонПрефикса, "[ОР]", ПрефиксОрганизации);
	ШаблонПрефикса = СтрЗаменить(ШаблонПрефикса, "[ИБ]", ПрефиксИнформационнойБазы);
	ШаблонПрефикса = СтрЗаменить(ШаблонПрефикса, "[Префикс]", Префикс);

	Префикс = ШаблонПрефикса;
	
	#Вставка 
	Если ТипЗнч(Источник) = Тип("СправочникОбъект.Номенклатура") Тогда
		Префикс = "";
	КонецЕсли;
	#КонецВставки

КонецПроцедуры // <-БИТ> Руденков_Е.И. 26.02.2024
