//БИТ_Гурьев_ЧТЗ_3.6_07.03.24

&НаСервере
Процедура ОбновитьДанныеТаблицаПроизводства()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТаблицаПроизводства.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	// <+БИТ> Руденков_Е.И. 21.03.2024 
	// #000000042, ЧТЗ_3_6_АРМ отражение выпущенной продукции
		//"ВЫБРАТЬ
		//|	ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура.Код КАК Код,
		//|	ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура КАК Изделие,
		//// <+БИТ> Руденков_Е.И. 20.03.2024 
		//// #000000042, ЧТЗ_3_6_АРМ отражение выпущенной продукции
		////|	ЭтапПроизводства2_2ВыходныеИзделия.КоличествоУпаковок КАК КоличествоПлан,
		////|	ЭтапПроизводства2_2ВыходныеИзделия.Упаковка КАК ЕдИзмерения,
		//|	ЭтапПроизводства2_2.КоличествоУпаковокПлан КАК КоличествоПлан,
		//|	ЭтапПроизводства2_2ВыходныеИзделия.КоличествоУпаковок КАК КоличествоФакт,
		//|	ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура.ЕдиницаИзмерения КАК ЕдИзмерения,
		//// <-БИТ> Руденков_Е.И. 20.03.2024
		//|	ЭтапПроизводства2_2ВыходныеИзделия.Назначение КАК Назначение,
		//|	ЭтапПроизводства2_2.Распоряжение КАК Заказ,
		//|	ЭтапПроизводства2_2.КАНАТ_КомментарийКЗаказу КАК Комментарий,
		//|	ЭтапПроизводства2_2ВыходныеИзделия.Характеристика КАК Упаковка,
		//|	ЭтапПроизводства2_2.Ссылка КАК ЭтапПроизводства
		//|ИЗ
		//|	Документ.ЭтапПроизводства2_2 КАК ЭтапПроизводства2_2
		//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ЭтапПроизводства2_2ВыходныеИзделия
		//|		ПО ЭтапПроизводства2_2.Ссылка = ЭтапПроизводства2_2ВыходныеИзделия.Ссылка
		//|ГДЕ
		//|	ЭтапПроизводства2_2.ПометкаУдаления = ЛОЖЬ
		//|	И ЭтапПроизводства2_2ВыходныеИзделия.Отменено = ЛОЖЬ
		//|	И ЭтапПроизводства2_2ВыходныеИзделия.Произведено = ЛОЖЬ";
		
	"ВЫБРАТЬ
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка КАК ЭтапПроизводства,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура КАК Номенклатура,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Характеристика КАК Характеристика,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения КАК ВариантОбеспечения,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ЕСТЬNULL(РаспределениеЗапасов.Обеспечено, 0) КАК Обеспечено,
	|	ВЫБОР
	|		КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
	|			ТОГДА 2
	|		КОГДА ЕСТЬNULL(РаспределениеЗапасов.Обеспечено, 0) >= ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.КоличествоУпаковок
	|			ТОГДА 2
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК СтатусОбеспечения
	|ПОМЕСТИТЬ ВтОбеспечениеМатериалами
	|ИЗ
	|	Документ.ЭтапПроизводства2_2.ОбеспечениеМатериаламиИРаботами КАК ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
	|		ПО ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка = РаспределениеЗапасов.ЗаказНаОтгрузку
	|			И ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура = РаспределениеЗапасов.Номенклатура
	|			И ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Характеристика = РаспределениеЗапасов.Характеристика
	|			И (ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения <> ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить))
	|			И (РаспределениеЗапасов.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОбеспеченНаСкладе))
	|ГДЕ
	|	НЕ ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГрафикЭтаповПроизводства2_2.Распоряжение КАК Распоряжение,
	|	ГрафикЭтаповПроизводства2_2.СтатусГрафика КАК СтатусГрафика,
	|	ГрафикЭтаповПроизводства2_2.ЭтапПроизводства КАК ЭтапПроизводства,
	|	ГрафикЭтаповПроизводства2_2.НачалоЭтапа КАК Начало,
	|	ГрафикЭтаповПроизводства2_2.ОкончаниеЭтапа КАК Окончание,
	|	ГрафикЭтаповПроизводства2_2.ОкончаниеПредварительногоБуфера КАК ОкончаниеПредварительногоБуфера,
	|	ГрафикЭтаповПроизводства2_2.НачалоЗавершающегоБуфера КАК НачалоЗавершающегоБуфера,
	|	ГрафикЭтаповПроизводства2_2.НачалоСледующегоЭтапа КАК НачалоСледующегоЭтапа,
	|	ГрафикЭтаповПроизводства2_2.НаКритическомПути КАК НаКритическомПути,
	|	ГрафикЭтаповПроизводства2_2.ОграничиваетСрокВыпуска КАК ОграничиваетСрокВыпуска,
	|	ГрафикЭтаповПроизводства2_2.ОграниченПоМатериалам КАК ОграниченПоМатериалам,
	|	ГрафикЭтаповПроизводства2_2.ОграниченПоОборудованию КАК ОграниченПоОборудованию,
	|	ГрафикЭтаповПроизводства2_2.РазмещениеВыпуска КАК РазмещениеВыпуска
	|ПОМЕСТИТЬ ВтГрафикЭтаповПроизводства
	|ИЗ
	|	РегистрСведений.ГрафикЭтаповПроизводства2_2 КАК ГрафикЭтаповПроизводства2_2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура.Код КАК Код,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура КАК Изделие,
	|	ЭтапПроизводства2_2.КоличествоУпаковокПлан КАК КоличествоПлан,
	|	ЭтапПроизводства2_2ВыходныеИзделия.КоличествоУпаковок КАК КоличествоФакт,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура.ЕдиницаИзмерения КАК ЕдИзмерения,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Назначение КАК Назначение,
	|	ЭтапПроизводства2_2ВыходныеИзделия.НомерСтроки КАК НомерСтрокиВыпуска,
	|	ЭтапПроизводства2_2.Распоряжение КАК Заказ,
	|	ЭтапПроизводства2_2.КАНАТ_КомментарийКЗаказу КАК Комментарий,
	|	ЭтапПроизводства2_2ВыходныеИзделия.Характеристика КАК Упаковка,
	|	ЭтапПроизводства2_2.Ссылка КАК ЭтапПроизводства,
	|	ЕСТЬNULL(ВложенныйЗапрос.СтатусОбеспечения, 1) КАК СтатусОбеспечения,
	|	ЕСТЬNULL(ВтГрафикЭтаповПроизводства.Начало, ДАТАВРЕМЯ(1, 1, 1)) КАК Начало,
	|	ЕСТЬNULL(ВтГрафикЭтаповПроизводства.Окончание, ДАТАВРЕМЯ(1, 1, 1)) КАК Окончание
	|ИЗ
	|	Документ.ЭтапПроизводства2_2 КАК ЭтапПроизводства2_2
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ЭтапПроизводства2_2ВыходныеИзделия
	|		ПО ЭтапПроизводства2_2.Ссылка = ЭтапПроизводства2_2ВыходныеИзделия.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВтОбеспечениеМатериалами.ЭтапПроизводства КАК ЭтапПроизводства,
	|			МИНИМУМ(ВтОбеспечениеМатериалами.СтатусОбеспечения) КАК СтатусОбеспечения
	|		ИЗ
	|			ВтОбеспечениеМатериалами КАК ВтОбеспечениеМатериалами
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВтОбеспечениеМатериалами.ЭтапПроизводства) КАК ВложенныйЗапрос
	|		ПО ЭтапПроизводства2_2.Ссылка = ВложенныйЗапрос.ЭтапПроизводства
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтГрафикЭтаповПроизводства КАК ВтГрафикЭтаповПроизводства
	|		ПО ЭтапПроизводства2_2.Ссылка = ВтГрафикЭтаповПроизводства.ЭтапПроизводства
	|			И ЭтапПроизводства2_2.Распоряжение = ВтГрафикЭтаповПроизводства.Распоряжение
	|ГДЕ
	|	ЭтапПроизводства2_2.ПометкаУдаления = ЛОЖЬ";
	// <-БИТ> Руденков_Е.И. 21.03.2024
	
	Запрос.УстановитьПараметр("НачалоПериода", ФильтрПериод.ДатаНачала);
	Запрос.УстановитьПараметр("ОкончаниеПериода", ФильтрПериод.ДатаОкончания);
	
	//Фильтры
	Если ЗначениеЗаполнено(ФильтрИзделие) Тогда
		
		Запрос.Текст = Запрос.Текст + "
		|	И ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура = &Номенклатура";
		
		Запрос.УстановитьПараметр("Номенклатура", ФильтрИзделие);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ФильтрПодразделение) Тогда
		
		Запрос.Текст = Запрос.Текст + "
		|	И ЭтапПроизводства2_2.Подразделение = &Подразделение";
		
		Запрос.УстановитьПараметр("Подразделение", ФильтрПодразделение);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ФильтрСостояние) Тогда
		
		Запрос.Текст = Запрос.Текст + "
		|	И ЭтапПроизводства2_2.Статус = &Состояние";
		
		Запрос.УстановитьПараметр("Состояние", ФильтрСостояние);
		
	КонецЕсли;
	
	// <+БИТ> Руденков_Е.И. 20.03.2024 
	// #000000042, ЧТЗ_3_6_АРМ отражение выпущенной продукции
	Если ЗначениеЗаполнено(ФильтрОбеспечение) Тогда
		Если ФильтрОбеспечение = 1 Тогда//Ждет обеспечение
			Запрос.Текст = Запрос.Текст + "
			|	И ЕСТЬNULL(ВложенныйЗапрос.СтатусОбеспечения, 1) = 1";
		ИначеЕсли ФильтрОбеспечение = 2 Тогда//Обеспечен полностью
			Запрос.Текст = Запрос.Текст + "
			|	И ЕСТЬNULL(ВложенныйЗапрос.СтатусОбеспечения, 1) = 2";
		КонецЕсли;
	КонецЕсли;
	// <-БИТ> Руденков_Е.И. 20.03.2024
	
	//Вывод
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		//График = Документы.ЭтапПроизводства2_2.ГрафикПроизводства(ВыборкаДетальныеЗаписи.ЭтапПроизводства);
		
		Если Не (ВыборкаДетальныеЗаписи.Начало > ФильтрПериод.ДатаОкончания ИЛИ ВыборкаДетальныеЗаписи.Окончание < ФильтрПериод.ДатаНачала) Тогда
			
			НоваяСтрока = ТаблицаПроизводства.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
			//НоваяСтрока.Начало = График.НачалоЭтапа;
			//НоваяСтрока.Окончание = График.ОкончаниеЭтапа;
		ИначеЕсли Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Начало) 
			И Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Окончание) Тогда//График отсутсвует, тоже включим в ТЧ
			НоваяСтрока = ТаблицаПроизводства.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// <+БИТ> Руденков_Е.И. 22.03.2024 
	// #000000042, Обработка Отражение выпуска
	ЗаполнитьДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров();
	
	ФильтрСостояние = Перечисления.СтатусыЭтаповПроизводства2_2.КВыполнению;
	// <-БИТ> Руденков_Е.И. 22.03.2024
	
	ФильтрПериод.ДатаНачала = НачалоМесяца(ТекущаяДата());
	ФильтрПериод.ДатаОкончания = КонецМесяца(ТекущаяДата());
	
	ОбновитьДанныеТаблицаПроизводства();
КонецПроцедуры

&НаКлиенте
Процедура ФильтрИзделиеПриИзменении(Элемент)
	ОбновитьДанныеТаблицаПроизводства();
КонецПроцедуры

&НаКлиенте
Процедура ФильтрПодразделениеПриИзменении(Элемент)
	ОбновитьДанныеТаблицаПроизводства();
КонецПроцедуры

&НаКлиенте
Процедура ФильтрСостояниеПриИзменении(Элемент)
	ОбновитьДанныеТаблицаПроизводства();
КонецПроцедуры

&НаКлиенте
Процедура ФильтрОбеспечениеПриИзменении(Элемент)
	ОбновитьДанныеТаблицаПроизводства();
КонецПроцедуры

&НаКлиенте
Процедура ФильтрПериодПриИзменении(Элемент)
	ОбновитьДанныеТаблицаПроизводства();
КонецПроцедуры

// <+БИТ> Руденков_Е.И. 14.03.2024 
// #000000042, ЧТЗ_3_6_АРМ отражение выпущенной продукции
&НаКлиенте
Процедура ТаблицаПроизводстваВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
	ТекущиеДанныеТаблицы = Элементы.ТаблицаПроизводства.ТекущиеДанные;
	
	Если Поле.Имя = "ТаблицаПроизводстваЗаказ" Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьЗначение(,ТекущиеДанныеТаблицы.Заказ);
	ИначеЕсли Поле.Имя = "ТаблицаПроизводстваКоличествоФакт" И ТекущиеДанныеТаблицы.Выбор = Истина Тогда
		ПараметрыВвода = Новый Структура("КоличествоФакт",ТекущиеДанныеТаблицы.КоличествоФакт);
		ОткрытьФорму("Обработка.КАНАТ_ОтражениеВыпуска.Форма.ФормаВводаКоличестваФакта",ПараметрыВвода,Элементы.ТаблицаПроизводства);
	ИначеЕсли Поле.Имя = "ТаблицаПроизводстваКоличествоФакт" И ТекущиеДанныеТаблицы.Выбор = Ложь Тогда
		//В таком случае редактирование количества (факт) не допускается
	Иначе
		СтандартнаяОбработка = Ложь;
		ПоказатьЗначение(,ТекущиеДанныеТаблицы.ЭтапПроизводства);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПроизводстваВыборПриИзменении(Элемент)
	
	ТекущиеДанныеТаблицы = Элементы.ТаблицаПроизводства.ТекущиеДанные;
	Если Не ТекущиеДанныеТаблицы.Выбор Тогда
		//ТекущиеДанныеТаблицы.КоличествоФакт = 0;
	Иначе
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПроизводстваОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущиеДанныеТаблицы = Элементы.ТаблицаПроизводства.ТекущиеДанные;
	РедактированноеКоличество = КоличествоФактИзХранилища(ВыбранноеЗначение);
	Если РедактированноеКоличество = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ввод нулевого количества фактического выпуска запрещено!";
		Сообщение.Поле = "ТаблицаПроизводства[" + ТекущиеДанныеТаблицы.ПолучитьИдентификатор() + "].КоличествоФакт";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	ТекущиеДанныеТаблицы.КоличествоФакт = ?(РедактированноеКоличество>ТекущиеДанныеТаблицы.КоличествоПлан,ТекущиеДанныеТаблицы.КоличествоПлан,РедактированноеКоличество);
	
КонецПроцедуры 

&НаСервере
Функция КоличествоФактИзХранилища(Адрес)
	Возврат ПолучитьИзВременногоХранилища(Адрес);
КонецФункции 

&НаКлиенте
Процедура УказатьСерии(Команда)
	
	Если НеВыбраныСтроки() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбрано ни одной строки";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	СнятьПризнакОбработаннойСтроки();
	
	ТекущееИмяКоманды = Команда.Имя;
	ОбработатьВыбранныеСтроки(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтразитьВыпуск(Команда)
	
	Если НеВыбраныСтроки() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбрано ни одной строки";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	СнятьПризнакОбработаннойСтроки();
	
	ТекущееИмяКоманды = Команда.Имя;
	ОбработатьВыбранныеСтроки(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Функция НеВыбраныСтроки()
	
	НеВыбраны = Истина;
	Для каждого СтрокаТЧ Из ТаблицаПроизводства Цикл
		Если СтрокаТЧ.Выбор Тогда
			НеВыбраны = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат НеВыбраны;
	
КонецФункции

Процедура СнятьПризнакОбработаннойСтроки()
	
	Для каждого СтрокаТЧ Из ТаблицаПроизводства Цикл
		СтрокаТЧ.СтрокаОбработана	= Ложь;
		СтрокаТЧ.ТекущийЭтапОбъект	= Ложь;
	КонецЦикла;
	
	//Сброс идентификатора
	ИдентификаторСтроки = Новый Структура("ПроверятьИдентификатор,ИдентификаторСтроки",Ложь,0);
	
КонецПроцедуры

// Отражение выпуска и присвоение серий.
// Параметры:
//  ИмяКоманды - строка, может иметь значения "УказатьСерии" и "ОтразитьВыпуск"
&НаКлиенте
Процедура ОбработатьВыбранныеСтроки(ИмяКоманды)
	
	Для каждого СтрокаТЧ Из ТаблицаПроизводства Цикл
		ОбработкаПрерыванияПользователя();
		Если Не СтрокаТЧ.Выбор Тогда
			Продолжить;
		КонецЕсли;
		
		//Если отражение производства необходимо для одной конкретной строки (обработка флага завершения производства)
		//то программа запоминает идентификатор данной строки. При обоходе ТЧ будут игнорироваться все строки
		//кроме строки с необходимым идентификатором
		Если Не ИдентификаторСтрокиПодходит(СтрокаТЧ.ПолучитьИдентификатор()) Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураСтрокВыпуска	= ПолучитьСтруктуруСтрокВыпускаНаСервере(СтрокаТЧ.ЭтапПроизводства,СтрокаТЧ.ТекущийЭтапОбъект);//Структура("Строки,ПрисвоитьСерии"), где ПрисвоитьСерии=Истина, если хотя бы для одной строки выпуска не присвоена серия
		СтрокиВыпуска			= СтруктураСтрокВыпуска.Строки;//Строки из ТЧ ВыходныеИзделия
		
		Если СтруктураСтрокВыпуска.ПрисвоитьСерии Тогда//Вне зависимости от ИмяКоманды присвоим серии
			//Присвоение серий
			Для каждого СтрокаВыпуска Из СтрокиВыпуска Цикл
				Если СтрокаВыпуска.КоличествоСерий < СтрокаВыпуска.Количество Тогда//Для данной строки необходимо присвоение серии
					//Присвоим серию для данной строки, указав её идентификатор
					ТекущийЭтапОбъект = ПолучитьДанныеОбъекта(СтрокаТЧ.ЭтапПроизводства);
					
					ИмяТЧ = "ВыходныеИзделия";
					ТекущиеДанныеИдентификатор = СтрокаВыпуска.НомерСтроки - 1;//Здесь указываем индекс массива структур, который ТЧ заменяет
					ПараметрыУказанияСерий = ПолучитьПараметрыУказанияСерий(ТекущийЭтапОбъект);
					
					ПараметрыФормыУказанияСерий = ПараметрыФормыУказанияСерий(ТекущиеДанныеИдентификатор,ИмяТЧ,ТекущийЭтапОбъект,ПараметрыУказанияСерий);
					ДополнительныеПараметры = Новый Структура("ПараметрыУказанияСерий,ПараметрыФормыУказанияСерий,СтрокаТЧ", 
					ПараметрыУказанияСерий[ИмяТЧ], ПараметрыФормыУказанияСерий,СтрокаТЧ);
					ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьПодборСерийЗавершение", ЭтотОбъект, ДополнительныеПараметры);
					
					ОткрытьФорму("Обработка.ПодборСерийВДокументы.Форма.РегистрацияИПодборСерийПоОднойСтрокеТоваров", 
								ПараметрыФормыУказанияСерий, 
								ЭтаФорма,,,,
								ОписаниеОповещения);
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Необходимо присвоить серию для изделия (" + СтрокаТЧ.Изделие
										+ ") из документа " + СтрокаТЧ.ЭтапПроизводства;
					Сообщение.Сообщить();
					Возврат;//После назначения серии заново вызовется процедура ОбработатьВыбранныеСтроки(ИмяКоманды)
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли ИмяКоманды = "УказатьСерии" Тогда
			//Попадание в эту ветку означает, что на данной строке строит галка Выбор, но признак СтруктураСтрокВыпуска.ПрисвоитьСерии = Ложь,
			//т.е. документу не требуется присвоение серии. Снимем признак Выбор
			СтрокаТЧ.Выбор				= Ложь;
		ИначеЕсли ИмяКоманды = "ОтразитьВыпуск" Тогда
			//Необходимо отразитьвыпуск без назначения серии (серия уже будет назначена)
			СтруктураСтроки = СоздатьСтруктуруСтроки();
			ЗаполнитьЗначенияСвойств(СтруктураСтроки,СтрокаТЧ);
			Если СтрокаТЧ.КоличествоПлан <= СтрокаТЧ.КоличествоФакт Тогда
				ЗавершитьПроизводство(СтруктураСтроки,?(ТипЗнч(СтрокаТЧ.ТекущийЭтапОбъект)=Тип("Структура"),СтрокаТЧ.ТекущийЭтапОбъект,ПолучитьДанныеОбъекта(СтрокаТЧ.ЭтапПроизводства)));
				СтрокаТЧ.Выбор				= Ложь;
			ИначеЕсли СтрокаТЧ.КоличествоФакт = 0 Тогда
				ОтменитьПроизводство(СтруктураСтроки,?(ТипЗнч(СтрокаТЧ.ТекущийЭтапОбъект)=Тип("Структура"),СтрокаТЧ.ТекущийЭтапОбъект,ПолучитьДанныеОбъекта(СтрокаТЧ.ЭтапПроизводства)));
				СтрокаТЧ.Выбор				= Ложь;
			ИначеЕсли СтрокаТЧ.КоличествоПлан * (1 - ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров/100) <= СтрокаТЧ.КоличествоФакт Тогда
				//Количество недопроизведенной продукции не превышает пороговое значение, просто завершаем этап
				ЗавершитьПроизводство(СтруктураСтроки,?(ТипЗнч(СтрокаТЧ.ТекущийЭтапОбъект)=Тип("Структура"),СтрокаТЧ.ТекущийЭтапОбъект,ПолучитьДанныеОбъекта(СтрокаТЧ.ЭтапПроизводства)));
				СтрокаТЧ.Выбор				= Ложь;
			Иначе//Недопроизводство плана превышает пороговое значение, спросим, завершать ли этап, возможно нужно создать новый этап
				// <+БИТ> Руденков_Е.И. 25.10.2024  
				// Пересчет норм по ресурсной спецификации
				
				//Вывод диалога
				ДопПараметры	= Новый Структура("СтрокаТЧ",СтрокаТЧ);
				//Оповещение		= Новый ОписаниеОповещения("ОбработатьВыборЗакрытияЭтапа",ЭтотОбъект,ДопПараметры);
				//ТекстВопроса	= "Выпущено менее " + Строка(100-ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров) 
				//				+ "% от плана, завершить " + СтрокаТЧ.ЭтапПроизводства + "?";
				//ПоказатьВопрос(Оповещение,ТекстВопроса,РежимДиалогаВопрос.ДаНет,
				//				0, // таймаут в секундах
				//				, // (необ.) кнопка по умолчанию
				//				"Завершение этапа" // (необ.) заголовок
				//				);
				
				//Диалог больше не выводим. А выполняем сценарий, как будто пользователь ответил "НЕТ" в диалоге,
				//т.е. данный этап завершаем с текущими цифрами факта выпуска, стартуем новый этап на оставшееся число выпуска
				ОбработатьВыборЗакрытияЭтапа(КодВозвратаДиалога.Нет,ДопПараметры);
				// <-БИТ> Руденков_Е.И. 25.10.2024
				
				Возврат;//После закрытия этапа заново вызовется процедура ОбработатьВыбранныеСтроки(ИмяКоманды)
			КонецЕсли;
		КонецЕсли;
		
		//ЗАПАСНОЙ СПОСОБ определения, заполнены ли серии
		//ФормаПодбораСерий = ПолучитьФорму("Обработка.ПодборСерийВДокументы.Форма.РегистрацияИПодборСерийПоОднойСтрокеТоваров",
		//									ПараметрыФормыУказанияСерий,
		//									ЭтаФорма,,,);
		//СерииНеЗаполнены = Ложь;
		//Если ФормаПодбораСерий.КоличествоСерий < ФормаПодбораСерий.Количество Тогда
		//	СерииНеЗаполнены = Истина;
		//КонецЕсли;
		
	КонецЦикла;
	
	Если НеВыбраныСтроки() Тогда//Значит все строки обработаны
		ЗаписатьИзмененныеЭтапыПроизводства();
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Обработка завершена";
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруСтрокВыпускаНаСервере(СсылкаНаЭтап,ТекущийЭтапОбъект=Неопределено)
	
	ДанныеОбработки = РеквизитФормыВЗначение("Объект");
	Возврат ДанныеОбработки.ПолучитьСтруктуруСтрокВыпуска(СсылкаНаЭтап,ТекущийЭтапОбъект);
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров()
	
	ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров = Константы.ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров.Получить();
	ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров = ?(ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров=0,10,ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров);
	Элементы.ДекорацияДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров.Заголовок = "Допустимое отклонение отгрузки и приемки: " 
																		+ ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров + "%";
	
КонецПроцедуры

#Область Открытие_формы_подбора_серий

&НаСервере
Функция ПолучитьПараметрыУказанияСерий(ЭтапОбъект)
	
	Возврат Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(ЭтапОбъект, Документы.ЭтапПроизводства2_2));
	
КонецФункции // ПолучитьПараметрыУказанияСерий()()

&НаСервере
Функция ПолучитьДанныеОбъекта(СсылкаНаОбъект,ТекущийЭтапОбъект=Неопределено)
	
	СтруктураОбъекта = Новый Структура;
	
	ВходящийОбъект = ?(ТекущийЭтапОбъект=Неопределено,СсылкаНаОбъект.ПолучитьОбъект(),ТекущийЭтапОбъект);
	СтандартныеРеквизитыОбъекта = ВходящийОбъект.Метаданные().СтандартныеРеквизиты;
	Для Каждого СтандартныйРеквизит Из СтандартныеРеквизитыОбъекта Цикл
		СтруктураОбъекта.Вставить(СтандартныйРеквизит.Имя, ВходящийОбъект[СтандартныйРеквизит.Имя]);
	КонецЦикла;
	
	РеквизитыОбъекта = ВходящийОбъект.Метаданные().Реквизиты;
	Для Каждого Реквизит Из РеквизитыОбъекта Цикл
		СтруктураОбъекта.Вставить(Реквизит.Имя, ВходящийОбъект[Реквизит.Имя]);
	КонецЦикла;
	
	ТЧ = ВходящийОбъект.Метаданные().ТабличныеЧасти;
	Для Каждого ТаблЧасть Из ТЧ Цикл
		ТЗ = ВходящийОбъект[ТаблЧасть.Имя].Выгрузить();
		Массив = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТЗ);
		СтруктураОбъекта.Вставить(ТаблЧасть.Имя, Массив);
	КонецЦикла;
	
	Возврат СтруктураОбъекта;
	
КонецФункции

&НаСервере
Функция ПараметрыФормыУказанияСерий(ТекущиеДанныеИдентификатор,ИмяТЧ,ЭтапОбъект,ПараметрыУказанияСерий)
	
	Возврат ПараметрыФормыУказанияСерийПродолжение(
					ЭтапОбъект, 
					ПараметрыУказанияСерий[ИмяТЧ], 
					ТекущиеДанныеИдентификатор, 
					ЭтаФорма);
	
КонецФункции

&НаСервере
Функция ПараметрыФормыУказанияСерийПродолжение(Объект,ПараметрыУказанияСерий,ТекущиеДанныеИдентификатор,Форма, Метаданные = Неопределено, ЗаголовокКолонкиКоличество = "")
	
	МетаданныеДокумента = ОбщегоНазначенияУТ.МетаданныеОбъектаПоПолномуИмени(ПараметрыУказанияСерий.ПолноеИмяОбъекта);
	
	УникальныйИдентификаторФормы = Форма.УникальныйИдентификатор;
	
	// Если нужно будет изменять количество, то данные формы нужно заблокировать
	// Если заблокировать не удастся - вылетит исключение.
	Если Не ПараметрыУказанияСерий.ТолькоПросмотр
		И ПараметрыУказанияСерий.БлокироватьДанныеФормы Тогда
		Форма.ЗаблокироватьДанныеФормыДляРедактирования();
	КонецЕсли;
	
	Если Не ПараметрыУказанияСерий.ТолькоПросмотр Тогда
		Форма.Модифицированность = Истина;
	КонецЕсли;
	
	ТекстПоляСвязи = "";
	ТекстВыбораТоваров = "";
	
	Для Каждого СтрМас Из ПараметрыУказанияСерий.ПоляСвязи Цикл
		ТекстВыбораТоваров = ТекстВыбораТоваров + "
		|	ТаблицаТоваров."  + СтрМас + ", ";
		
		ТекстПоляСвязи = ТекстПоляСвязи + "," + СтрМас  ;
	КонецЦикла;
	
	Если ПараметрыУказанияСерий.ТоварВШапке Тогда
		ТекущиеДанные = Объект; // ДокументТабличнаяЧастьСтрока.АктОРасхожденияхПослеПриемки.Товары - указано для типизации
	Иначе
		Если ТипЗнч(Объект[ПараметрыУказанияСерий.ИмяТЧТовары]) = Тип("Массив") Тогда//Если это массив, значит переданный идентификатор - это индекс массива
			ТекущиеДанные = Объект[ПараметрыУказанияСерий.ИмяТЧТовары][ТекущиеДанныеИдентификатор];
		Иначе
			ТекущиеДанные = Объект[ПараметрыУказанияСерий.ИмяТЧТовары].НайтиПоИдентификатору(ТекущиеДанныеИдентификатор);
		КонецЕсли;
	КонецЕсли;

	ЕстьУпаковки = ПараметрыУказанияСерий.ПоляСвязи.Найти("Упаковка") <> Неопределено;
	ЕстьДействие = ПараметрыУказанияСерий.ПоляСвязи.Найти("Действие") <> Неопределено;
	УпаковкаДляПодстановки = Неопределено;
	ИдетОбработкаТоварныхМест = Ложь;
	Если ПараметрыУказанияСерий.ИспользуютсяТоварныеМеста Тогда
		ИдетОбработкаТоварныхМест = (ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущиеДанные.Упаковка, "ТипУпаковки")
										= Перечисления.ТипыУпаковокНоменклатуры.ТоварноеМесто);
	КонецЕсли;
	
	Если ЕстьДействие Тогда
		РегистрироватьСерии = ?(ТекущиеДанные.Действие = Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.Отобрать, Ложь, Истина);
	Иначе
		РегистрироватьСерии = ПараметрыУказанияСерий.РегистрироватьСерии;
	КонецЕсли;
	
	Если РегистрироватьСерии Тогда
		НомераСтрокДокумента = "";
		
		Если ЕстьУпаковки
			И ЗначениеЗаполнено(ТекущиеДанные.Упаковка) Тогда //не заполнена для тары
			ДанныеУпаковки = Справочники.УпаковкиЕдиницыИзмерения.КоэффициентВесОбъемПрочиеРеквизитыУпаковки(ТекущиеДанные.Упаковка, ТекущиеДанные.Номенклатура);
			КоэффициентУпаковки      = ДанныеУпаковки.Коэффициент; 
			НужноОкруглятьКоличество = ДанныеУпаковки.НужноОкруглятьКоличество;
		Иначе
			КоэффициентУпаковки = 1;
			НужноОкруглятьКоличество = Ложь;
		КонецЕсли;
		
		Упаковки = Новый Массив();
		
		Если ПараметрыУказанияСерий.ТоварВШапке Тогда
			ЕстьУпаковкиВТЧТовары = Ложь;
			Если Объект.Свойство("Упаковка") Тогда
				Упаковки.Добавить(Объект.Упаковка);
			КонецЕсли;
		Иначе
			КолонкиТаблицы = ОбщегоНазначенияУТ.МассивВТаблицуЗначений(Объект[ПараметрыУказанияСерий.ИмяТЧТовары]); // ТаблицаЗначений
			КолонкиТаблицы.Очистить();
			ЕстьУпаковкиВТЧТовары = КолонкиТаблицы.Колонки.Найти("Упаковка") <> Неопределено;
		КонецЕсли;
		
		КолонкиТаблицы = ОбщегоНазначенияУТ.МассивВТаблицуЗначений(Объект[ПараметрыУказанияСерий.ИмяТЧСерии]); // ТаблицаЗначений
		КолонкиТаблицы.Очистить();
		ЕстьУпаковкиВТЧСерии = КолонкиТаблицы.Колонки.Найти("Упаковка") <> Неопределено;
		
		Если ЕстьУпаковкиВТЧТовары Тогда
			УпаковкиТЧТовары = ОбщегоНазначенияУТ.МассивВТаблицуЗначений(Объект[ПараметрыУказанияСерий.ИмяТЧТовары]);
			УпаковкиТЧТовары = УпаковкиТЧТовары.ВыгрузитьКолонку("Упаковка");
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Упаковки, УпаковкиТЧТовары);
		КонецЕсли;
		Если ЕстьУпаковкиВТЧСерии Тогда
			УпаковкиТЧСерии = ОбщегоНазначенияУТ.МассивВТаблицуЗначений(Объект[ПараметрыУказанияСерий.ИмяТЧСерии]);
			УпаковкиТЧСерии = УпаковкиТЧСерии.ВыгрузитьКолонку("Упаковка");
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Упаковки, УпаковкиТЧСерии);
		КонецЕсли;
		
		Упаковки = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Упаковки);
		ТипыУпаковок = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(Упаковки, "ТипУпаковки");
		
		Если ПараметрыУказанияСерий.ТоварВШапке Тогда
			КоличествоВДокументе = Объект[ПараметрыУказанияСерий.ИмяПоляКоличество]*КоэффициентУпаковки;
			СтруктураПоиска = Новый Структура("Номенклатура,Характеристика"+ТекстПоляСвязи);
			ЗаполнитьЗначенияСвойств(СтруктураПоиска,Объект);
		Иначе
			СтруктураПоиска = Новый Структура("Номенклатура,Характеристика"+ТекстПоляСвязи);
			ЗаполнитьЗначенияСвойств(СтруктураПоиска,ТекущиеДанные);
			
			ТекстПоляСвязиУпаковка = ?(ЕстьУпаковкиВТЧТовары И Не ЕстьУпаковки, ", Упаковка", "");
			
			ВыгружаемыеПоля = "Номенклатура,Характеристика" + ТекстПоляСвязи + ТекстПоляСвязиУпаковка;
			ТаблицаТовары = ОбщегоНазначенияУТ.МассивВТаблицуЗначений(Объект[ПараметрыУказанияСерий.ИмяТЧТовары]);
			ТаблицаТовары.Свернуть(ВыгружаемыеПоля, ПараметрыУказанияСерий.ИмяПоляКоличество);
			
			НайденныеСтрокиТоваровСгруппированные = ТаблицаТовары.НайтиСтроки(СтруктураПоиска);
			
			КоличествоВДокументе = 0;
			МинимальноеКоличествоЦелыхНаборов = 0;
			Для Каждого СтрМас Из НайденныеСтрокиТоваровСгруппированные Цикл
				
				Если ЕстьУпаковкиВТЧТовары Тогда
					
					ТоварныеМестаВСтроке = (ТипыУпаковок.Получить(СтрМас.Упаковка)
												= Перечисления.ТипыУпаковокНоменклатуры.ТоварноеМесто);
					// Если форма указания серий вызывается для строки с упаковкой - товарным местом,
					// то нужно исключать из алгоритма строки с другими типами упаковок. И наоборот.
					Если ИдетОбработкаТоварныхМест
						И Не ТоварныеМестаВСтроке Тогда
						Продолжить;
					ИначеЕсли Не ИдетОбработкаТоварныхМест
						И ТоварныеМестаВСтроке Тогда
						Продолжить;
					КонецЕсли;
				
					// Расчитаем упаковку, в которой нужно отображать количество в форме редактирования упаковок
					// Если для всех строк указана одна упаковка - то в ней и будем отображать количество
					// Если упаковка входит в поля связи, то она и будет единственной для всех строк.
					Если УпаковкаДляПодстановки = Неопределено Тогда
						УпаковкаДляПодстановки = СтрМас.Упаковка;
					ИначеЕсли УпаковкаДляПодстановки <> СтрМас.Упаковка Тогда
						УпаковкаДляПодстановки = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
					КонецЕсли;
					
				КонецЕсли;
				
				Если НужноОкруглятьКоличество Тогда
					СтрМас[ПараметрыУказанияСерий.ИмяПоляКоличество] = Окр(СтрМас[ПараметрыУказанияСерий.ИмяПоляКоличество], 0, РежимОкругления.Окр15как20);
				КонецЕсли;
				
				Если ИдетОбработкаТоварныхМест Тогда
					// Количество упаковок, из которых состоит одна штука товара
					КоэффициентУпаковки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрМас.Упаковка, "КоличествоУпаковок");
					
					КоличествоЦелыхНаборов = СтрМас[ПараметрыУказанияСерий.ИмяПоляКоличество];
					
					МинимальноеКоличествоЦелыхНаборов = ?(МинимальноеКоличествоЦелыхНаборов = 0,
															КоличествоЦелыхНаборов,
															Мин(КоличествоЦелыхНаборов, МинимальноеКоличествоЦелыхНаборов));
															
					КоличествоВДокументе = МинимальноеКоличествоЦелыхНаборов;
				Иначе
					КоличествоВДокументе = КоличествоВДокументе + СтрМас[ПараметрыУказанияСерий.ИмяПоляКоличество]*КоэффициентУпаковки;
				КонецЕсли;
				
			КонецЦикла;
			
			Попытка
				НайденныеСтрокиТоваров = ОбщегоНазначенияУТ.МассивВТаблицуЗначений(Объект[ПараметрыУказанияСерий.ИмяТЧТовары]).НайтиСтроки(СтруктураПоиска);
			Исключение
				НайденныеСтрокиТоваров = Новый Массив;
			КонецПопытки;
			
			Для Каждого СтрМас Из НайденныеСтрокиТоваров Цикл
				Если ЕстьУпаковкиВТЧТовары Тогда
					
					ТоварныеМестаВСтроке = (ТипыУпаковок.Получить(СтрМас.Упаковка)
												= Перечисления.ТипыУпаковокНоменклатуры.ТоварноеМесто);
					// Если форма указания серий вызывается для строки с упаковкой - товарным местом,
					// то нужно исключать из алгоритма строки с другими типами упаковок. И наоборот.
					Если ИдетОбработкаТоварныхМест
						И Не ТоварныеМестаВСтроке Тогда
						Продолжить;
					ИначеЕсли Не ИдетОбработкаТоварныхМест
						И ТоварныеМестаВСтроке Тогда
						Продолжить;
					КонецЕсли;
				КонецЕсли;
				
				НомераСтрокДокумента = НомераСтрокДокумента + Строка(СтрМас.НомерСтроки) + ", ";
			КонецЦикла;
			
			Если Не ПустаяСтрока(НомераСтрокДокумента) Тогда
				НомераСтрокДокумента = Лев(НомераСтрокДокумента, СтрДлина(НомераСтрокДокумента)-2);
			КонецЕсли;
		КонецЕсли;
		
		ТаблицаСерий = Новый ТаблицаЗначений;
		ТаблицаСерий.Колонки.Добавить("Серия", Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
		ТаблицаСерий.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,3,ДопустимыйЗнак.Неотрицательный)));
		ТаблицаСерий.Колонки.Добавить("КоличествоУпаковок", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,3,ДопустимыйЗнак.Неотрицательный)));
		
		Попытка
			НайденныеСтрокиСерий = ОбщегоНазначенияУТ.МассивВТаблицуЗначений(Объект[ПараметрыУказанияСерий.ИмяТЧСерии]).НайтиСтроки(СтруктураПоиска);
		Исключение
			НайденныеСтрокиСерий = Новый Массив;
		КонецПопытки;
		
		Если ИдетОбработкаТоварныхМест Тогда
			Для Каждого СтрМас Из НайденныеСтрокиСерий Цикл
				
				Если ЕстьУпаковкиВТЧСерии Тогда
					
					ТоварныеМестаВСтроке = (ТипыУпаковок.Получить(СтрМас.Упаковка)
												= Перечисления.ТипыУпаковокНоменклатуры.ТоварноеМесто);
					// Если форма указания серий вызывается для строки с упаковкой - товарным местом,
					// то нужно исключать из алгоритма строки с другими типами упаковок.
					Если Не ТоварныеМестаВСтроке Тогда
						Продолжить;
					КонецЕсли;
					
				КонецЕсли;
				
				// При использовании товарных мест, необходимо получить свернутую таблицу с количеством приведенным
				// к максимуму - для правильного использования в последующем алгоритме распределения в методе ОбработатьУказаниеСерий.
				СтрокаСерий = ТаблицаСерий.Найти(СтрМас.Серия, "Серия");
				Если СтрокаСерий <> Неопределено Тогда
					
					СтрокаСерий.Количество = Макс(СтрокаСерий.Количество, СтрМас[ПараметрыУказанияСерий.ИмяПоляКоличество]);
					СтрокаСерий.КоличествоУпаковок = СтрокаСерий.Количество;
					
				Иначе
					
					НоваяСтрока = ТаблицаСерий.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрМас);
					
					// Сделано неуниверсально. Если упаковки есть в полях связи, то поля с количеством во всех документах называются стандартно.
					Если Не ЕстьУпаковки Тогда
						НоваяСтрока.Количество = СтрМас[ПараметрыУказанияСерий.ИмяПоляКоличество];
						НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество;
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
		Иначе
			Для Каждого СтрМас Из НайденныеСтрокиСерий Цикл
				
				Если ПараметрыУказанияСерий.ИспользуютсяТоварныеМеста
					И ЕстьУпаковкиВТЧСерии Тогда
					
					ТоварныеМестаВСтроке = (ТипыУпаковок.Получить(СтрМас.Упаковка)
												= Перечисления.ТипыУпаковокНоменклатуры.ТоварноеМесто);
					// Если форма указания серий вызывается для строки с упаковкой - не товарным местом,
					// то нужно исключать из алгоритма строки с типом упаковки "товарное место".
					Если ТоварныеМестаВСтроке Тогда
						Продолжить;
					КонецЕсли;
					
				КонецЕсли;
				
				НоваяСтрока = ТаблицаСерий.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрМас);
				
				// Сделано неуниверсально. Если упаковки есть в полях связи, то поля с количеством во всех документах называются стандартно.
				Если Не ЕстьУпаковки Тогда
					НоваяСтрока.Количество = СтрМас[ПараметрыУказанияСерий.ИмяПоляКоличество];
					НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество;
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
		
		АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ТаблицаСерий,УникальныйИдентификаторФормы);
		
	Иначе
		ТаблицаТоваров = Новый ТаблицаЗначений;
		ТаблицаТоваров.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ТаблицаТоваров.Колонки.Добавить("Характеристика",Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
		ТаблицаТоваров.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,3,ДопустимыйЗнак.Неотрицательный)));
		Если НЕ ЕстьУпаковки Тогда
			ТаблицаТоваров.Колонки.Добавить("Упаковка",Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
		КонецЕсли;
		ТаблицаТоваров.Колонки.Добавить("НомераСтрокДокумента",Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(100)));
		
		НоменклатураСервер.ДополнитьТаблицуКолонкамиПоПолямПараметровУказанияСерий(ПараметрыУказанияСерий, ТаблицаТоваров, Метаданные); 
		
		Если ПараметрыУказанияСерий.ТоварВШапке Тогда
			СтрокаТовара = ТаблицаТоваров.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТовара,Объект);
			Если ПараметрыУказанияСерий.ЭтоЗаказ
				И ПараметрыУказанияСерий.СкладскиеОперации.Найти(Перечисления.СкладскиеОперации.ОтгрузкаКомплектовДляРазборки) <> Неопределено
				И Не Объект.Обособленно Тогда
				// В шапке заказов при смене варианта обеспечения не очищается назначение,
				//	поэтому для необособленной отгрузки сбросим назначение здесь.
				СтрокаТовара.Назначение = Справочники.Назначения.ПустаяСсылка();
			КонецЕсли;
		Иначе
			
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	ТаблицаТоваров.ТекстВыбораТоваров,
			|	ТаблицаТоваров.Номенклатура,
			|	ТаблицаТоваров.Характеристика,
			|	ТаблицаТоваров.Количество,
			|	ВЫРАЗИТЬ(ТаблицаТоваров.Упаковка КАК Справочник.УпаковкиЕдиницыИзмерения) КАК Упаковка,
			|	ТаблицаТоваров.НомерСтроки
			|ПОМЕСТИТЬ ТаблицаТоваров
			|ИЗ
			|	&ТаблицаТоваров КАК ТаблицаТоваров
			|ГДЕ
			|	ТаблицаТоваров.СтатусУказанияСерий В(&ОтборПоСтатусам)
			|	И &УсловиеПоДействию
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТаблицаТоваров.ТекстВыбораТоваров,
			|	ТаблицаТоваров.Номенклатура,
			|	ТаблицаТоваров.Характеристика,
			|	ТаблицаТоваров.Количество КАК Количество,
			|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки
			|ИЗ
			|	(ВЫБРАТЬ
			|		ТаблицаТоваров.ТекстВыбораТоваров,
			|		ТаблицаТоваров.Номенклатура КАК Номенклатура,
			|		ТаблицаТоваров.Характеристика КАК Характеристика,
			|		МИНИМУМ(ТаблицаТоваров.Количество) КАК Количество,
			|		МИНИМУМ(ТаблицаТоваров.НомерСтроки) КАК НомерСтроки
			|	ИЗ
			|		ТаблицаТоваров КАК ТаблицаТоваров
			|	ГДЕ
			|		ЕСТЬNULL(ТаблицаТоваров.Упаковка.ТипУпаковки, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковокНоменклатуры.ТоварноеМесто)
			|	
			|	СГРУППИРОВАТЬ ПО
			|		ТаблицаТоваров.ТекстВыбораТоваров,
			|		ТаблицаТоваров.Номенклатура,
			|		ТаблицаТоваров.Характеристика,
			|		ТаблицаТоваров.Количество
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		ТаблицаТоваров.ТекстВыбораТоваров,
			|		ТаблицаТоваров.Номенклатура,
			|		ТаблицаТоваров.Характеристика,
			|		ТаблицаТоваров.Количество,
			|		ТаблицаТоваров.НомерСтроки
			|	ИЗ
			|		ТаблицаТоваров КАК ТаблицаТоваров
			|	ГДЕ
			|		ЕСТЬNULL(ТаблицаТоваров.Упаковка.ТипУпаковки, НЕОПРЕДЕЛЕНО) <> ЗНАЧЕНИЕ(Перечисление.ТипыУпаковокНоменклатуры.ТоварноеМесто)) КАК ТаблицаТоваров
			|
			|УПОРЯДОЧИТЬ ПО
			|	ТаблицаТоваров.ТекстВыбораТоваров,
			|	ТаблицаТоваров.Номенклатура,
			|	ТаблицаТоваров.Характеристика,
			|	ТаблицаТоваров.НомерСтроки";
			
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТаблицаТоваров.ТекстВыбораТоваров,", ТекстВыбораТоваров); 
			
			Если Не ЕстьУпаковки Тогда
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТаблицаТоваров.Упаковка,", ""); 
			КонецЕсли;
			
			Если ЕстьДействие Тогда
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
											"&УсловиеПоДействию",
											"ТаблицаТоваров.Действие = ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиОрдеровНаОтгрузку.Отобрать)");
			Иначе
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоДействию", "ИСТИНА");
			КонецЕсли;		
			
			Запрос = Новый Запрос;
			Запрос.Текст = ТекстЗапроса;
			
			Если ПараметрыУказанияСерий.НужноОкруглятьКоличество
				И СтрНайти(ПараметрыУказанияСерий.ИмяПоляКоличество, "КоличествоУпаковок") = 0 Тогда
				
				Если ПараметрыУказанияСерий.ТоварВШапке Тогда
					ДанныеУпаковки = Справочники.УпаковкиЕдиницыИзмерения.КоэффициентВесОбъемПрочиеРеквизитыУпаковки(Объект.Упаковка, Объект.Номенклатура);
					Если ДанныеУпаковки.НужноОкруглятьКоличество Тогда
						Объект[ПараметрыУказанияСерий.ИмяПоляКоличество] = Окр(Объект[ПараметрыУказанияСерий.ИмяПоляКоличество], 0, РежимОкругления.Окр15как20);
					КонецЕсли;
				Иначе
					ПараметрыОкругления = НоменклатураСервер.ПараметрыОкругленияКоличестваШтучныхТоваров();
					ПараметрыОкругления.ИмяТЧ = ПараметрыУказанияСерий.ИмяТЧТовары;
					
					ДлинаИмяПоляКоличество = СтрДлина(ПараметрыУказанияСерий.ИмяПоляКоличество);
					
					Если ДлинаИмяПоляКоличество > 10 Тогда
						ПараметрыОкругления.СуффиксДопРеквизита = Прав(ПараметрыУказанияСерий.ИмяПоляКоличество, ДлинаИмяПоляКоличество - 10);
					КонецЕсли;
					
					ОкруглитьКоличествоШтучныхТоваров(Объект, Неопределено, ПараметрыОкругления);
				КонецЕсли;
				
			КонецЕсли;
			
			ТЧ = ОбщегоНазначенияУТ.МассивВТаблицуЗначений(Объект[ПараметрыУказанияСерий.ИмяТЧТовары]);
			
			Запрос.УстановитьПараметр("ТаблицаТоваров",ТЧ);

			ОтборПоСтатусамУказанияСерий = Новый Массив;
			ОтборПоСтатусамУказанияСерий.Добавить(3);
			ОтборПоСтатусамУказанияСерий.Добавить(23);
			ОтборПоСтатусамУказанияСерий.Добавить(4);
			ОтборПоСтатусамУказанияСерий.Добавить(5);
			ОтборПоСтатусамУказанияСерий.Добавить(25);
			ОтборПоСтатусамУказанияСерий.Добавить(6);
			ОтборПоСтатусамУказанияСерий.Добавить(7);
			ОтборПоСтатусамУказанияСерий.Добавить(27);
			ОтборПоСтатусамУказанияСерий.Добавить(8);
			Если ПараметрыУказанияСерий.СерииПриПланированииОтгрузкиУказываютсяВТЧСерии
				ИЛИ ПараметрыУказанияСерий.ИмяТЧТовары = ПараметрыУказанияСерий.ИмяТЧСерии Тогда
				ОтборПоСтатусамУказанияСерий.Добавить(9);
				ОтборПоСтатусамУказанияСерий.Добавить(10);
				ОтборПоСтатусамУказанияСерий.Добавить(11);
			КонецЕсли;
			Если ПараметрыУказанияСерий.ИмяТЧТовары = ПараметрыУказанияСерий.ИмяТЧСерии Тогда
				ОтборПоСтатусамУказанияСерий.Добавить(13);
				ОтборПоСтатусамУказанияСерий.Добавить(14);
				ОтборПоСтатусамУказанияСерий.Добавить(15);
				ОтборПоСтатусамУказанияСерий.Добавить(17);
				ОтборПоСтатусамУказанияСерий.Добавить(18);
				ОтборПоСтатусамУказанияСерий.Добавить(28);
				ОтборПоСтатусамУказанияСерий.Добавить(19);
				ОтборПоСтатусамУказанияСерий.Добавить(20);
				ОтборПоСтатусамУказанияСерий.Добавить(22);
			КонецЕсли;
			
			Запрос.УстановитьПараметр("ОтборПоСтатусам", ОтборПоСтатусамУказанияСерий);
			
			ПоляГруппировки = "Номенклатура,Характеристика" + ТекстПоляСвязи;
			
			ТекущаяГруппировка = Новый Структура(ПоляГруппировки);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			ТаблицаТоваров.Колонки.Добавить("НомерСтрокиДляСортировки",
				Новый ОписаниеТипов("Число",
				Новый КвалификаторыЧисла(5,0,ДопустимыйЗнак.Неотрицательный)));
			
			Количество               = 0;
			НомераСтрокДокумента     = "";
			НомерСтрокиДляСортировки = 0;
			
			НоваяСтрокаТоваров = Неопределено;
			
			Пока Выборка.Следующий() Цикл
				
				Если Не ОбщегоНазначенияУТКлиентСервер.СтруктурыРавны(ТекущаяГруппировка, Выборка, ПоляГруппировки) Тогда
					
					Если НоваяСтрокаТоваров <> Неопределено Тогда
						ЗаполнитьЗначенияСвойств(НоваяСтрокаТоваров,ТекущаяГруппировка);
						НоваяСтрокаТоваров.Количество = Количество;
						
						НомераСтрокДокумента = Лев(НомераСтрокДокумента, СтрДлина(НомераСтрокДокумента)-2);
						НоваяСтрокаТоваров.НомераСтрокДокумента     = НомераСтрокДокумента;
						НоваяСтрокаТоваров.НомерСтрокиДляСортировки = НомерСтрокиДляСортировки;
					КонецЕсли;
					
					ЗаполнитьЗначенияСвойств(ТекущаяГруппировка,Выборка);
					НоваяСтрокаТоваров       = ТаблицаТоваров.Добавить();
					НомерСтрокиДляСортировки = Выборка.НомерСтроки;
					Количество           = 0;
					НомераСтрокДокумента = "";
					
				КонецЕсли;
				
				Количество           = Количество + Выборка.Количество;
				НомераСтрокДокумента = НомераСтрокДокумента + Выборка.НомерСтроки + ", ";
				
			КонецЦикла;
			
			Если НоваяСтрокаТоваров <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(НоваяСтрокаТоваров,ТекущаяГруппировка);
				НоваяСтрокаТоваров.Количество = Количество;
				
				НомераСтрокДокумента = Лев(НомераСтрокДокумента, СтрДлина(НомераСтрокДокумента)-2);
				НоваяСтрокаТоваров.НомераСтрокДокумента = НомераСтрокДокумента;
				НоваяСтрокаТоваров.НомерСтрокиДляСортировки = НомерСтрокиДляСортировки;
			КонецЕсли;
			
			ТаблицаТоваров.Сортировать("НомерСтрокиДляСортировки");
			ТаблицаТоваров.Колонки.Удалить("НомерСтрокиДляСортировки");
			
		КонецЕсли;
		СтруктураДляВременногоХранилища = Новый Структура;
		СтруктураДляВременногоХранилища.Вставить("ТаблицаТоваров",ТаблицаТоваров);
		
		ТаблицаСерий = ОбщегоНазначенияУТ.МассивВТаблицуЗначений(Объект[ПараметрыУказанияСерий.ИмяТЧСерии]);
		
		Если ПараметрыУказанияСерий.ИспользуютсяТоварныеМеста Тогда
			
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
			|	ТаблицаТоваров.ТекстВыбораТоваров,
			|	ВЫРАЗИТЬ(ТаблицаТоваров.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
			|	ТаблицаТоваров.Характеристика КАК Характеристика,
			|	ТаблицаТоваров.Серия КАК Серия,
			|	ВЫРАЗИТЬ(ТаблицаТоваров.Упаковка КАК Справочник.УпаковкиЕдиницыИзмерения) КАК Упаковка,
			|	ТаблицаТоваров.Количество КАК Количество
			|ПОМЕСТИТЬ ТаблицаТоваров
			|ИЗ
			|	&ТаблицаТоваров КАК ТаблицаТоваров
			|ГДЕ
			|	ТаблицаТоваров.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ТаблицаТоваров.ТекстВыбораТоваров,
			|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
			|	ТаблицаТоваров.Характеристика КАК Характеристика,
			|	ТаблицаТоваров.Серия КАК Серия,
			|	Упаковки.Ссылка КАК Упаковка
			|ПОМЕСТИТЬ УпаковкиТоваровПоТоварнымМестам
			|ИЗ
			|	ТаблицаТоваров КАК ТаблицаТоваров
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК Упаковки
			|		ПО ТаблицаТоваров.Номенклатура.НаборУпаковок = Упаковки.Владелец
			|			И (Упаковки.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковокНоменклатуры.ТоварноеМесто))
			|ГДЕ
			|	НЕ Упаковки.ПометкаУдаления
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ТаблицаТоваров.ТекстВыбораТоваров,
			|	ТаблицаТоваров.Номенклатура,
			|	ТаблицаТоваров.Характеристика,
			|	ТаблицаТоваров.Серия,
			|	Упаковки.Ссылка
			|ИЗ
			|	ТаблицаТоваров КАК ТаблицаТоваров
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК Упаковки
			|		ПО (ТаблицаТоваров.Номенклатура.НаборУпаковок = ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.ИндивидуальныйДляНоменклатуры))
			|			И ТаблицаТоваров.Номенклатура = Упаковки.Владелец
			|			И (Упаковки.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковокНоменклатуры.ТоварноеМесто))
			|ГДЕ
			|	НЕ Упаковки.ПометкаУдаления
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	МИНИМУМ(ТаблицаТоваров.НомерСтроки) КАК НомерСтроки,
			|	ТаблицаТоваров.ТекстВыбораТоваров,
			|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
			|	ТаблицаТоваров.Характеристика КАК Характеристика,
			|	ТаблицаТоваров.Упаковка КАК Упаковка,
			|	ТаблицаТоваров.Серия КАК Серия
			|ПОМЕСТИТЬ ПервыеНомераСтрокТоваровПоТоварнымМестам
			|ИЗ
			|	ТаблицаТоваров КАК ТаблицаТоваров
			|ГДЕ
			|	ЕСТЬNULL(ТаблицаТоваров.Упаковка.ТипУпаковки, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковокНоменклатуры.ТоварноеМесто)
			|
			|СГРУППИРОВАТЬ ПО
			|	ТаблицаТоваров.ТекстВыбораТоваров,
			|	ТаблицаТоваров.Номенклатура,
			|	ТаблицаТоваров.Характеристика,
			|	ТаблицаТоваров.Упаковка,
			|	ТаблицаТоваров.Серия
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТаблицаТоваров.ТекстВыбораТоваров,
			|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
			|	ТаблицаТоваров.Характеристика КАК Характеристика,
			|	ТаблицаТоваров.Серия КАК Серия,
			|	ТаблицаТоваров.Упаковка КАК Упаковка,
			|	СУММА(ТаблицаТоваров.Количество) КАК Количество
			|ПОМЕСТИТЬ ПолныеНаборыТоваровПоТоварнымМестам
			|ИЗ
			|	(ВЫБРАТЬ
			|		Упаковки.ТекстВыбораТоваров,
			|		Упаковки.Номенклатура КАК Номенклатура,
			|		Упаковки.Характеристика КАК Характеристика,
			|		Упаковки.Серия КАК Серия,
			|		Упаковки.Упаковка КАК Упаковка,
			|		ЕСТЬNULL(ТаблицаТоваров.Количество, 0) КАК Количество
			|	ИЗ
			|		УпаковкиТоваровПоТоварнымМестам КАК Упаковки
			|			ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаТоваров КАК ТаблицаТоваров
			|			ПО Упаковки.Номенклатура = ТаблицаТоваров.Номенклатура
			|				И Упаковки.Характеристика = ТаблицаТоваров.Характеристика
			|				И Упаковки.Серия = ТаблицаТоваров.Серия
			|				И Упаковки.Упаковка = ТаблицаТоваров.Упаковка
			|				И (&УсловиеСоединения)) КАК ТаблицаТоваров
			|
			|СГРУППИРОВАТЬ ПО
			|	ТаблицаТоваров.ТекстВыбораТоваров,
			|	ТаблицаТоваров.Номенклатура,
			|	ТаблицаТоваров.Характеристика,
			|	ТаблицаТоваров.Серия,
			|	ТаблицаТоваров.Упаковка
			|
			|ИМЕЮЩИЕ
			|	СУММА(ТаблицаТоваров.Количество) > 0
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТаблицаТоваров.ТекстВыбораТоваров,
			|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
			|	ТаблицаТоваров.Характеристика КАК Характеристика,
			|	ТаблицаТоваров.Упаковка КАК Упаковка,
			|	ТаблицаТоваров.Серия КАК Серия,
			|	ТаблицаТоваров.Количество КАК Количество,
			|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки
			|ИЗ
			|	(ВЫБРАТЬ
			|		МИНИМУМ(Упаковки.НомерСтроки) КАК НомерСтроки,
			|		ТаблицаТоваров.ТекстВыбораТоваров,
			|		ТаблицаТоваров.Номенклатура КАК Номенклатура,
			|		ТаблицаТоваров.Характеристика КАК Характеристика,
			|		ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) КАК Упаковка,
			|		ТаблицаТоваров.Серия КАК Серия,
			|		МИНИМУМ(ТаблицаТоваров.Количество) КАК Количество
			|	ИЗ
			|		ПолныеНаборыТоваровПоТоварнымМестам КАК ТаблицаТоваров
			|			ЛЕВОЕ СОЕДИНЕНИЕ ПервыеНомераСтрокТоваровПоТоварнымМестам КАК Упаковки
			|			ПО ТаблицаТоваров.Номенклатура = Упаковки.Номенклатура
			|				И ТаблицаТоваров.Номенклатура = Упаковки.Номенклатура
			|				И ТаблицаТоваров.Характеристика = Упаковки.Характеристика
			|				И ТаблицаТоваров.Серия = Упаковки.Серия
			|				И (&УсловиеСоединения)
			|	
			|	СГРУППИРОВАТЬ ПО
			|		ТаблицаТоваров.ТекстВыбораТоваров,
			|		ТаблицаТоваров.Номенклатура,
			|		ТаблицаТоваров.Характеристика,
			|		ТаблицаТоваров.Серия
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		ТаблицаТоваров.НомерСтроки,
			|		ТаблицаТоваров.ТекстВыбораТоваров,
			|		ТаблицаТоваров.Номенклатура,
			|		ТаблицаТоваров.Характеристика,
			|		ТаблицаТоваров.Упаковка,
			|		ТаблицаТоваров.Серия,
			|		ТаблицаТоваров.Количество
			|	ИЗ
			|		ТаблицаТоваров КАК ТаблицаТоваров
			|	ГДЕ
			|		ЕСТЬNULL(ТаблицаТоваров.Упаковка.ТипУпаковки, НЕОПРЕДЕЛЕНО) <> ЗНАЧЕНИЕ(Перечисление.ТипыУпаковокНоменклатуры.ТоварноеМесто)) КАК ТаблицаТоваров
			|
			|УПОРЯДОЧИТЬ ПО
			|	ТаблицаТоваров.НомерСтроки,
			|	ТаблицаТоваров.ТекстВыбораТоваров,
			|	ТаблицаТоваров.Номенклатура,
			|	ТаблицаТоваров.Характеристика,
			|	ТаблицаТоваров.Упаковка";
			
			ТекстыУсловияСоединенияТаблиц = Новый Массив;
			ТекстыУсловияСоединенияТаблиц.Добавить("ИСТИНА");
			
			ТекстВыбораТоваров= СтрЗаменить(ТекстВыбораТоваров, "ТаблицаТоваров.Упаковка,", "");
			ТекстВыбораУпаковок = СтрЗаменить(ТекстВыбораТоваров, "ТаблицаТоваров", "Упаковки");
			
			Для Каждого ПолеСвязи Из ПараметрыУказанияСерий.ПоляСвязи Цикл
				
				Если СтрНайти(ТекстВыбораТоваров, ПолеСвязи) = 0
					Или ПолеСвязи = "Упаковка" Тогда
					
					Продолжить;
					
				КонецЕсли;
				
				ТекстыУсловияСоединенияТаблиц.Добавить(" Упаковки." + ПолеСвязи + " = ТаблицаТоваров." + ПолеСвязи);
				
			КонецЦикла;
			
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТаблицаТоваров.ТекстВыбораТоваров,", ТекстВыбораТоваров);
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Упаковки.ТекстВыбораТоваров,", ТекстВыбораУпаковок);
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеСоединения", 
				СтрСоединить(ТекстыУсловияСоединенияТаблиц, Символы.ПС +"И " ));
				
			МенеджерВТ = Новый МенеджерВременныхТаблиц;
			
			Запрос = Новый Запрос;
			Запрос.Текст = ТекстЗапроса;
			Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
			Запрос.УстановитьПараметр("ТаблицаТоваров", ТаблицаСерий);
			ТаблицаСерий = Запрос.Выполнить().Выгрузить();
			
		Иначе
			
			СтрокиСерийКУдалению = ТаблицаСерий.НайтиСтроки(Новый Структура("Серия",Справочники.СерииНоменклатуры.ПустаяСсылка()));
			
			Для Каждого СтрМас Из СтрокиСерийКУдалению Цикл
				ТаблицаСерий.Удалить(СтрМас);
			КонецЦикла;
			
		КонецЕсли;
		
		СтруктураДляВременногоХранилища.Вставить("ТаблицаСерий",ТаблицаСерий);
		
		АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(СтруктураДляВременногоХранилища,УникальныйИдентификаторФормы);
	КонецЕсли;
	
	ПараметрыФормыУказанияСерий = Новый Структура("Номенклатура,Характеристика,СтатусУказанияСерий,ХарактеристикиИспользуются"+ТекстПоляСвязи);
	ПараметрыФормыУказанияСерий.Вставить("НомераСтрокДокумента", НомераСтрокДокумента); 
	
	Если ПараметрыУказанияСерий.ТоварВШапке Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыФормыУказанияСерий,Объект);
	Иначе
		ЗаполнитьЗначенияСвойств(ПараметрыФормыУказанияСерий,ТекущиеДанные);
	КонецЕсли;
	
	Если ПараметрыУказанияСерий.ИмяПоляСклад = Неопределено Тогда
		ПараметрыФормыУказанияСерий.Вставить("Склад", Неопределено);
	ИначеЕсли ПараметрыУказанияСерий.ПоляСвязи.Найти(ПараметрыУказанияСерий.ИмяПоляСклад) <> Неопределено Тогда
		ПараметрыФормыУказанияСерий.Вставить("Склад", ТекущиеДанные[ПараметрыУказанияСерий.ИмяПоляСклад]);
	Иначе
		ПараметрыФормыУказанияСерий.Вставить("Склад", Объект[ПараметрыУказанияСерий.ИмяПоляСклад]);
	КонецЕсли;
	
	Если ПараметрыУказанияСерий.ПоляСвязи.Найти("Помещение") <> Неопределено Тогда
		ПараметрыФормыУказанияСерий.Вставить("Помещение", ТекущиеДанные.Помещение);
	ИначеЕсли ПараметрыУказанияСерий.ИмяПоляПомещение = Неопределено Тогда
		ПараметрыФормыУказанияСерий.Вставить("Помещение", Справочники.СкладскиеПомещения.ПустаяСсылка());
	Иначе
		ПараметрыФормыУказанияСерий.Вставить("Помещение", Объект[ПараметрыУказанияСерий.ИмяПоляПомещение]);
	КонецЕсли;
	
	ПараметрыФормыУказанияСерий.Вставить("УпаковкаДляПодстановки",УпаковкаДляПодстановки);
	ПараметрыФормыУказанияСерий.Вставить("ИдетОбработкаТоварныхМест", ИдетОбработкаТоварныхМест);
	
	ПараметрыФормыУказанияСерий.Вставить("АдресВоВременномХранилище",АдресВоВременномХранилище);
	ПараметрыФормыУказанияСерий.Вставить("РегистрироватьСерии", РегистрироватьСерии);
	ПараметрыФормыУказанияСерий.Вставить("ТолькоПросмотр", ПараметрыУказанияСерий.ТолькоПросмотр);
	ПараметрыФормыУказанияСерий.Вставить("ТолькоРедактированиеКоличества", Ложь);
	ПараметрыФормыУказанияСерий.Вставить("Количество",КоличествоВДокументе);
	ПараметрыФормыУказанияСерий.Вставить("АдресВоВременномХранилище",АдресВоВременномХранилище);
	ПараметрыФормыУказанияСерий.Вставить("СерииВТЧТовары", ПараметрыУказанияСерий.ИмяТЧСерии = ПараметрыУказанияСерий.ИмяТЧТовары);
	Если Объект.Свойство("Ссылка") Тогда
		ПараметрыФормыУказанияСерий.Вставить("Регистратор",Объект.Ссылка);
	КонецЕсли;
	ПараметрыФормыУказанияСерий.Вставить("ПараметрыУказанияСерий",ПараметрыУказанияСерий);
	
	ЗначенияПолейДляОпределенияРаспоряжения = НоменклатураКлиентСервер.ЗначенияПолейДляОпределенияРаспоряжения(Объект,
																							  ТекущиеДанные,
																							  ПараметрыУказанияСерий);

	ПараметрыФормыУказанияСерий.Вставить("ЗначенияПолейДляОпределенияРаспоряжения", ЗначенияПолейДляОпределенияРаспоряжения);
	
	Если РегистрироватьСерии Тогда
		текИмяФормы = "Обработка.ПодборСерийВДокументы.Форма.РегистрацияИПодборСерийПоОднойСтрокеТоваров";
	Иначе
		текИмяФормы = "Обработка.ПодборСерийВДокументы.Форма.ПодборСерийПоОстаткамДляВсехСтрокТоваров";
	КонецЕсли;
	
	ПараметрыФормыУказанияСерий.Вставить("ИмяФормы", текИмяФормы);
	
	Если ЗначениеЗаполнено(ЗаголовокКолонкиКоличество) Тогда
		ПараметрыФормыУказанияСерий.Вставить("ЗаголовокКолонкиКоличество", ЗаголовокКолонкиКоличество);
	КонецЕсли;
	
	Возврат ПараметрыФормыУказанияСерий;
	
КонецФункции

Процедура ОкруглитьКоличествоШтучныхТоваров(Объект, РежимЗаписи = Неопределено, ПараметрыОкругления = Неопределено) Экспорт
	
	Если РежимЗаписи <> Неопределено
		И РежимЗаписи <> РежимЗаписиДокумента.Проведение
		И ТипЗнч(РежимЗаписи) = Тип("РежимЗаписиДокумента")
		И Объект.Метаданные().Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ПараметрыОкругления = Неопределено Тогда
		ПараметрыОкругления = НоменклатураСервер.ПараметрыОкругленияКоличестваШтучныхТоваров();
	КонецЕсли;
	
	ИмяТЧ = ПараметрыОкругления.ИмяТЧ;
	ИмяПоляКоличествоСуффикс = ПараметрыОкругления.ИмяПоляКоличествоСуффикс;
	УсловиеОтбораСтрокПоДополнительнымПолям = ПараметрыОкругления.УсловиеОтбораСтрокПоДополнительнымПолям;
	УсловиеОтбораСтрокДляОкругления = ПараметрыОкругления.УсловиеОтбораСтрокДляОкругления;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТЧ.НомерСтроки КАК НомерСтроки,
	|	ТЧ.Номенклатура КАК Номенклатура,
	|	ТЧ.Упаковка,
	|	ВЫРАЗИТЬ(ТЧ.Количество КАК ЧИСЛО(15, 0)) КАК КоличествоОкругленное,
	|	ВЫРАЗИТЬ(&ИмяПоляКоличествоСуффикс КАК ЧИСЛО(15, 0)) КАК КоличествоСуффиксОкругленное,
	|	&ДополнительныеПоля
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ТЧ КАК ТЧ
	|ГДЕ
	|	ТЧ.Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|	И (ТЧ.Количество <> (ВЫРАЗИТЬ(ТЧ.Количество КАК ЧИСЛО(15, 0)))
	|			ИЛИ &ИмяПоляКоличествоСуффикс <> (ВЫРАЗИТЬ(&ИмяПоляКоличествоСуффикс КАК ЧИСЛО(15, 0))))
	|	И (&УсловиеОтбораСтрокДляОкругления)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЧ.НомерСтроки КАК НомерСтроки,
	|	ТЧ.КоличествоОкругленное КАК КоличествоОкругленное,
	|	ТЧ.КоличествоСуффиксОкругленное КАК КоличествоСуффиксОкругленное
	|ИЗ
	|	ВТ КАК ТЧ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК ТНоменклатура
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК ТУпаковкиЕдиницыХранения
	|			ПО (ТУпаковкиЕдиницыХранения.Ссылка = ТНоменклатура.ЕдиницаИзмерения)
	|				И (ТУпаковкиЕдиницыХранения.ТипИзмеряемойВеличины = &ШтучныйТип)
	|		ПО (ТНоменклатура.Ссылка = ТЧ.Номенклатура)
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК ТУпаковкиТЧ
	|		ПО (ТУпаковкиТЧ.Ссылка = ТЧ.Упаковка)
	|			И (ТУпаковкиТЧ.ТипИзмеряемойВеличины В (&МерныеТипы))
	|ГДЕ
	|	&УсловиеОтбораСтрокПоДополнительнымПолям";
	
	Если ЗначениеЗаполнено(ИмяПоляКоличествоСуффикс) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяПоляКоличествоСуффикс", "ТЧ." + ИмяПоляКоличествоСуффикс);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяПоляКоличествоСуффикс", "0");
	КонецЕсли;
	
	Если УсловиеОтбораСтрокДляОкругления <> "" Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
									"&УсловиеОтбораСтрокДляОкругления",
									СтрЗаменить(УсловиеОтбораСтрокДляОкругления, ИмяТЧ + ".", "ТЧ."));
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеОтбораСтрокДляОкругления", "ИСТИНА");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыОкругления.ДополнительныеПоля) Тогда
		Шаблон = "%1 КАК %2,
					|%3";
		ТекстПолей = Шаблон;
		
		Для каждого Поле Из ПараметрыОкругления.ДополнительныеПоля Цикл
			ТекстПолей = СтрШаблон(ТекстПолей, СтрЗаменить(Поле.Значение, ИмяТЧ + ".", "ТЧ."), Поле.Ключ, Шаблон);
		КонецЦикла;
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
									"&ДополнительныеПоля", 
									Сред(ТекстПолей, 1, СтрНайти(ТекстПолей, ",", НаправлениеПоиска.СКонца,, 2) - 1));
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ДополнительныеПоля", "ИСТИНА");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(УсловиеОтбораСтрокПоДополнительнымПолям) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
									"&УсловиеОтбораСтрокПоДополнительнымПолям",
									СтрЗаменить(УсловиеОтбораСтрокПоДополнительнымПолям, ИмяТЧ + ".", "ТЧ."));
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеОтбораСтрокПоДополнительнымПолям", "ИСТИНА");	
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
		
	Если ИмяТЧ = "Объект" Тогда
		Таблица = Новый ТаблицаЗначений;
		Таблица.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(5,0,ДопустимыйЗнак.Неотрицательный)));
		Таблица.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		Таблица.Колонки.Добавить("Упаковка", Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
		Таблица.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3,ДопустимыйЗнак.Неотрицательный)));
		
		СтрокаТаблицы = Таблица.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Объект);
		
		Запрос.УстановитьПараметр("ТЧ", Таблица);
	Иначе
		Запрос.УстановитьПараметр("ТЧ", ОбщегоНазначенияУТ.МассивВТаблицуЗначений(Объект[ИмяТЧ]));
	КонецЕсли;
	
	Для Каждого ПараметрЗапроса Из ПараметрыОкругления.ПараметрыЗапроса Цикл
		Запрос.УстановитьПараметр(ПараметрЗапроса.Ключ, ПараметрЗапроса.Значение);
	КонецЦикла;
	
	МерныеТипы = Новый Массив;
	МерныеТипы.Добавить(Перечисления.ТипыИзмеряемыхВеличин.Вес);
	МерныеТипы.Добавить(Перечисления.ТипыИзмеряемыхВеличин.Объем);
	МерныеТипы.Добавить(Перечисления.ТипыИзмеряемыхВеличин.Площадь);
	МерныеТипы.Добавить(Перечисления.ТипыИзмеряемыхВеличин.Длина);
	
	Запрос.УстановитьПараметр("МерныеТипы", МерныеТипы);
	Запрос.УстановитьПараметр("ШтучныйТип", Перечисления.ТипыИзмеряемыхВеличин.КоличествоШтук);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ИмяТЧ = "Объект" Тогда
			Объект.Количество = Выборка.КоличествоОкругленное;
			Если ЗначениеЗаполнено(ИмяПоляКоличествоСуффикс) Тогда
				Объект[ИмяПоляКоличествоСуффикс] = Выборка.КоличествоСуффиксОкругленное;
			КонецЕсли;
		Иначе
			Объект[ИмяТЧ][Выборка.НомерСтроки - 1].Количество = Выборка.КоличествоОкругленное;
			Если ЗначениеЗаполнено(ИмяПоляКоличествоСуффикс) Тогда
				Объект[ИмяТЧ][Выборка.НомерСтроки - 1][ИмяПоляКоличествоСуффикс] = Выборка.КоличествоСуффиксОкругленное;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Сохранение_результата_подбора_серии

&НаКлиенте
Процедура ОткрытьПодборСерийЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	ТекущийЭтапОбъект = Неопределено;
	Если РезультатЗакрытия <> Неопределено Тогда
	
		ОбработатьУказаниеСерийСервер(
				ДополнительныеПараметры.ПараметрыУказанияСерий, 
				ДополнительныеПараметры.ПараметрыФормыУказанияСерий,
				ТекущийЭтапОбъект);
		
		//ТоварыСерияПересчитатьЦены(, ДополнительныеПараметры.ПараметрыУказанияСерий.ИмяТЧТовары);
		ПроставитьТекущийЭтапОбъект(ДополнительныеПараметры.СтрокаТЧ.ЭтапПроизводства,ТекущийЭтапОбъект);
		ОбработатьВыбранныеСтроки(ТекущееИмяКоманды);
	Иначе//Пользователь закрыл окно указания серий, не указав серии
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Закрыто окно указания серий, выполнение обработки прервано";
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьУказаниеСерийСервер(Знач ПараметрыУказанияСерий, Знач ПараметрыФормыУказанияСерий, ТекущийЭтапОбъект)
	
	ТекущийЭтапОбъект = ПараметрыФормыУказанияСерий.Регистратор.Ссылка.ПолучитьОбъект();
	ПараметрыРаспределенияЗатрат = Новый ФиксированнаяСтруктура(Документы.ЭтапПроизводства2_2.ПараметрыРаспределенияЗатрат(ТекущийЭтапОбъект));
	
	СтруктураДействий = Новый Структура;
	Если ПараметрыУказанияСерий.ИмяТЧТовары = "ВыходныеИзделия"
		ИЛИ ПараметрыУказанияСерий.ИмяТЧТовары = "ПобочныеИзделия"
		ИЛИ ПараметрыУказанияСерий.ИмяТЧТовары = "ЭкономияМатериалов" Тогда
		СтруктураДействий.Вставить("ОбновлятьКоличествоТоваровПриРегистрацииСерий", Истина);
		ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(ПараметрыУказанияСерий.ИмяТЧТовары, ЭтаФорма, СтруктураДействий, ПараметрыРаспределенияЗатрат);
	КонецЕсли;
	
	НоменклатураСервер.ОбработатьУказаниеСерий(
		ТекущийЭтапОбъект, 
		ПараметрыУказанияСерий, 
		ПараметрыФормыУказанияСерий, 
		СтруктураДействий);
		
	//ПослеИзмененияСтрокТЧПрограммноНаСервере(ПараметрыУказанияСерий.ИмяТЧТовары,, СтруктураДействий);
	ТекущийЭтапОбъект = ПолучитьДанныеОбъекта(ПараметрыФормыУказанияСерий.Регистратор.Ссылка,ТекущийЭтапОбъект);//Объект ТекущийЭтапОбъект преобразуем в структуру
	//Если ТекущееИмяКоманды = "УказатьСерии" Тогда
	//	ТекущийЭтапОбъект.Записать(РежимЗаписиДокумента.Проведение);//удалить комментарий
	//Иначе
	//	ТекущийЭтапОбъект.Записать(РежимЗаписиДокумента.Запись);//Потом ещё будет выпуск отражён, после чего документ будет проведен//удалить комментарий
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(ИмяТЧ, Форма, СтруктураДействий, ПараметрыРаспределенияЗатрат)
	
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц", ПроизводствоКлиентСервер.ПараметрыПересчетаКоличестваЕдиниц());
	
	//Если ИмяТЧ = "ПобочныеИзделия"
	//	ИЛИ (ИмяТЧ = "ВыходныеИзделия" И Форма.ИспользоватьПлановуюСтоимость) Тогда
	//	СтруктураДействий.Вставить("ПересчитатьСумму");
	//КонецЕсли;
	
	Если ИмяТЧ = "ВыходныеИзделия" Тогда
		СтруктураДействий.Вставить("ПересчитатьДолюСтоимости", ПараметрыРаспределенияЗатрат);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область Обработчики_отражения_выпуска

&НаСервере
Процедура ЗавершитьПроизводство(СтруктураСтроки,ТекущийЭтапОбъект)
	
	Для каждого СтрокаТЧ Из ТекущийЭтапОбъект.ВыходныеИзделия Цикл
		Если СтрокаТЧ.НомерСтроки = СтруктураСтроки.НомерСтрокиВыпуска Тогда
			СтрокаТЧ.Количество			= СтруктураСтроки.КоличествоФакт;
			СтрокаТЧ.КоличествоУпаковок	= СтруктураСтроки.КоличествоФакт;
			СтрокаТЧ.Произведено		= Истина;
			СтрокаТЧ.Отменено			= Ложь;
			СтрокаТЧ.ДатаПроизводства	= ТекущаяДата();
		Иначе//Для остальных строк тоже завершим производство, не меняя количества
			СтрокаТЧ.Произведено		= Истина;
			СтрокаТЧ.Отменено			= Ложь;
			СтрокаТЧ.ДатаПроизводства	= ТекущаяДата();
		КонецЕсли;
	КонецЦикла;
	
	Для каждого СтрокаТЧ Из ТекущийЭтапОбъект.ПобочныеИзделия Цикл
		СтрокаТЧ.Произведено		= Истина;
		СтрокаТЧ.Отменено			= Ложь;
		СтрокаТЧ.ДатаПроизводства	= ТекущаяДата();
	КонецЦикла;
	
	ПроставитьТекущийЭтапОбъект(СтруктураСтроки.ЭтапПроизводства,ТекущийЭтапОбъект);
	//ОбработатьВыбранныеСтроки(ТекущееИмяКоманды);
	
КонецПроцедуры

&НаСервере
Процедура ОтменитьПроизводство(СтруктураСтроки,ТекущийЭтапОбъект)
	//Сценарий "Отменено"
	Для каждого СтрокаТЧ Из ТекущийЭтапОбъект.ВыходныеИзделия Цикл
		Если СтрокаТЧ.НомерСтроки <> СтруктураСтроки.НомерСтрокиВыпуска Тогда
			Продолжить;
		КонецЕсли;
		СтрокаТЧ.Количество			= 0;
		СтрокаТЧ.КоличествоУпаковок	= 0;
		СтрокаТЧ.Произведено		= Ложь;
		СтрокаТЧ.Отменено			= Истина;
		СтрокаТЧ.ДатаПроизводства	= Дата(1,1,1);
	КонецЦикла;
	
	ПроставитьТекущийЭтапОбъект(СтруктураСтроки.ЭтапПроизводства,ТекущийЭтапОбъект);
	//ОбработатьВыбранныеСтроки(ТекущееИмяКоманды);
	
КонецПроцедуры

&НаСервере
Процедура СтартоватьНовыйЭтап(СтруктураСтроки,ТекущийЭтапОбъект=Неопределено)
	
	ПроставитьТекущийЭтапОбъект(СтруктураСтроки.ЭтапПроизводства,ТекущийЭтапОбъект,Истина);
	
КонецПроцедуры

&НаКлиенте 
Процедура ОбработатьВыборЗакрытияЭтапа(Результат, Параметры)Экспорт
	
	СтруктураСтроки = СоздатьСтруктуруСтроки();
	ЗаполнитьЗначенияСвойств(СтруктураСтроки,Параметры.СтрокаТЧ);
	
	Если Результат = КодВозвратаДиалога.Да Тогда//Завершить
		ЗавершитьПроизводство(СтруктураСтроки,?(ТипЗнч(Параметры.СтрокаТЧ.ТекущийЭтапОбъект)=Тип("Структура"),Параметры.СтрокаТЧ.ТекущийЭтапОбъект,
								ПолучитьДанныеОбъекта(Параметры.СтрокаТЧ.ЭтапПроизводства)));
	Иначе//Данный этап завершить и начать следующий
		ЗавершитьПроизводство(СтруктураСтроки,?(ТипЗнч(Параметры.СтрокаТЧ.ТекущийЭтапОбъект)=Тип("Структура"),Параметры.СтрокаТЧ.ТекущийЭтапОбъект,
								ПолучитьДанныеОбъекта(Параметры.СтрокаТЧ.ЭтапПроизводства)));
		СтартоватьНовыйЭтап(СтруктураСтроки,?(ТипЗнч(Параметры.СтрокаТЧ.ТекущийЭтапОбъект)=Тип("Структура"),Параметры.СтрокаТЧ.ТекущийЭтапОбъект,
								ПолучитьДанныеОбъекта(Параметры.СтрокаТЧ.ЭтапПроизводства)));//На количество недопроизведенной продукции
	КонецЕсли;
	
	//Параметры.СтрокаТЧ.СтрокаОбработана	= Истина;
	Параметры.СтрокаТЧ.Выбор			= Ложь;
	ОбработатьВыбранныеСтроки(ТекущееИмяКоманды);
	
КонецПроцедуры

Функция СоздатьСтруктуруСтроки()
	Возврат Новый Структура("ЭтапПроизводства,НомерСтрокиВыпуска,ТекущийЭтапОбъект,КоличествоФакт");
КонецФункции

#КонецОбласти

//Проставление реквизита ТекущийЭтапОбъект в ТЗ ТаблицаПроизводства для выбранных строк с указанной ссылкой
// Параметры:
//  СсылкаНаОбъект - ссылка на документ ЭтапПроизводства2_2
Процедура ПроставитьТекущийЭтапОбъект(СсылкаНаОбъект,ТекущийЭтапОбъект,СтартоватьНовыйЭтап=Ложь)
	
	Для каждого СтрокаТЧ Из ТаблицаПроизводства Цикл
		Если Не СтрокаТЧ.Выбор Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаТЧ.ЭтапПроизводства = СсылкаНаОбъект Тогда
			СтрокаТЧ.ТекущийЭтапОбъект		= ТекущийЭтапОбъект;
			СтрокаТЧ.СтартоватьНовыйЭтап	= СтартоватьНовыйЭтап;
			ОбновитьКоличествоФакт(СтрокаТЧ,ТекущийЭтапОбъект);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПроизводстваЗавершитьЭтапПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТаблицаПроизводства.ТекущиеДанные;
	
	Если Не ТекущаяСтрока.Выбор Тогда//Без флага Выбор не даём менять флаг ЗавершитьЭтап
		ТекущаяСтрока.ЗавершитьЭтап = Не ТекущаяСтрока.ЗавершитьЭтап;
		Возврат;
	КонецЕсли;
	
	Если Не ТекущаяСтрока.ЗавершитьЭтап Тогда
		Возврат;//Этап завершается, когда ставим галку, иначе никаких действий не производим
	КонецЕсли;
	
	ИдентификаторСтроки = Новый Структура("ПроверятьИдентификатор,ИдентификаторСтроки",
										Истина,ТекущаяСтрока.ПолучитьИдентификатор());
	
	ТекущееИмяКоманды = "ОтразитьВыпуск";
	ОбработатьВыбранныеСтроки("ОтразитьВыпуск");
	
КонецПроцедуры

//Если отражение производства необходимо для одной конкретной строки (обработка флага завершения производства)
//то программа запоминает идентификатор данной строки. При обоходе ТЧ будут игнорироваться все строки
//кроме строки с необходимым идентификатором
&НаКлиенте 
Функция ИдентификаторСтрокиПодходит(текИдентификатор)
	
	ИдентификаторПодходит = Истина;
	Если ТипЗнч(ИдентификаторСтроки) = Тип("Структура") 
		И ИдентификаторСтроки.Свойство("ПроверятьИдентификатор")
		И ИдентификаторСтроки.Свойство("ИдентификаторСтроки")
		И ИдентификаторСтроки.ПроверятьИдентификатор = Истина
		И ИдентификаторСтроки.ИдентификаторСтроки <> текИдентификатор Тогда
		ИдентификаторПодходит = Ложь;
	КонецЕсли;
	
	Возврат ИдентификаторПодходит;
	
КонецФункции

&НаСервере
Процедура ЗаписатьИзмененныеЭтапыПроизводства()
	
	УстановитьПривилегированныйРежим(Истина);
	//Временно снимем ограничение, чтобы не мешало создавать новые этапы при необходимости
	Константы.ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров.Установить(0);
	
	ВремТЗ = ТаблицаПроизводства.Выгрузить();
	ВремТЗ.Свернуть("Выбор,Заказ,ЭтапПроизводства,СтрокаОбработана,ТекущийЭтапОбъект,СтартоватьНовыйЭтап");//Группировка по этапу производства, чтобы записать его 1 раз
	
	Для каждого СтрокаТЗ Из ВремТЗ Цикл
		Если ТипЗнч(СтрокаТЗ.ТекущийЭтапОбъект) = Тип("Структура") Тогда
			//Проведение обработанных документов
			//В структуре содержится описание измененного документа, его надо записать как объект
			ТекущийЭтапОбъект = СтрокаТЗ.ЭтапПроизводства.ПолучитьОбъект();
			ПерезаполнитьТЧОбъекта(СтрокаТЗ.ТекущийЭтапОбъект,ТекущийЭтапОбъект);
			ТекущийЭтапОбъект.ФактическоеНачалоЭтапа	= ?(ЗначениеЗаполнено(ТекущийЭтапОбъект.ФактическоеНачалоЭтапа),ТекущийЭтапОбъект.ФактическоеНачалоЭтапа,ТекущаяДата());
			ТекущийЭтапОбъект.ФактическоеОкончаниеЭтапа	= ТекущаяДата();
			ТекущийЭтапОбъект.Статус					= Перечисления.СтатусыЭтаповПроизводства2_2.Завершен;
			
			Попытка
				ТекущийЭтапОбъект.Записать(РежимЗаписиДокумента.Проведение);
				ЭтапПроведен = Истина;
			Исключение
				ЭтапПроведен = Ложь;
				ТекстОшибкиПроведения = "Ошибка проведения этапа производства: " 
										+ ТекущийЭтапОбъект.Ссылка;
				
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Выполнение операции'"),
					УровеньЖурналаРегистрации.Ошибка,,ТекущийЭтапОбъект.Ссылка,
					ТекстОшибкиПроведения + ". " + ИнформацияОбОшибке());
			КонецПопытки;
			
			Если СтрокаТЗ.СтартоватьНовыйЭтап И ЭтапПроведен Тогда//Прошлых этап недопроизвели, стартуем новый на остаток недопроизвенного
				Распоряжения = Новый Массив;
				Распоряжения.Добавить(СтрокаТЗ.Заказ);
				ПараметрыПроцедуры = Новый Структура("ЗаменятьМатериалыНаАналоги,
													| ЗаменятьПФНаАналоги,
													| ПередатьЭтапыКВыполнению,
													| ПриРасчетеГрафикаЗадействоватьРезерв,
													| Распоряжения,
													| РассчитатьГрафик,
													| РезервироватьМатериалы,
													| РезервироватьПФ,
													| ДоступныеРезервыВГрафике",			//Не всегда спрашивает этот параметр, не ясно, для чего он
													Ложь,Ложь,Истина,Ложь,Распоряжения,Истина,Ложь,Ложь,Неопределено);
				Адрес = ПоместитьВоВременноеХранилище(0, УникальныйИдентификатор);
				Документы.ЭтапПроизводства2_2.СформироватьЭтапы(ПараметрыПроцедуры,Адрес);
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Создан новый этап производства для: " + СтрокаТЗ.Заказ;
				Сообщение.Сообщить();
			КонецЕсли;
			
			//Обработка ТЧ ТаблицаПроизводства
			ПараметрыОтбора = Новый Структура("Выбор,Заказ,ЭтапПроизводства,СтрокаОбработана,ТекущийЭтапОбъект,СтартоватьНовыйЭтап");
			ЗаполнитьЗначенияСвойств(ПараметрыОтбора,СтрокаТЗ);
			МассивСтрок = ТаблицаПроизводства.НайтиСтроки(ПараметрыОтбора);
			Для каждого СтрокаТЧ Из МассивСтрок Цикл
				Если ТипЗнч(СтрокаТЗ.ТекущийЭтапОбъект) = Тип("Структура") Тогда
					Если ЭтапПроведен Тогда
						СтрокаТЧ.СтрокаОбработана	= Истина;
					Иначе
						СтрокаТЧ.СтрокаОбработана	= Ложь;
						СтрокаТЧ.Выбор				= Истина;
						Сообщение = Новый СообщениеПользователю;
						Сообщение.Текст = ТекстОшибкиПроведения;
						Сообщение.Поле = "ТаблицаПроизводства[" + СтрокаТЧ.ПолучитьИдентификатор() + "].Выбор";
						Сообщение.Сообщить();
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	//Вернем значение константы как было
	Константы.ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров.Установить(ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров);
	
	//Сброс идентификатора
	ИдентификаторСтроки = Новый Структура("ПроверятьИдентификатор,ИдентификаторСтроки",Ложь,0);
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьТЧОбъекта(Структура,ТекущийЭтапОбъект)
	
	ТекущийЭтапОбъект.ВыходныеИзделия.Очистить();
	ТекущийЭтапОбъект.ВыходныеИзделияСерии.Очистить();
	ТекущийЭтапОбъект.ПобочныеИзделия.Очистить();
	
	ТекДата = ТекущаяДата();
	
	//ТЧ ВыходныеИзделия
	Для каждого СтрокаТЧ Из Структура.ВыходныеИзделия Цикл
		НоваяСтрока = ТекущийЭтапОбъект.ВыходныеИзделия.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТЧ);
	КонецЦикла;
	
	//ТЧ ВыходныеИзделияСерии
	//СтруктураПоиска = Новый Структура("НомерСтроки");
	Для каждого СтрокаТЧ Из Структура.ВыходныеИзделияСерии Цикл
		НоваяСтрока = ТекущийЭтапОбъект.ВыходныеИзделияСерии.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТЧ);
		//СтруктураПоиска.НомерСтроки = СтрокаТЧ.НомерСтроки;
		//НайденныеСтроки = ТекущийЭтапОбъект.ВыходныеИзделия.НайтиСтроки(СтруктураПоиска);
		//Если НайденныеСтроки.Количество() <> 0 Тогда
		//	НоваяСтрока.Произведено			= НайденныеСтроки[0].Произведено;
		//	НоваяСтрока.Отменено			= НайденныеСтроки[0].Отменено;
		//	НоваяСтрока.ДатаПроизводства	= НайденныеСтроки[0].ДатаПроизводства;
		//КонецЕсли;
		НоваяСтрока.Произведено			= Истина;
		НоваяСтрока.Отменено			= Ложь;
		НоваяСтрока.ДатаПроизводства	= ТекДата;
	КонецЦикла;
	
	//ТЧ ПобочныеИзделия
	ТЗНормыПобочныхИзделий = НормаПобочныхИзделийПоСпецификации(ТекущийЭтапОбъект.Спецификация);
	СтруктураПоиска = Новый Структура("Номенклатура");
	Для каждого СтрокаТЧ Из Структура.ПобочныеИзделия Цикл
		НоваяСтрока = ТекущийЭтапОбъект.ПобочныеИзделия.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТЧ);
		СтруктураПоиска.Номенклатура = СтрокаТЧ.Номенклатура;
		НайденныеСтроки = ТЗНормыПобочныхИзделий.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() > 0 
			И НайденныеСтроки[0].ОсновноеИзделиеКоличествоУпаковок <> 0 Тогда
			НоваяСтрока.Количество = ТекущийЭтапОбъект.ВыходныеИзделия.Итог("Количество")
									* НайденныеСтроки[0].КоличествоУпаковок
									/ НайденныеСтроки[0].ОсновноеИзделиеКоличествоУпаковок;
			НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество;
		КонецЕсли;
	КонецЦикла;
	
	//Вкладка Основное
	ПересчитатьОбеспечение = Ложь;
	Если ТекущийЭтапОбъект.КоличествоУпаковокФакт <> ТекущийЭтапОбъект.ВыходныеИзделия.Итог("Количество") Тогда
		ПересчитатьОбеспечение = Истина;
	КонецЕсли;
	ТекущийЭтапОбъект.КоличествоУпаковокФакт		= ТекущийЭтапОбъект.ВыходныеИзделия.Итог("Количество");
	// <+БИТ> Руденков_Е.И. 25.10.2024  
	// Пересчет норм по ресурсной спецификации
	//ТекущийЭтапОбъект.КоличествоУпаковокОтменено	= ТекущийЭтапОбъект.КоличествоУпаковокПлан - ТекущийЭтапОбъект.КоличествоУпаковокФакт;
	ТекущийЭтапОбъект.КоличествоУпаковокПлан = ТекущийЭтапОбъект.КоличествоУпаковокФакт;//Уравниваем план с фактом, т.к. при открытии этапа Нормативы заполняются на основании плана.
	// <-БИТ> Руденков_Е.И. 25.10.2024
	ДанныеПартииПроизводства = Документы.ЭтапПроизводства2_2.ДанныеПартииПроизводства(ТекущийЭтапОбъект.Распоряжение,ТекущийЭтапОбъект.НазначениеПродукция,ТекущийЭтапОбъект.ПартияПроизводства);
	ЗаполнитьНормативы("ОбеспечениеМатериаламиИРаботами",,ТекущийЭтапОбъект);
	ЗаполнитьНормативы("Трудозатраты",,ТекущийЭтапОбъект);
	
	#Область ТЧ_ОбеспечениеМатериаламиИРаботами
	СтандартнаяПричинаОтмены = ПолучитьСтандартнуюПричинуОтмены();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ПолучитьТабФильтр(Запрос,ТекущийЭтапОбъект.Ссылка);//в конкретном этапе производства получаем данные ТЧ ОбеспечениеМатериаламиИРаботами (Склад, Номенклатура, Характеристика, Назначение без колчичества, помещаем в ВТ ТабФильтр)
	Запрос.Текст = ОбеспечениеВДокументахСервер.ВременнаяТаблицаСвободныеОстатки("ТабФильтр",
																		"ТабРезультат",Ложь);
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"ПОМЕСТИТЬ ТабРезультат","");
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"ИНДЕКСИРОВАТЬ ПО","");
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"Номенклатура, Характеристика, Склад, Назначение","");
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"()","(Номенклатура, Характеристика, Склад, Назначение)");
	//Запрос.Текст = СтрЗаменить(Запрос.Текст,"Фильтр.Склад КАК Склад,","");
	
	Результат			= Запрос.Выполнить();
	ОбеспечениеОстатки	= Результат.Выгрузить();//Получили остатки номенклатуры из ТЧ ОбеспечениеМатериаламиИРаботами
	ОбеспечениеОстатки.Свернуть("Номенклатура,Характеристика,Склад,Назначение","Количество");
	СтруктураПоиска = Новый Структура("Номенклатура,Характеристика,Склад,Назначение");
	Для каждого СтрокаТЧ Из ТекущийЭтапОбъект.ОбеспечениеМатериаламиИРаботами Цикл
		ЗаполнитьЗначенияСвойств(СтруктураПоиска,СтрокаТЧ);
		
		//ТЗ сгруппирована, поэтому будет найдено не более 1-й строки
		СтрокиОстатков = ОбеспечениеОстатки.НайтиСтроки(СтруктураПоиска);
		Если СтрокиОстатков.Количество() > 0 
			И СтрокиОстатков[0].Количество >= СтрокаТЧ.КоличествоУпаковок Тогда
			СтрокаТЧ.ВариантОбеспечения		= Перечисления.ВариантыОбеспечения.Отгрузить;
			СтрокиОстатков[0].Количество	= СтрокиОстатков[0].Количество - СтрокаТЧ.КоличествоУпаковок;
		Иначе
			СтрокаТЧ.ВариантОбеспечения	= Перечисления.ВариантыОбеспечения.Отгрузить;
			СтрокаТЧ.Отменено			= Истина;
			СтрокаТЧ.ПричинаОтмены		= СтандартнаяПричинаОтмены;
		КонецЕсли;
	КонецЦикла;
	#КонецОбласти
	
	// <+БИТ> Руденков_Е.И. 28.10.2024  
	// Пересчет норм по ресурсной спецификации
	//ТЧ Трудозатраты
	РеквизитыПодразделения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекущийЭтапОбъект.Подразделение,"КАНАТ_ИсполнительРабот");
	Для каждого СтрокаТЧ Из ТекущийЭтапОбъект.Трудозатраты Цикл
		СтрокаТЧ.Выполнено		= Истина;
		СтрокаТЧ.Отменено		= Ложь;
		СтрокаТЧ.ДатаВыполнения	= ТекДата;
		СтрокаТЧ.Исполнитель	= РеквизитыПодразделения.КАНАТ_ИсполнительРабот;
	КонецЦикла;
	// <-БИТ> Руденков_Е.И. 28.10.2024
	
	//ТЧ РасходМатериаловИРабот
	Документы.ЭтапПроизводства2_2.ЗаполнитьРасходМатериаловИРаботПоДаннымОбеспечения(ТекущийЭтапОбъект);
	
КонецПроцедуры 

//В ТЗ ТаблицаПроизводства обновляет поле КоличествоФакт в соответствии 
//с количесвом заданным на форме выбора серий
Процедура ОбновитьКоличествоФакт(СтрокаТЧ,ТекущийЭтапОбъект)
	
	Для каждого СтрокаИзделий Из ТекущийЭтапОбъект.ВыходныеИзделия Цикл
		Если СтрокаИзделий.НомерСтроки = СтрокаТЧ.НомерСтрокиВыпуска Тогда
			СтрокаТЧ.КоличествоФакт = СтрокаИзделий.Количество;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьТабФильтр(Запрос,ЭтапПроизводстваСсылка)
	//ПривилегированныйРежим()
	Запрос.Текст = "ВЫБРАТЬ
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Склад КАК Склад,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура КАК Номенклатура,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Характеристика КАК Характеристика,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Назначение КАК Назначение
	|ПОМЕСТИТЬ ТабФильтр
	|ИЗ
	|	Документ.ЭтапПроизводства2_2.ОбеспечениеМатериаламиИРаботами КАК ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами
	|ГДЕ
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабФильтр.Склад КАК Склад,
	|	ТабФильтр.Номенклатура КАК Номенклатура,
	|	ТабФильтр.Характеристика КАК Характеристика,
	|	ТабФильтр.Назначение КАК Назначение
	|ИЗ
	|	ТабФильтр КАК ТабФильтр";
	
	Запрос.УстановитьПараметр("Ссылка",ЭтапПроизводстваСсылка);
	Результат = Запрос.Выполнить();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтандартнуюПричинуОтмены()
	//ПривилегированныйРежим()
	СтандартнаяПричинаОтмены = Справочники.ПричиныОтменыПроизводства.НайтиПоНаименованию("АРМ отражение факта выпуска");
	Если СтандартнаяПричинаОтмены = Неопределено
		Или СтандартнаяПричинаОтмены = Справочники.ПричиныОтменыПроизводства.ПустаяСсылка() Тогда
		СтандартнаяПричинаОтмены = Справочники.ПричиныОтменыПроизводства.ПустаяСсылка();
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПричиныОтменыПроизводства.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ПричиныОтменыПроизводства КАК ПричиныОтменыПроизводства
		|ГДЕ
		|	НЕ ПричиныОтменыПроизводства.ПометкаУдаления";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			СтандартнаяПричинаОтмены = Выборка.Ссылка;
		КонецЦикла;
	КонецЕсли;
	
	Возврат СтандартнаяПричинаОтмены;
	
КонецФункции 

&НаКлиенте
Процедура ОбновитьТаблицуПроизводства(Команда)
	ОбновитьДанныеТаблицаПроизводства();
КонецПроцедуры // <-БИТ> Руденков_Е.И. 14.03.2024

#Область Пересчет_нормативов

&НаСервере
Процедура ЗаполнитьНормативы(ИмяТЧ, СтрокиЗаполнения = Неопределено, ТекущийЭтапОбъект)
	
	ТребуетсяЗаполнить = Ложь;
	
	Если СтрокиЗаполнения <> Неопределено Тогда
		МассивСтрок = СтрокиЗаполнения;
	Иначе
		МассивСтрок = ТекущийЭтапОбъект[ИмяТЧ];
	КонецЕсли;
	
	Если ИмяТЧ = "ОбеспечениеМатериаламиИРаботами" Тогда
	
		МассивДанных = Новый Массив;
		Для каждого ТекущиеДанные Из МассивСтрок Цикл
			ДанныеСтроки = Новый Структура("Номенклатура,Характеристика,ХарактеристикиИспользуются,Упаковка");
			ЗаполнитьЗначенияСвойств(ДанныеСтроки, ТекущиеДанные);
			Если Не ЗначениеЗаполнено(ТекущиеДанные.Характеристика) Тогда//Адаптация
				ДанныеСтроки.ХарактеристикиИспользуются = Ложь;
			Иначе
				ДанныеСтроки.ХарактеристикиИспользуются = Истина;
			КонецЕсли;
			МассивДанных.Добавить(ДанныеСтроки);
		КонецЦикла;
		ТребуетсяЗаполнить = Истина;
		
	ИначеЕсли ИмяТЧ = "Трудозатраты" Тогда
		
		МассивДанных = Новый Массив;
		Для каждого ТекущиеДанные Из МассивСтрок Цикл
			ДанныеСтроки = Новый Структура("ВидРабот");
			ЗаполнитьЗначенияСвойств(ДанныеСтроки, ТекущиеДанные);
			МассивДанных.Добавить(ДанныеСтроки);
		КонецЦикла;
		ТребуетсяЗаполнить = Истина;
		
	КонецЕсли;
	
	Если ТребуетсяЗаполнить Тогда
		
		НормативыИзХранилища = ПолучитьНормативыИзВременногоХранилища(ТекущийЭтапОбъект);
		
		Нормативы = ПолучитьНормативыПриИзмененииСтрок(ИмяТЧ, МассивДанных, НормативыИзХранилища);
		Для Сч = 0 По МассивСтрок.Количество() - 1 Цикл
			//Адаптация
			//МассивСтрок[Сч].Норматив = Нормативы[Сч];
			МассивСтрок[Сч].Количество			= Нормативы[Сч];
			Если ИмяТЧ = "ОбеспечениеМатериаламиИРаботами" Тогда //БИТ_Байков - фикс. Вставляю проверку на то что это не ТЧ Трудозатраты
				МассивСтрок[Сч].КоличествоУпаковок	= Нормативы[Сч];
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНормативыИзВременногоХранилища(ТекущийЭтапОбъект)

	Если ЭтоАдресВременногоХранилища(АдресХранилищаНормативы) Тогда
		
		Результат = ПолучитьИзВременногоХранилища(АдресХранилищаНормативы);
		Возврат Результат;
		
	КонецЕсли;
	
	Результат = Новый Структура();
	
	ДанныеСпецификации = ПолучитьНормативыПоСпецификации(Истина, "МатериалыИУслуги,ВходящиеИзделия,Трудозатраты",ТекущийЭтапОбъект);
	
	Если ДанныеСпецификации <> Неопределено Тогда
		
		Таблица = ДанныеСпецификации.МатериалыИУслуги.Скопировать(, "Номенклатура,Характеристика,Упаковка,ДанныеУпаковки,КоличествоУпаковок"); // ТаблицаЗначений - 
		Таблица.Свернуть("Номенклатура,Характеристика,Упаковка,ДанныеУпаковки", "КоличествоУпаковок");
		Результат.Вставить("ОбеспечениеМатериаламиИРаботами", Таблица);
		
		Таблица = ДанныеСпецификации.Трудозатраты.Скопировать(, "ВидРабот,Количество"); // ТаблицаЗначений - 
		Таблица.Свернуть("ВидРабот", "Количество");
		Результат.Вставить("Трудозатраты", Таблица);
		
	КонецЕсли;
	
	АдресХранилищаНормативы = ПоместитьВоВременноеХранилище(Результат, УникальныйИдентификатор);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьНормативыПоСпецификации(ПолучатьМатериалыПоТребованию, Знач ПереченьДанных = Неопределено,ТекущийЭтапОбъект)
	
	ДанныеПартииПроизводстваКопия = ОбщегоНазначения.СкопироватьРекурсивно(ДанныеПартииПроизводства, Ложь);
	ДанныеПартииПроизводстваКопия.Количество = ТекущийЭтапОбъект.КоличествоУпаковокФакт;//Адоптация
	
	Возврат Документы.ЭтапПроизводства2_2.ПолучитьНормативыПоСпецификации(
		ДанныеПартииПроизводстваКопия,
		ПолучатьМатериалыПоТребованию,
		ПереченьДанных,
		Новый Структура("Этап", ТекущийЭтапОбъект.Этап));
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьНормативыПриИзмененииСтрок(Знач ИмяТЧ, Знач МассивДанных, Знач АдресИлиНормативы)
	
	Если ЭтоАдресВременногоХранилища(АдресИлиНормативы) Тогда
		НормативыИзХранилища = ПолучитьИзВременногоХранилища(АдресИлиНормативы);
	Иначе
		НормативыИзХранилища = АдресИлиНормативы;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НормативыИзХранилища) И НормативыИзХранилища.Свойство(ИмяТЧ) Тогда
		Нормативы = НормативыИзХранилища[ИмяТЧ];
	Иначе
		Нормативы = Неопределено;
	КонецЕсли;
	
	Если ИмяТЧ = "ОбеспечениеМатериаламиИРаботами" Тогда
		
		СтруктураПоиска = Новый Структура("Номенклатура,Характеристика");
		
		Результат = УправлениеПроизводством.ПолучитьНормативы(
			Нормативы,
			МассивДанных,
			СтруктураПоиска,
			Истина);
		
	ИначеЕсли ИмяТЧ = "Трудозатраты" Тогда
		
		СтруктураПоиска = Новый Структура("ВидРабот");
		
		Результат = УправлениеПроизводством.ПолучитьНормативы(
			Нормативы,
			МассивДанных,
			СтруктураПоиска,
			Ложь);
	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// <+БИТ> Руденков_Е.И. 18.11.2024  
// Пересчет норм по ресурсной спецификации
&НаСервере
Функция НормаПобочныхИзделийПоСпецификации(ТекСпецификация)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РесурсныеСпецификацииВозвратныеОтходы.Ссылка.ОсновноеИзделиеКоличествоУпаковок КАК ОсновноеИзделиеКоличествоУпаковок,
	|	РесурсныеСпецификацииВозвратныеОтходы.Номенклатура КАК Номенклатура,
	|	РесурсныеСпецификацииВозвратныеОтходы.Характеристика КАК Характеристика,
	|	РесурсныеСпецификацииВозвратныеОтходы.Упаковка КАК Упаковка,
	|	РесурсныеСпецификацииВозвратныеОтходы.КоличествоУпаковок КАК КоличествоУпаковок
	|ИЗ
	|	Справочник.РесурсныеСпецификации.ВозвратныеОтходы КАК РесурсныеСпецификацииВозвратныеОтходы
	|ГДЕ
	|	РесурсныеСпецификацииВозвратныеОтходы.Ссылка = &ТекСпецификация";
	
	Запрос.УстановитьПараметр("ТекСпецификация",ТекСпецификация);
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции // <-БИТ> Руденков_Е.И. 18.11.2024

#КонецОбласти

