//++Бит Трейгер П.М. 23.10.2024
&НаКлиенте
Процедура ПодобратьНоменклатуру(Команда)
    ПараметрыФормы = Новый Структура(
        "ЗакрыватьПриВыборе,МножественныйВыбор",
        Ложь,
        Истина
    );
    ОткрытьФорму(
        "Справочник.Номенклатура.ФормаВыбора",
        ПараметрыФормы,
        Элементы.Номенклатура
    );
КонецПроцедуры 

&НаКлиенте
Процедура НоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
массив = новый Массив;
Для каждого ВыбранныйЭлемент из ВыбранноеЗначение Цикл
новааястрока = Объект.Номенклатура.Добавить();
новааястрока.номенклатура = ВыбранныйЭлемент;
КонецЦикла;	
КонецПроцедуры


&НаСервере
процедура убратьДубли()
	
Если Объект.Спецификация = Справочники.РесурсныеСпецификации.ПустаяСсылка() или Объект.Номенклатура.Количество() = 0 Тогда
		Сообщить("Сначала выберите спецификацию и номенклатуру");
Иначе	
таб = Новый ТаблицаЗначений;
таб = Объект.Номенклатура.Выгрузить();
таб.Свернуть("номенклатура");
Объект.Номенклатура.Очистить();
Объект.Номенклатура.Загрузить(таб);



//Для каждого стр из таб  Цикл
//   новаяспеца = Справочники.РесурсныеСпецификации.СоздатьЭлемент();
//   новаяспеца.Заполнить(спец);
//   //новаяспеца.ОсновноеИзделиеНоменклатура = стр.номенклатура;
//   новаяспеца.Статус = Перечисления.СтатусыСпецификаций.ВРазработке;
//   новаяспеца.Записать();
//   
//   
//   //форма = новаяспеца.Ссылка.ПолучитьФорму("ФормаЭлемента");
//   //форма.ЭлементыФормы.ОсновноеИзделиеНоменклатура = стр.номенклатура;
//   //форма.заполнитьНовуюНоменклатуру();	
//КонецЦикла;
//КонецЕсли;
 КонецЕсли;

конецПроцедуры
&НаКлиенте
Процедура СоздатьСпецификации(Команда)
убратьДубли();
заполнитьСпецификации();

КонецПроцедуры
&НаСервере
процедура заполнитьспецификации()
	
	спец = Объект.Спецификация;
	Для каждого стр из  Объект.Номенклатура Цикл
		если стр.номенклатура = Справочники.Номенклатура.ПустаяСсылка() Тогда
			
		Иначе	
			Ссылка = УправлениеДаннымиОбИзделияхВызовСервера.КопироватьРесурснуюСпецификацию(спец);
			объектспец = Ссылка.ПолучитьОбъект();
			объектспец.Наименование = стр.номенклатура;
			объектспец.ОсновноеИзделиеНоменклатура = стр.номенклатура; 
			объектспец.ВыходныеИзделия[0].Номенклатура =стр.номенклатура;
			объектспец.Записать();	
		КонецЕсли; 
	КонецЦикла;	
конецпроцедуры
//--Бит Трейгер П.М. 23.10.2024


