//++ Гурьев 25.09.23 ЧТЗ_2.10
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Для Каждого Документ Из МассивОбъектов Цикл
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПропускНаВъезд") Тогда
			СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
				КоллекцияПечатныхФорм,
				"ПропускНаВъезд",
				"Пропуск на въезд",
				СформироватьПропускНаВъезд(Документ));
		КонецЕсли;
			
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПропускНаВыезд") Тогда
			СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
				КоллекцияПечатныхФорм,
				"ПропускНаВыезд",
				"Пропуск на выезд",
				СформироватьПропускНаВыезд(Документ));
		КонецЕсли;
	КонецЦикла;
	ФормированиеПечатныхФорм.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
	
КонецПроцедуры
//-- Гурьев 25.09.23

//++ Гурьев 25.09.23 ЧТЗ_2.10
Функция СформироватьПропускНаВъезд(Документ)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.КАНАТ_ПечатьПропускНаВъездВыезд.ПФ_MXL_ПечатьПропускНаВъезд");
	
	///Шапка
	ДанныеШапки = ПолучитьДанныеШапкиПропускНаВъезд(Документ);
	Если ДанныеШапки = Неопределено Тогда
		Возврат ТабличныйДокумент;
	КонецЕсли;
	
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	ОбластьШапка.Параметры.Заполнить(ДанныеШапки);
	ОбластьШапка.Параметры.Дата = Формат(ДанныеШапки.Дата, "ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.Номер = ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(ДанныеШапки.Номер);
	
	Если ДанныеШапки.СпособДоставки = Перечисления.СпособыДоставки.ДоКлиента
		ИЛИ ДанныеШапки.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу Тогда
		
		ОбластьШапка.Параметры.Водитель = ДанныеШапки.КАНАТ_ВодительСсылка;
		
	КонецЕсли;
	
		
	Если ДанныеШапки.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу Тогда
		
		ОбластьШапка.Параметры.СпособДоставки = СтрШаблон("%1, %2, %3",
														  ДанныеШапки.СпособДоставки,
														  ДанныеШапки.Перевозчик,
														  ДанныеШапки.АдресПеревозчика);
		
	КонецЕсли;
	
	//Если Не ЗначениеЗаполнено(ДанныеШапки.Грузополучатель) Тогда
	//	ОбластьШапка.Параметры.Грузополучатель = ДанныеШапки.Контрагент;
	//КонецЕсли;
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	//Таблица
	ОбластьТаблицаШапка = Макет.ПолучитьОбласть("ОбластьТаблицаШапка");
	ТабличныйДокумент.Вывести(ОбластьТаблицаШапка);
	
	ТаблицаИтого = Новый ТабличныйДокумент;
	
	ДанныеТаблицыВыборкаЕдИзм = ПолучитьДанныеТаблицыПропускНаВъезд(Документ);
	
	Сумма = 0;
	СуммаСНДС = 0;
	СуммаСоСкидкой = 0;
	
	Пока ДанныеТаблицыВыборкаЕдИзм.Следующий() Цикл
		
		ОбластьТаблицаИтогоСтрока = Макет.ПолучитьОбласть("ОбластьТаблицаИтогоСтрока");
		ОбластьТаблицаИтогоСтрока.Параметры.Заполнить(ДанныеТаблицыВыборкаЕдИзм);
		ТаблицаИтого.Вывести(ОбластьТаблицаИтогоСтрока);
		
		ВыборкаДетальныеЗаписи = ДанныеТаблицыВыборкаЕдИзм.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ОбластьТаблицаСтрока = Макет.ПолучитьОбласть("ОбластьТаблицаСтрока");
			ОбластьТаблицаСтрока.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
			
			ТабличныйДокумент.Вывести(ОбластьТаблицаСтрока);
			
			Сумма =     Сумма + ВыборкаДетальныеЗаписи.Количество * ВыборкаДетальныеЗаписи.Цена;
			СуммаСНДС = СуммаСНДС + ВыборкаДетальныеЗаписи.Количество * ВыборкаДетальныеЗаписи.ЦенаСНДС;
			СуммаСоСкидкой = СуммаСоСкидкой + ВыборкаДетальныеЗаписи.СуммаСоСкидкой;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ОбластьТаблицаИтогоШапка = Макет.ПолучитьОбласть("ОбластьТаблицаИтогоШапка");
	ТабличныйДокумент.Вывести(ОбластьТаблицаИтогоШапка);
	
	ТабличныйДокумент.Вывести(ТаблицаИтого);
	
	//Подвал
	ОбластьТаблицаПодвал = Макет.ПолучитьОбласть("ОбластьТаблицаПодвал");
	ОбластьТаблицаПодвал.Параметры.Сумма = Формат(Сумма, "ЧДЦ=2");
	ОбластьТаблицаПодвал.Параметры.СуммаНДС = Формат(СуммаСНДС - Сумма, "ЧДЦ=2");
	ОбластьТаблицаПодвал.Параметры.СуммаСНДС = Формат(СуммаСНДС, "ЧДЦ=2");
	ОбластьТаблицаПодвал.Параметры.СуммаСоСкидкой = Формат(СуммаСоСкидкой, "ЧДЦ=2");
	ТабличныйДокумент.Вывести(ОбластьТаблицаПодвал);
	
	ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодвал");
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
	Возврат ТабличныйДокумент;
	
КонецФункции
//-- Гурьев 25.09.23

//++ Гурьев 25.09.23 ЧТЗ_2.10
Функция ПолучитьДанныеШапкиПропускНаВъезд_устар(Документ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиента.Номер КАК Номер,
		|	ЗаказКлиента.Дата КАК Дата,
		|	ЗаказКлиента.Контрагент КАК Контрагент,
		|	ЗаказКлиента.Склад КАК Склад,
		|	ЗаказКлиента.Грузополучатель КАК Грузополучатель,
		|	ЗаказКлиента.СпособДоставки КАК СпособДоставки,
		|	ЗаказКлиента.КАНАТ_НомерИДатаДоверенности КАК НомерДоверенности,
		|	ЗаказКлиента.КАНАТ_ФИОСопроводителя КАК ФИОСопроводителя,
		|	ЗаказКлиента.КАНАТ_Водитель КАК Водитель,
		|	ЗаказКлиента.КАНАТ_ГосНомер КАК ГосНомер,
		|	ЗаказКлиента.КАНАТ_АвтомобильМарка КАК АвтомобильМарка,
		|	ЗаказКлиента.АдресДоставки КАК АдресДоставки
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|ГДЕ
		|	ЗаказКлиента.Ссылка = &Документ";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Возврат РезультатЗапроса.Выгрузить()[0];
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции
//-- Гурьев 25.09.23

//++ Гурьев 25.09.23 ЧТЗ_2.10
Функция ПолучитьДанныеТаблицыПропускНаВъезд_устар(Документ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СправочникНоменклатура.Артикул КАК Артикул,
	|	ЗаказКлиентаТовары.Номенклатура КАК Наименование,
	|	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
	|	СправочникНоменклатура.ЕдиницаИзмерения КАК ЕдИзм,
	|	ЗаказКлиентаТовары.КоличествоУпаковок КАК Количество,
	|	ЗаказКлиентаТовары.Цена КАК Цена,
	|	ЗаказКлиентаТовары.СтавкаНДС КАК НДС,
	|	ЗаказКлиентаТовары.СтавкаНДС.Ставка КАК СтавкаНДССтавка,
	|	ЗаказКлиентаТовары.Цена * (1 + ЗаказКлиентаТовары.СтавкаНДС.Ставка / 100) КАК ЦенаСНДС
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО ЗаказКлиентаТовары.Номенклатура = СправочникНоменклатура.Ссылка
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка = &Документ
	|ИТОГИ
	|	Сумма(Количество)
	|ПО
	|	ЕдИзм";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	
	Возврат Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
КонецФункции
//-- Гурьев 25.09.23

//++ Гурьев 26.09.23 ЧТЗ_2.10
Функция СформироватьПропускНаВыезд(Документ)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Ложь;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.КАНАТ_ПечатьПропускНаВъездВыезд.ПФ_MXL_ПечатьПропускНаВыезд");
	ДанныеПФ = ПолучитьДанныеПФПропускНаВыезд(Документ);
	Если ДанныеПФ.Количество() = 0 Тогда
		
		Сообщить("Не найдены документы ""Реализация товаров и услуг"" с заполненными документами ""Заказ клиента"", у которых есть товары.");
		Возврат ТабличныйДокумент;
		
	КонецЕсли;
	
	//Шапка
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	ОбластьШапка.Параметры.Заполнить(ДанныеПФ[0]);
	ОбластьШапка.Параметры.Номер = ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(ДанныеПФ[0].Номер);
	ОбластьШапка.Параметры.Дата = Формат(ДанныеПФ[0].Дата, "ДФ=dd.MM.yyyy");
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	//ТМЦ
	Для Каждого Строка Из ДанныеПФ Цикл
		
		ОбластьТМЦ = Макет.ПолучитьОбласть("ОбластьТМЦ");
		ОбластьТМЦ.Параметры.ТМЦ            = Строка.ТМЦ;
		ОбластьТМЦ.Параметры.НомерНакладной = ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(Строка.НомерНакладной);
		ОбластьТМЦ.Параметры.ДатаНакладной  = Формат(Строка.ДатаНакладной, "ДФ=dd.MM.yyyy");
		ОбластьТМЦ.Параметры.КоличествоМест = СтрШаблон("%1 (%2)", Строка.КоличествоМест,
																   ЧислоПрописью(Строка.КоличествоМест,, ",,,,,,,,0"));
		ТабличныйДокумент.Вывести(ОбластьТМЦ);
		
	КонецЦикла;
	
	//Подвал
	ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодвал");
	ОбластьПодвал.Параметры.Заполнить(ДанныеПФ[0]);
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
	Возврат ТабличныйДокумент;
	
КонецФункции
//-- Гурьев 26.09.23 

//++ Гурьев 26.09.23 ЧТЗ_2.10
Функция ПолучитьДанныеПФПропускНаВыезд_устар(Документ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|	ВЫБРАТЬ
	|	ТранспортнаяНакладная.Номер КАК Номер,
	|	ТранспортнаяНакладная.Дата КАК Дата,
	|	РеализацияТоваровУслуг.Склад КАК НаименованиеПодразделения,
	|	ТранспортнаяНакладная.Грузополучатель КАК НаименованиеОрганизацииГрузополучателя,
	|	ТранспортнаяНакладная.Водитель КАК Водитель,
	|	ТранспортнаяНакладная.КАНАТ_ФИОСопроводителя КАК ФИОСопроводителя,
	|	ТранспортнаяНакладная.АвтомобильГосударственныйНомер КАК Автотранспорт,
	|	СправочникНоменклатура.ГруппаФинансовогоУчета КАК ТМЦ,
	|	РеализацияТоваровУслуг.Номер КАК НомерНакладной,
	|	РеализацияТоваровУслуг.Дата КАК ДатаНакладной,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РеализацияТоваровУслугТовары.НомерСтроки) КАК КоличествоМест
	|ИЗ
	|	Документ.ТранспортнаяНакладная КАК ТранспортнаяНакладная
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТранспортнаяНакладная.ДокументыОснования КАК ТранспортнаяНакладнаяДокументыОснования
	|			ПОЛНОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|				ПОЛНОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ДокументЗаказКлиента
	|					ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|						ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|						ПО ЗаказКлиентаТовары.Номенклатура = СправочникНоменклатура.Ссылка
	|					ПО ДокументЗаказКлиента.Ссылка = ЗаказКлиентаТовары.Ссылка
	|				ПО РеализацияТоваровУслуг.ЗаказКлиента = ДокументЗаказКлиента.Ссылка
	|				ПРАВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|				ПО РеализацияТоваровУслугТовары.Ссылка = РеализацияТоваровУслуг.Ссылка
	|			ПО ТранспортнаяНакладнаяДокументыОснования.ДокументОснование.Ссылка = РеализацияТоваровУслуг.Ссылка
	|		ПО ТранспортнаяНакладная.Ссылка = ТранспортнаяНакладнаяДокументыОснования.Ссылка
	|ГДЕ
	|	ТранспортнаяНакладная.Ссылка = &Документ
	|	И ЗаказКлиентаТовары.НомерСтроки = 1
	|
	|СГРУППИРОВАТЬ ПО
	|	ТранспортнаяНакладная.Номер,
	|	ТранспортнаяНакладная.Дата,
	|	РеализацияТоваровУслуг.Склад,
	|	ТранспортнаяНакладная.Грузополучатель,
	|	ТранспортнаяНакладная.Водитель,
	|	ТранспортнаяНакладная.КАНАТ_ФИОСопроводителя,
	|	ТранспортнаяНакладная.АвтомобильГосударственныйНомер,
	|	СправочникНоменклатура.ГруппаФинансовогоУчета,
	|	РеализацияТоваровУслуг.Номер,
	|	РеализацияТоваровУслуг.Дата";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
//-- Гурьев 26.09.23

//++ Гурьев 15.11.23 ЧТЗ_2.10
Функция ПолучитьДанныеШапкиПропускНаВъезд(Документ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиента.Контрагент КАК Контрагент,
		|	ЗаказКлиента.Склад КАК Склад,
		|	КАНАТ_РаспоряжениеНаОтгрузку.Номер КАК Номер,
		|	КАНАТ_РаспоряжениеНаОтгрузку.Дата КАК Дата,
		|	КАНАТ_РаспоряжениеНаОтгрузку.Грузополучатель.НаименованиеПолное КАК Грузополучатель,
		|	КАНАТ_РаспоряжениеНаОтгрузку.СпособДоставки КАК СпособДоставки,
		|	КАНАТ_РаспоряжениеНаОтгрузку.НомерИДатаДоверенности КАК НомерДоверенности,
		|	КАНАТ_РаспоряжениеНаОтгрузку.ФИОСопроводителя КАК ФИОСопроводителя,
		|	КАНАТ_РаспоряжениеНаОтгрузку.Водитель КАК Водитель,
		|	КАНАТ_РаспоряжениеНаОтгрузку.КАНАТ_ВодительСсылка КАК КАНАТ_ВодительСсылка,
		|	КАНАТ_РаспоряжениеНаОтгрузку.ГосНомер КАК ГосНомер,
		|	КАНАТ_РаспоряжениеНаОтгрузку.АвтомобильМарка КАК АвтомобильМарка,
		|	КАНАТ_РаспоряжениеНаОтгрузку.Адрес КАК АдресДоставки,
		|	ЗаказКлиента.ПеревозчикПартнер КАК Перевозчик,
		|	ЗаказКлиента.АдресДоставкиПеревозчика КАК АдресПеревозчика
		|ИЗ
		|	Документ.КАНАТ_РаспоряжениеНаОтгрузку КАК КАНАТ_РаспоряжениеНаОтгрузку
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
		|		ПО КАНАТ_РаспоряжениеНаОтгрузку.ДокументОснование = ЗаказКлиента.Ссылка
		|ГДЕ
		|	КАНАТ_РаспоряжениеНаОтгрузку.Ссылка = &Документ";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Возврат РезультатЗапроса.Выгрузить()[0];
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции
//-- Гурьев 15.11.23

//++ Гурьев 15.11.23 ЧТЗ_2.10
Функция ПолучитьДанныеТаблицыПропускНаВъезд(Документ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СправочникНоменклатура.Артикул КАК Артикул,
	               |	КАНАТ_РаспоряжениеНаОтгрузкуТовары.Цена * (1 + КАНАТ_РаспоряжениеНаОтгрузкуТовары.СтавкаНДС.Ставка / 100) КАК ЦенаСНДС,
	               |	КАНАТ_РаспоряжениеНаОтгрузкуТовары.Номенклатура КАК Наименование,
				   //БИТ_Гурьев_мелкие замечания_22.05.24++
	               |	КАНАТ_РаспоряжениеНаОтгрузкуТовары.Характеристика КАК Характеристика,
				   //БИТ_Гурьев_мелкие замечания_22.05.24--
	               |	КАНАТ_РаспоряжениеНаОтгрузкуТовары.Упаковка КАК ЕдИзм,
	               |	СУММА(КАНАТ_РаспоряжениеНаОтгрузкуТовары.Количество) КАК Количество,
	               |	КАНАТ_РаспоряжениеНаОтгрузкуТовары.Цена КАК Цена,
	               |	КАНАТ_РаспоряжениеНаОтгрузкуТовары.СтавкаНДС КАК НДС,
	               |	КАНАТ_РаспоряжениеНаОтгрузкуТовары.СтавкаНДС.Ставка КАК СтавкаНДССтавка,
	               |	КАНАТ_РаспоряжениеНаОтгрузкуТовары.КАНАТ_Сертификат КАК Сертификат,
	               |	КАНАТ_РаспоряжениеНаОтгрузкуТовары.КАНАТ_КомментарийКЗаказу КАК Комментарий,
	               |	СУММА(КАНАТ_РаспоряжениеНаОтгрузкуТовары.СуммаСНДС) КАК СуммаСоСкидкой
	               |ИЗ
	               |	Документ.КАНАТ_РаспоряжениеНаОтгрузку.Товары КАК КАНАТ_РаспоряжениеНаОтгрузкуТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	               |		ПО КАНАТ_РаспоряжениеНаОтгрузкуТовары.Номенклатура = СправочникНоменклатура.Ссылка
	               |ГДЕ
	               |	КАНАТ_РаспоряжениеНаОтгрузкуТовары.Ссылка = &Документ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СправочникНоменклатура.Артикул,
	               |	КАНАТ_РаспоряжениеНаОтгрузкуТовары.Номенклатура,
				   //БИТ_Гурьев_мелкие замечания_22.05.24++
	               |	КАНАТ_РаспоряжениеНаОтгрузкуТовары.Характеристика,
				   //БИТ_Гурьев_мелкие замечания_22.05.24--
	               |	КАНАТ_РаспоряжениеНаОтгрузкуТовары.Упаковка,
	               |	КАНАТ_РаспоряжениеНаОтгрузкуТовары.Цена,
	               |	КАНАТ_РаспоряжениеНаОтгрузкуТовары.СтавкаНДС,
	               |	КАНАТ_РаспоряжениеНаОтгрузкуТовары.СтавкаНДС.Ставка,
	               |	КАНАТ_РаспоряжениеНаОтгрузкуТовары.КАНАТ_Сертификат,
	               |	КАНАТ_РаспоряжениеНаОтгрузкуТовары.КАНАТ_КомментарийКЗаказу,
	               |	КАНАТ_РаспоряжениеНаОтгрузкуТовары.Цена * (1 + КАНАТ_РаспоряжениеНаОтгрузкуТовары.СтавкаНДС.Ставка / 100)
	               |ИТОГИ
	               |	СУММА(Количество)
	               |ПО
	               |	ЕдИзм";
					
	Запрос.УстановитьПараметр("Документ", Документ);
	
	Возврат Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
КонецФункции
//-- Гурьев 15.11.23  

//++ Гурьев 17.11.23 ЧТЗ_2.10
Функция ПолучитьДанныеПФПропускНаВыезд(Документ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	КАНАТ_ПропускНаВыезд.Номер КАК Номер,
	               |	КАНАТ_ПропускНаВыезд.Дата КАК Дата,
	               |	КАНАТ_ПропускНаВыезд.Организация КАК Организация,
	               |	КАНАТ_ПропускНаВыезд.Подразделение КАК НаименованиеПодразделения,
	               |	КАНАТ_ПропускНаВыезд.ФИОСопроводителя КАК ФИОСопроводителя,
	               |	КАНАТ_ПропускНаВыезд.Водитель КАК Водитель,
	               |	КАНАТ_ПропускНаВыезд.Марка + "" "" + КАНАТ_ПропускНаВыезд.ГосНомер КАК Автотранспорт,
	               |	КАНАТ_ПропускНаВыезд.ТМЦ КАК ТМЦ,
	               |	СчетФактураВыданный.Номер КАК НомерНакладной,
	               |	СчетФактураВыданный.Дата КАК ДатаНакладной,
	               |	КАНАТ_ПропускНаВыезд.КоличествоМест КАК КоличествоМест,
	               |	КАНАТ_ПропускНаВыезд.ПодписантДолжность КАК ДолжностьПодпись,
	               |	КАНАТ_ПропускНаВыезд.ПодписантСотрудник КАК ИмяПодпись,
	               |	КАНАТ_ПропускНаВыезд.Грузополучатель КАК НаименованиеОрганизацииГрузополучателя,
	               |	КАНАТ_ПропускНаВыезд.Грузополучатель.НаименованиеПолное КАК СокрГрузополучатель
	               |ИЗ
	               |	Документ.КАНАТ_ПропускНаВыезд КАК КАНАТ_ПропускНаВыезд
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	               |			ПО РеализацияТоваровУслуг.Ссылка = СчетФактураВыданный.ДокументОснование
	               |		ПО КАНАТ_ПропускНаВыезд.ДокументОснование = РеализацияТоваровУслуг.Ссылка
	               |ГДЕ
	               |	КАНАТ_ПропускНаВыезд.Ссылка = &Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата";
	
	Запрос.УстановитьПараметр("Ссылка", Документ);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
//-- Гурьев 17.11.23