
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокПропусковНаВыезд.Параметры.УстановитьЗначениеПараметра("ДокументОснование",Параметры.ДокументОснование);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПропусковНаВыездВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;	
	ТекущиеДанные = Элементы.СписокПропусковНаВыезд.ТекущиеДанные;
	Если ТекущиеДанные<> Неопределено Тогда
		ПоказатьЗначение(,ТекущиеДанные.ПропускНаВыезд);
	КонецЕсли;
	
КонецПроцедуры
