&НаСервере
Процедура КАНАТ_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	//БИТ_Гурьев_ЧТЗ_3.2_09.04.24++
	//ПриЧтенииСозданииНаСервере();
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) И
		ЗначениеЗаполнено(Объект.Родитель) И
		Не Объект.КАНАТ_ТехнологическаяСпецификация И
		Объект.Родитель.КАНАТ_ТехнологическаяСпецификация Тогда
		
		Отказ = Истина;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Создание обычной спецификации в папке с технологическими спецификациями невозможно";
		Сообщение.Сообщить();
		
		Возврат;
		
	КонецЕсли;
	//БИТ_Гурьев_ЧТЗ_3.2_09.04.24--
КонецПроцедуры


&НаСервере
Процедура КАНАТ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//БИТ_Гурьев_ЧТЗ_3.2_08.04.24++
	//Спецификация основание
	Если Не Объект.Родитель.КАНАТ_ТехнологическаяСпецификация Тогда
		ЭлементОснование = Элементы.Добавить("КАНАТ_Основание",
														 Тип("ПолеФормы"),
														 Элементы.ГруппаЛево);
		ЭлементОснование.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементОснование.ПутьКДанным = "Объект.КАНАТ_Основание";
		ЭлементОснование.ТолькоПросмотр = Истина;
		
		Элементы.ПодменюПечатьОбычное__ДокладнаяЗаписка.Видимость = Ложь;
		Элементы.ПодменюПечатьОбычное__РасходСырьяМатериалов.Видимость = Ложь;
		Элементы.ПодменюПечатьОбычное__ТехнологическийПроцесс.Видимость = Ложь;
	КонецЕсли;  
		
	Если Объект.Родитель.КАНАТ_ТехнологическаяСпецификация Тогда
		
		//Выключаем подбор технологической спецификации
		Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
			ИсключитьАвтоматическийВыборВДокументах = Истина;
			Объект.ВариантПодбораВДокументы = ?(ИсключитьАвтоматическийВыборВДокументах,
				ПредопределенноеЗначение("Перечисление.ВариантыПодбораСпецификацииВДокументы.Вручную"),
				ПредопределенноеЗначение("Перечисление.ВариантыПодбораСпецификацииВДокументы.Автоматически"));
		КонецЕсли;
		
		ЭтаФорма.Заголовок = СтрШаблон("(технологическая) %1", Этаформа.Заголовок);
		Элементы.ИсключитьАвтоматическийВыборВДокументах.Доступность = Ложь;
		Элементы.ГруппаИзмененияСтатуса.Доступность = Ложь;
		
		//Выводим новые элементы этапа
		ГруппаЗаправочныеПараметры = Элементы.Добавить("КАНАТ_ГруппаЭтапЗаправочныеПараметры",
													Тип("ГруппаФормы"),
													Элементы.ПроизводственныйПроцессЭтап);
		ГруппаЗаправочныеПараметры.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаЗаправочныеПараметры.Заголовок = "Заправочные параметры";
		ГруппаЗаправочныеПараметры.Поведение = ПоведениеОбычнойГруппы.Свертываемая;
		ГруппаЗаправочныеПараметры.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.Картинка;
		
		Элементы.Переместить(ГруппаЗаправочныеПараметры, Элементы.ПроизводственныйПроцессЭтап, Элементы.ЭтапСтраницаОписание);
		
		ЭлементОборудование = Элементы.Добавить("КАНАТ_ЭтапОборудование",
														 Тип("ПолеФормы"),
														 ГруппаЗаправочныеПараметры);
		ЭлементОборудование.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементОборудование.ПутьКДанным = "ПроизводственныйПроцессЭтап.КАНАТ_Оборудование";
		
		ЭлементЗапПараметры = Элементы.Добавить("КАНАТ_ЭтапЗаправочныеПараметры",
														 Тип("ПолеФормы"),
														 ГруппаЗаправочныеПараметры);
		ЭлементЗапПараметры.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементЗапПараметры.ПутьКДанным = "ПроизводственныйПроцессЭтап.КАНАТ_ЗаправочныеПараметры"; 
		ЭлементЗапПараметры.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
		ЭлементЗапПараметры.АвтоМаксимальнаяШирина = Ложь;
		ЭлементЗапПараметры.РастягиватьПоВертикали = Ложь;
		ЭлементЗапПараметры.Высота = 4;
		
		ТаблицаПоказатели = Элементы.Добавить("КАНАТ_ЭтапТаблицаПоказатели", Тип("ТаблицаФормы"),ГруппаЗаправочныеПараметры);
		ТаблицаПоказатели.ПутьКДанным = "ПроизводственныйПроцессЭтап.КАНАТ_Показатели";
		
		ТаблицаПоказателиПоказатель  = Элементы.Добавить("КАНАТ_ЭтапТаблицаПоказателиПоказатель",
															   Тип("ПолеФормы"),
															   ТаблицаПоказатели);
		ТаблицаПоказателиПоказатель.Вид = ВидПоляФормы.ПолеВвода;      
		ТаблицаПоказателиПоказатель.ПутьКДанным = "ПроизводственныйПроцессЭтап.КАНАТ_Показатели.Показатель";
		
		ТаблицаПоказателиЗначение  = Элементы.Добавить("КАНАТ_ЭтапТаблицаПоказателиЗначение",
															   Тип("ПолеФормы"),
															   ТаблицаПоказатели);
		ТаблицаПоказателиЗначение.Вид = ВидПоляФормы.ПолеВвода;      
		ТаблицаПоказателиЗначение.ПутьКДанным = "ПроизводственныйПроцессЭтап.КАНАТ_Показатели.Значение";
		
		//Элементы технологической операции
		ГруппаЗаправочныеПараметры = Элементы.Добавить("КАНАТ_ГруппаОперацияЗаправочныеПараметры",
													Тип("ГруппаФормы"),
													Элементы.ПроизводственныйПроцессОперацияОбычная);
		ГруппаЗаправочныеПараметры.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаЗаправочныеПараметры.Заголовок = "Заправочные параметры";
		ГруппаЗаправочныеПараметры.Поведение = ПоведениеОбычнойГруппы.Свертываемая;
		ГруппаЗаправочныеПараметры.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.Картинка;
		
		Элементы.Переместить(ГруппаЗаправочныеПараметры, Элементы.ПроизводственныйПроцессОперацияОбычная, Элементы.ОперацияСтраницаОписание);
		
		ЭлементОборудование = Элементы.Добавить("КАНАТ_ОперацияОборудование",
														 Тип("ПолеФормы"),
														 ГруппаЗаправочныеПараметры);
		ЭлементОборудование.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементОборудование.ПутьКДанным = "ПроизводственныйПроцессОперация.КАНАТ_Оборудование";
		
		ЭлементЗапПараметры = Элементы.Добавить("КАНАТ_ОперацияЗаправочныеПараметры",
														 Тип("ПолеФормы"),
														 ГруппаЗаправочныеПараметры);
		ЭлементЗапПараметры.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементЗапПараметры.ПутьКДанным = "ПроизводственныйПроцессОперация.КАНАТ_ЗаправочныеПараметры"; 
		ЭлементЗапПараметры.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
		ЭлементЗапПараметры.АвтоМаксимальнаяШирина = Ложь;
		ЭлементЗапПараметры.РастягиватьПоВертикали = Ложь;
		ЭлементЗапПараметры.Высота = 4;
		
		ТаблицаПоказатели = Элементы.Добавить("КАНАТ_ОперацияТаблицаПоказатели", Тип("ТаблицаФормы"),ГруппаЗаправочныеПараметры);
		ТаблицаПоказатели.ПутьКДанным = "ПроизводственныйПроцессОперация.КАНАТ_Показатели";
		
		ТаблицаПоказателиПоказатель  = Элементы.Добавить("КАНАТ_ОперацияТаблицаПоказателиПоказатель",
															   Тип("ПолеФормы"),
															   ТаблицаПоказатели);
		ТаблицаПоказателиПоказатель.Вид = ВидПоляФормы.ПолеВвода;      
		ТаблицаПоказателиПоказатель.ПутьКДанным = "ПроизводственныйПроцессОперация.КАНАТ_Показатели.Показатель";
		
		ТаблицаПоказателиЗначение  = Элементы.Добавить("КАНАТ_ОперацияТаблицаПоказателиЗначение",
															   Тип("ПолеФормы"),
															   ТаблицаПоказатели);
		ТаблицаПоказателиЗначение.Вид = ВидПоляФормы.ПолеВвода;      
		ТаблицаПоказателиЗначение.ПутьКДанным = "ПроизводственныйПроцессОперация.КАНАТ_Показатели.Значение";
		
		//Реквизиты Примечание и Докладная записка
		ЭлементПримечание = Элементы.Добавить("КАНАТ_Примечание",
											  Тип("ПолеФормы"));
		ЭлементПримечание.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементПримечание.ПутьКДанным = "Объект.КАНАТ_Примечание"; 
		ЭлементПримечание.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
		ЭлементПримечание.АвтоМаксимальнаяВысота = Ложь;
		ЭлементПримечание.АвтоМаксимальнаяШирина = Ложь;
		ЭлементПримечание.МаксимальнаяВысота = 3;
		ЭлементПримечание.МаксимальнаяШирина = 71;
		
		Элементы.Переместить(ЭлементПримечание, Элементы.ГруппаДополнительно, Элементы.Описание);
		
		ЭлементДокладнаяЗаписка = Элементы.Добавить("КАНАТ_ДокладнаяЗаписка",
													Тип("ПолеФормы"));
		ЭлементДокладнаяЗаписка.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементДокладнаяЗаписка.ПутьКДанным = "Объект.КАНАТ_ДокладнаяЗаписка"; 
		ЭлементДокладнаяЗаписка.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
		ЭлементДокладнаяЗаписка.АвтоМаксимальнаяВысота = Ложь;
		ЭлементДокладнаяЗаписка.АвтоМаксимальнаяШирина = Ложь;
		ЭлементДокладнаяЗаписка.МаксимальнаяВысота = 3;
		ЭлементДокладнаяЗаписка.МаксимальнаяШирина = 71;
		
		Элементы.Переместить(ЭлементДокладнаяЗаписка, Элементы.ГруппаДополнительно, Элементы.Описание);
		
	Иначе
		
		Элементы.ПодменюСоздатьНаОснованииОбычное__1.Видимость = Ложь;
		
	КонецЕсли;
	//БИТ_Гурьев_ЧТЗ_3.2_08.04.24-- 
	////++Бит Трейгер П.М. 22.10.2024
	//Если ЭтотОбъект.Параметры.ЭтоКопированиеСпецификации = Истина Тогда   //Свойство("ЭтоКопированиеСпецификации")
	//ЭтаФорма.ОсновноеИзделиеНоменклатура = ЭтотОбъект.Параметры.номБит;	
	//ПроцедураПриИзмененииБИТ();
	//КонецЕсли;
	
КонецПроцедуры

//&НаСервере
//Процедура ПроцедураПриИзмененииБИТ()
//КэшированныеЗначения = Неопределено;	
//ОсновноеИзделиеНоменклатураПриИзмененииНаСервере(КэшированныеЗначения);
//ЭтаФорма.Записать();
//КонецПроцедуры        
//--Бит Трейгер П.М. 22.10.202
&НаСервере
&После("ПроизводственныйПроцессПриАктивизацииЭлементаНаСервере")
Процедура КАНАТ_ПроизводственныйПроцессПриАктивизацииЭлементаНаСервере()
	//БИТ_Гурьев_ЧТЗ_3.2_10.04.24++
	
	//БИТ_Гурьев_ЧТЗ_3.2_10.04.24--
КонецПроцедуры

&НаСервере
Процедура КАНАТ_ПередЗаписьюНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//БИТ_Гурьев_ЧТЗ_3.2_11.04.24++
	Если Объект.КАНАТ_ТехнологическаяСпецификация Тогда
	
		Если Не ЗначениеЗаполнено(Объект.Родитель) ИЛИ
			(ЗначениеЗаполнено(Объект.Родитель) И Не Объект.Родитель.КАНАТ_ТехнологическаяСпецификация) Тогда
			
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Технологическая спецификация должна находится в технологической группе.";
			Сообщение.ПутьКДанным = "Объект.Родитель";
			Сообщение.Сообщить();
			
		КонецЕсли;
	
	КонецЕсли;
	
	Если Не Объект.КАНАТ_ТехнологическаяСпецификация Тогда
	
		Если ЗначениеЗаполнено(Объект.Родитель) И Объект.Родитель.КАНАТ_ТехнологическаяСпецификация Тогда
			
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "В технологической группе могут находиться только технологические спецификации.";
			Сообщение.ПутьКДанным = "Объект.Родитель";
			Сообщение.Сообщить();
			
		КонецЕсли;
	
	КонецЕсли;
	//БИТ_Гурьев_ЧТЗ_3.2_11.04.24--
КонецПроцедуры

&НаСервере
Процедура КАНАТ_ПослеЗаписиНаСервереПосле(ТекущийОбъект, ПараметрыЗаписи)
	//БИТ_Гурьев_ЧТЗ_3.2_12.04.24++
	Если Объект.КАНАТ_ТехнологическаяСпецификация Тогда
		ЭтаФорма.Заголовок = СтрШаблон("(технологическая) %1", Этаформа.Заголовок);
	КонецЕсли;
	Если ПараметрыЗаписи.Свойство("НеобходимоПеречитать") И ПараметрыЗаписи.НеобходимоПеречитать Тогда
		ЭтаФорма.Прочитать();
	КонецЕсли;
	//БИТ_Гурьев_ЧТЗ_3.2_12.04.24--
КонецПроцедуры

&НаСервере
Процедура КАНАТ_ПриЗаписиНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//БИТ_Гурьев_ЧТЗ_3.2_12.04.24++
	Если Не ЗначениеЗаполнено(Объект.Ссылка)
		И Не Объект.КАНАТ_ТехнологическаяСпецификация
		И ЗначениеЗаполнено(Объект.КАНАТ_Основание) Тогда
		
		ЭтапОбъект = Справочники.ЭтапыПроизводства.СоздатьЭлемент();
		//++Бит Трейгер П.М. 18.11.2024
		ЭтапОбъект.Заполнить(Неопределено);
		//--Бит Трейгер П.М. 18.11.2024
		ЭтапОбъект.Владелец = ТекущийОбъект.Ссылка;
		ЭтапОбъект.Наименование = "Производство";
		ЭтапОбъект.НомерЭтапа = 1;
		
		ЭтапОбъект.Записать();
		
		ПараметрыЗаписи.Вставить("НеобходимоПеречитать", Истина);
	КонецЕсли;
	//БИТ_Гурьев_ЧТЗ_3.2_12.04.24--
КонецПроцедуры

//&НаСервере
//&ИзменениеИКонтроль("ОсновноеИзделиеНоменклатураПриИзмененииНаСервере")
//Процедура КАНАТ_ОсновноеИзделиеНоменклатураПриИзмененииНаСервере(КэшированныеЗначения) Экспорт

//	СтруктураСтроки = ОсновноеИзделиеСпецификацииСтруктурой(ЭтотОбъект);

//	СтруктураДействий = Новый Структура;

//	СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", СтруктураСтроки.Характеристика);
//	СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу", СтруктураСтроки.Упаковка);
//	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц", Новый Структура("НужноОкруглять", Ложь));
//	СтруктураДействий.Вставить("ЗаполнитьПризнакВидНоменклатуры", Новый Структура("Номенклатура", "ВидНоменклатуры"));
//	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));

//	ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтруктураСтроки, СтруктураДействий, КэшированныеЗначения);

//	ОбработатьИзменениеДанныхОсновногоИзделия(ЭтотОбъект, СтруктураСтроки);

//	ЗаполнитьСлужебныеРеквизитыИспользованияСвойствХарактеристик();

//	УправлениеДаннымиОбИзделияхКлиентСервер.ОчиститьНастройкиУточненияПримененияСпецификации(Объект, "Характеристика");

//	ОбновитьИнформациюПоОсновномуИзделиюСпецификации();

//	РеквизитОписанияПартииВыпускаПриИзменении();

//	ПроверитьОчиститьВариантПромежуточногоВыпуска(ЭтотОбъект);

//	НастроитьЗависимыеЭлементыФормы(ЭтотОбъект, "ОсновноеИзделие,ПроизводственныйПроцесс,ВариантПромежуточногоВыпуска");

//КонецПроцедуры


