
&НаСервере
Процедура КАНАТ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//++ Гурьев 05.10.23 ЧТЗ_К2_v_6.3
	//ПолеВвода = Элементы.Добавить("ТоварыКАНАТ_Сертификат",Тип("ПолеФормы"), Элементы.Товары);
	//ПолеВвода.Заголовок = "Сертификат";
	//ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	//ПолеВвода.ПутьКДанным = "Объект.Товары.КАНАТ_Сертификат";
	//-- Гурьев 05.10.23
	
	//·++·Гурьев·08.08.23·#2_11_4 Добавление реквизита КАНАТ_ПлатитЗаДоставку на форму
	ГруппаПлатитЗаДоставку = Элементы.Добавить(
		"КАНАТ_ГруппаПлатитЗаДоставку",
		Тип("ГруппаФормы"),
		Элементы.СтраницаДоставка);
		
	ГруппаПлатитЗаДоставку.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаПлатитЗаДоставку.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаПлатитЗаДоставку["ОтображатьЗаголовок"] = Ложь;
	Элементы.Переместить(ГруппаПлатитЗаДоставку, Элементы.СтраницаДоставка, Элементы.СтраницыДоставки); 
	
	ПолеВвода = Элементы.Добавить(
		"КАНАТ_ПлатитЗаДоставку",
		Тип("ПолеФормы"), 
		ГруппаПлатитЗаДоставку);	
	ПолеВвода.Заголовок = "Платит за доставку";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.КАНАТ_ПлатитЗаДоставку";
	ПолеВвода.АвтоМаксимальнаяШирина = Ложь;
	ПолеВвода.МаксимальнаяШирина = 29;
	//·--·Гурьев·08.08.23
	//·++·Гурьев 16.08.23·#2_2 Добавление реквизита с документом, удостоверяющим личность
	ДобавляемыеРеквизиты = Новый Массив;
			
	Реквизит_ДокументУдостоверяющийЛичность = Новый РеквизитФормы("КАНАТ_ДокументУдостоверяющийЛичность",
																	Новый ОписаниеТипов("Строка"),
																	,
																	"Документ, удостоверяющий личность");
	
	ДобавляемыеРеквизиты.Добавить(Реквизит_ДокументУдостоверяющийЛичность);
	
	//БИТ_Гурьев__28.03.24++
	Реквизит_СуммаБезНДС = Новый РеквизитФормы("КАНАТ_СуммаБезНДС",
																	Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15, 2)),
																	,
																	"Сумма без НДС");
	ДобавляемыеРеквизиты.Добавить(Реквизит_СуммаБезНДС);
	//БИТ_Гурьев__28.03.24--
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	ГруппаДокументУдостоверяющийЛичность = Элементы.Добавить(
									"КАНАТ_ГруппаДокументУдостоверяющийЛичность",
									Тип("ГруппаФормы"),
									Элементы.СтраницаДоставка);
			
	ГруппаДокументУдостоверяющийЛичность.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаДокументУдостоверяющийЛичность.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаДокументУдостоверяющийЛичность["ОтображатьЗаголовок"] = Ложь;
	ГруппаДокументУдостоверяющийЛичность.РастягиватьПоВертикали = Ложь;
	
	Элементы.Переместить(ГруппаДокументУдостоверяющийЛичность, Элементы.СтраницаДоставка, Элементы.СтраницыДоставки);
	
	ДокументУдостоверяющийЛичность = Элементы.Добавить(
				"КАНАТ_ДокументУдостоверяющийЛичность",
				Тип("ПолеФормы"), 
				ГруппаДокументУдостоверяющийЛичность);
	ДокументУдостоверяющийЛичность.Вид = ВидПоляФормы.ПолеВвода;
	ДокументУдостоверяющийЛичность.ТолькоПросмотр = Истина;
	ДокументУдостоверяющийЛичность.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	ДокументУдостоверяющийЛичность.МногострочныйРежим = Истина;
	ДокументУдостоверяющийЛичность.ВертикальноеПоложение = ВертикальноеПоложениеЭлемента.Верх;
	ДокументУдостоверяющийЛичность.ПутьКДанным = "КАНАТ_ДокументУдостоверяющийЛичность";
	
	ИзменитьДокументУдостоверяющийЛичность();
	//·--·Гурьев·16.08.23
	
	//++ Гурьев 01.09.23 Гурьев Вывод реквизита "Комментарий к заказу"
	КолонкаКомментарийКЗаказу = Элементы.Добавить("КАНАТ_ТоварыКомментарийКЗаказу", Тип("ПолеФормы"), Элементы.Товары); 
	КолонкаКомментарийКЗаказу.Заголовок = "Комментарий к заказу"; 
	КолонкаКомментарийКЗаказу.ПутьКДанным = "Объект.Товары.КАНАТ_КомментарийКЗаказу";
	КолонкаКомментарийКЗаказу.Вид = ВидПоляФормы.ПолеВвода;
	//-- Гурьев 01.09.23
	
	//++ Гурьев 25.09.23 ЧТЗ_2.10
	
	ПолеНомерИДатаДоверенности = Элементы.Добавить("КАНАТ_НомерИДатаДоверенности", Тип("ПолеФормы"), Элементы.СтраницаДоставка);
	ПолеНомерИДатаДоверенности.Заголовок = "№ доверенности"; 
	ПолеНомерИДатаДоверенности.ПутьКДанным = "Объект.КАНАТ_НомерИДатаДоверенности";
	ПолеНомерИДатаДоверенности.Вид = ВидПоляФормы.ПолеВвода;
	
	ПолеФИОСопроводителя = Элементы.Добавить("КАНАТ_ФИОСопроводителя", Тип("ПолеФормы"), Элементы.СтраницаДоставка);
	ПолеФИОСопроводителя.Заголовок = "Через – Ф.И.О."; 
	ПолеФИОСопроводителя.ПутьКДанным = "Объект.КАНАТ_ФИОСопроводителя";
	ПолеФИОСопроводителя.Вид = ВидПоляФормы.ПолеВвода;
	
	ПолеВодитель = Элементы.Добавить("КАНАТ_Водитель", Тип("ПолеФормы"), Элементы.СтраницаДоставка);
	ПолеВодитель.Заголовок = "Водитель - Ф.И.О."; 
	ПолеВодитель.ПутьКДанным = "Объект.КАНАТ_Водитель";
	ПолеВодитель.Вид = ВидПоляФормы.ПолеВвода;
	
	ПолеВодительСсылка = Элементы.Добавить("КАНАТ_ВодительСсылка", Тип("ПолеФормы"), Элементы.СтраницаДоставка);
	ПолеВодительСсылка.Заголовок = "Водитель - Ф.И.О."; 
	ПолеВодительСсылка.ПутьКДанным = "Объект.КАНАТ_ВодительСсылка";
	ПолеВодительСсылка.Вид = ВидПоляФормы.ПолеВвода;
	
	ГруппаТранспорт = Элементы.Добавить("КАНАТ_ГруппаТранспорт", Тип("ГруппаФормы"), Элементы.СтраницаДоставка);
	ГруппаТранспорт.Заголовок = "Транспорт";
	ГруппаТранспорт.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаТранспорт.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
	ГруппаТранспорт.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	ПолеТранспорт = Элементы.Добавить("КАНАТ_Транспорт", Тип("ПолеФормы"), ГруппаТранспорт);
	ПолеТранспорт.Заголовок = "Транспорт"; 
	ПолеТранспорт.ПутьКДанным = "Объект.КАНАТ_Транспорт";
	ПолеТранспорт.Вид = ВидПоляФормы.ПолеВвода;
	ПолеТранспорт.УстановитьДействие("ПриИзменении", "ТранспортПриИзменении");
	
	ГруппаТранспорт1 = Элементы.Добавить("КАНАТ_ГруппаТранспорт1", Тип("ГруппаФормы"), ГруппаТранспорт);
	ГруппаТранспорт1.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаТранспорт1.ОтображатьЗаголовок = Ложь;
	ГруппаТранспорт.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаТранспорт.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	
	ПолеГосНомер = Элементы.Добавить("КАНАТ_ГосНомер", Тип("ПолеФормы"), ГруппаТранспорт1);
	ПолеГосНомер.Заголовок = "Гос. номер автомобиля"; 
	ПолеГосНомер.ПутьКДанным = "Объект.КАНАТ_ГосНомер";
	ПолеГосНомер.Вид = ВидПоляФормы.ПолеВвода;
	
	ПолеАвтомобильМарка = Элементы.Добавить("КАНАТ_АвтомобильМарка", Тип("ПолеФормы"), ГруппаТранспорт1);
	ПолеАвтомобильМарка.Заголовок = "Автомобиль марка"; 
	ПолеАвтомобильМарка.ПутьКДанным = "Объект.КАНАТ_АвтомобильМарка";
	ПолеАвтомобильМарка.Вид = ВидПоляФормы.ПолеВвода;
	
	ПолеСерияИНомерУдостоверения = Элементы.Добавить("КАНАТ_СерияИНомерУдостоверения", Тип("ПолеФормы"), ГруппаТранспорт1);
	ПолеСерияИНомерУдостоверения.Заголовок = "Серия и номер удостоверения"; 
	ПолеСерияИНомерУдостоверения.ПутьКДанным = "Объект.КАНАТ_СерияИНомерУдостоверения";
	ПолеСерияИНомерУдостоверения.Вид = ВидПоляФормы.ПолеВвода;
	
	Элементы.Переместить(ПолеНомерИДатаДоверенности,   Элементы.СтраницаДоставка, Элементы.СтраницыДоставки);
	Элементы.Переместить(ПолеФИОСопроводителя,         Элементы.СтраницаДоставка, Элементы.СтраницыДоставки);
	Элементы.Переместить(ПолеВодитель,                 Элементы.СтраницаДоставка, Элементы.СтраницыДоставки);
	Элементы.Переместить(ПолеВодительСсылка,                 Элементы.СтраницаДоставка, Элементы.СтраницыДоставки);
	Элементы.Переместить(ГруппаТранспорт,              Элементы.СтраницаДоставка, Элементы.СтраницыДоставки);
	Элементы.Переместить(ПолеСерияИНомерУдостоверения, Элементы.СтраницаДоставка, Элементы.СтраницыДоставки);
	
	ОбновитьВидимостьТранспорт();
	ИзменениеВыбораВодителя();
	
	//-- Гурьев 25.09.23 ЧТЗ_2.10
	//VVLarionov   
	ДопИнформацияУПД = Элементы.Добавить("Бит_ДопИнформация",Тип("ПолеФормы"),Элементы.ГруппаОсновное);
	ДопИнформацияУПД.Заголовок = "Дополнительная информация в УПД";
	ДопИнформацияУПД.Вид = ВидПоляФормы.ПолеВвода;
	ДопИнформацияУПД.ПутьКДанным= "Объект.Канат_ДопИнформация";
	
	//VVLarionov
	//++ Гурьев 13.11.23 ЧТЗ_2.3 Колонка с сертификатом
	ПолеСертификат = Элементы.Добавить("КАНАТ_Сертификат", Тип("ПолеФормы"), Элементы.Товары);
	ПолеСертификат.Заголовок = "Сертификат";
	ПолеСертификат.ПутьКДанным = "Объект.Товары.КАНАТ_Сертификат";
	ПолеСертификат.Вид = ВидПоляФормы.ПолеВвода;
	//-- Гурьев 13.11.23 ЧТЗ_2.3
	
	//++ Гурьев 23.11.23 ЧТЗ_2.10
	Если Объект.Ссылка.Пустая() Тогда
		
		Если Не ЗначениеЗаполнено(Объект.АдресДоставки) Тогда
			
			КАНАТ_ИзменитьАдресДоставки("Грузополучатель");
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.АдресДоставки) Тогда
			
			КАНАТ_ИзменитьАдресДоставки("Контрагент");
			
		КонецЕсли;
		
	КонецЕсли;
	//-- Гурьев 23.11.23 ЧТЗ_2.10
	
	//++БИТ_Гурьев_11.01.24
	ПолеГрузополучатель = Элементы.Добавить("КАНАТ_Грузополучатель", Тип("ПолеФормы"), Элементы.СтраницаДоставка);
	ПолеГрузополучатель.Заголовок = "Грузополучатель"; 
	ПолеГрузополучатель.ПутьКДанным = "Объект.Грузополучатель";
	ПолеГрузополучатель.Вид = ВидПоляФормы.ПолеВвода;
	ПолеГрузополучатель.УстановитьДействие("ПриИзменении", "КАНАТ_ГрузополучательПриИзменении");
	
	Элементы.Переместить(ПолеГрузополучатель, Элементы.СтраницаДоставка, Элементы.СпособДоставки);
	//--БИТ_Гурьев_11.01.24
	
	//БИТ_Гурьев__28.03.24++
	ПолеСуммаБезНДС = Элементы.Добавить("КАНАТ_СуммаБезНДС", Тип("ПолеФормы"), Элементы.ГруппаИтого);
	ПолеСуммаБезНДС.Заголовок = "Сумма без НДС"; 
	ПолеСуммаБезНДС.ПутьКДанным = "КАНАТ_СуммаБезНДС";
	ПолеСуммаБезНДС.Вид = ВидПоляФормы.ПолеВвода;
	ПолеСуммаБезНДС.ТолькоПросмотр = Истина;
	
	Элементы.Переместить(ПолеСуммаБезНДС, Элементы.ГруппаИтого, Элементы.ГруппаВсегоСкидка);
	
	КАНАТ_ПересчитатьСуммуБезНДС();
	//БИТ_Гурьев__28.03.24--
КонецПроцедуры

&НаСервере
&После("ДоговорПриИзмененииСервер")
Процедура КАНАТ_ДоговорПриИзмененииСервер()
	//БИТ_Байков ++ 21.08.23·#2_5 Связь договоров соглашений
	    Объект.Соглашение = Объект.Договор.КАНАТ_ПоСоглашению;
	//БИТ_Байков -
КонецПроцедуры

&НаКлиенте
Процедура КАНАТ_СоглашениеОчисткаПосле(Элемент, СтандартнаяОбработка)
	//Бит_Байков+ ЧТЗ 2_5 связь соглашений и договоров
	 Элементы.Договор.Видимость = Истина;
	 Элементы.Договор.Доступность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КАНАТ_СоглашениеПриИзмененииПеред(Элемент) 
	//Бит_Байков+ ЧТЗ 2_5 связь соглашений и договоров
	КАНАТ_СоглашениеПриИзмененииПоказатьДоговор() 
	КонецПроцедуры      
	
&НаСервере
Процедура КАНАТ_СоглашениеПриИзмененииПоказатьДоговор()
	
	//Бит_Байков+ ЧТЗ 2_5 связь соглашений и договоров
	ПродажиСервер.УстановитьДоступностьДоговора(Объект, Элементы.Договор.Доступность, Элементы.Договор.Видимость,
		Объект.Договор); 
	Объект.Договор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
КонецПроцедуры  

&НаКлиенте
Процедура КАНАТ_ДоговорПриИзмененииПосле(Элемент)
	//++ Гурьев 20.09.23 ЧТЗ_2.3
	//ЗаполнитьДанныеСпецификации();
	//-- Гурьев 20.09.23 ЧТЗ_2.3
КонецПроцедуры

//·++·Гурьев 20.10.23·#2_2 Добавление реквизита с документом, удостоверяющим личность
&НаСервере
Процедура ИзменитьДокументУдостоверяющийЛичность()
	
	Если Не Объект.Контрагент.Пустая() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	ДокументыФизическихЛицСрезПоследних.Физлицо КАК Физлицо,
		|	МАКСИМУМ(ДокументыФизическихЛицСрезПоследних.Период) КАК Период,
		|	Контрагенты.ЮрФизЛицо КАК ЮрФизЛицо
		|ПОМЕСТИТЬ Вт
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних(
		|				,
		|				Физлицо = &Ссылка
		|					И ЯвляетсяДокументомУдостоверяющимЛичность) КАК ДокументыФизическихЛицСрезПоследних
		|		ПО Контрагенты.Ссылка = ДокументыФизическихЛицСрезПоследних.Физлицо
		|ГДЕ
		|	Контрагенты.Ссылка = &Ссылка
        |
		|СГРУППИРОВАТЬ ПО
		|	ДокументыФизическихЛицСрезПоследних.Физлицо,
		|	Контрагенты.ЮрФизЛицо
		|;
        |
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокументыФизическихЛицСрезПоследних.Представление КАК Представление,
		|	Вт.ЮрФизЛицо КАК ЮрФизЛицо
		|ИЗ
		|	Вт КАК Вт
		|		ПРАВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних(
		|				,
		|				Физлицо = &Ссылка
		|					И ЯвляетсяДокументомУдостоверяющимЛичность) КАК ДокументыФизическихЛицСрезПоследних
		|		ПО (Вт.Физлицо = ДокументыФизическихЛицСрезПоследних.Физлицо
		|				И Вт.Период = ДокументыФизическихЛицСрезПоследних.Период)";
		Если Не ЗначениеЗаполнено(Объект.Грузополучатель) Тогда
		Запрос.Параметры.Вставить("Ссылка", Объект.Контрагент);
	Иначе
		Запрос.Параметры.ВСтавить("Ссылка",Объект.Грузополучатель);
		КонецЕсли;
		//Сообщить(Объект.Грузополучатель);
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		//СОобщить(ЭтотОбъект.КАНАТ_ДокументУдостоверяющийЛичность);
		Если РезультатЗапроса.Количество() > 0 И (РезультатЗапроса[0].ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо или РезультатЗапроса[0].ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель) Тогда
		
			ЭтотОбъект.КАНАТ_ДокументУдостоверяющийЛичность= РезультатЗапроса[0]["Представление"];
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
//·--·Гурьев 20.10.23·#2_2 Добавление реквизита с документом, удостоверяющим личность

//·++·Гурьев 20.10.23·#2_2 Добавление реквизита с документом, удостоверяющим личность
&НаКлиенте
Процедура КАНАТ_КонтрагентПриИзмененииПосле(Элемент)
	ИзменитьДокументУдостоверяющийЛичность(); 
	ЭтаФорма.Прочитать();	
КонецПроцедуры
//·--·Гурьев 20.10.23·#2_2 Добавление реквизита с документом, удостоверяющим личность

&НаСервере
Процедура ОбновитьВидимостьТранспорт()
	
	 //Выбора транспорта из спарвочника, в зависимости от способа доставки
	Если Объект.СпособДоставки = Перечисления.СпособыДоставки.ДоКлиента
		ИЛИ Объект.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу Тогда
		
		Элементы.КАНАТ_Транспорт.Видимость = Истина;
		Элементы.КАНАТ_ГруппаТранспорт1.ТолькоПросмотр = Истина;
		
		Объект.КАНАТ_ГосНомер = Объект.КАНАТ_Транспорт.Код;
		Объект.КАНАТ_АвтомобильМарка = Объект.КАНАТ_Транспорт.Марка;
		
	Иначе
		
		Элементы.КАНАТ_Транспорт.Видимость = Ложь;
		Элементы.КАНАТ_ГруппаТранспорт1.ТолькоПросмотр = Ложь;
		
	КонецЕсли;
	
	Если Объект.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчика 
		ИЛИ Объект.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу Тогда
		
		Элементы.СтраницыПеревозчик.ТекущаяСтраница = Элементы.СтраницаПеревозчик;
		
	Иначе
		
		Элементы.СтраницыПеревозчик.ТекущаяСтраница = Элементы.СтраницаПеревозчикПусто;
		
	КонецЕсли;
	
	Если Объект.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз Тогда
		
		Элементы.СтраницыДоставки.ТекущаяСтраница = Элементы.СтраницаСамовывоз;
		
	ИначеЕсли Объект.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчика Тогда
		
		Элементы.СтраницыДоставки.ТекущаяСтраница = Элементы.СтраницаДоставкаПеревозчиком;
		
	ИначеЕсли Объект.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу Тогда
		
		Элементы.СтраницыДоставки.ТекущаяСтраница = Элементы.СтраницаДоставкаПеревозчикомПоАдресу;
		
	ИначеЕсли Объект.СпособДоставки = Перечисления.СпособыДоставки.ДоКлиента Тогда
		
		Элементы.СтраницыДоставки.ТекущаяСтраница = Элементы.СтраницаДоставкаДоПолучателя;
		
	ИначеЕсли Объект.СпособДоставки = Перечисления.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки Тогда
		
		Элементы.СтраницыДоставки.ТекущаяСтраница = Элементы.СтраницаДоставкаДоПолучателяКурьером;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КАНАТ_СпособДоставкиПриИзмененииПосле(Элемент)
	ОбновитьВидимостьТранспорт();
	ИзменениеВыбораВодителя();
КонецПроцедуры 

&НаКлиенте
Процедура ТранспортПриИзменении(Элемент)
	
	ТранспортПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ТранспортПриИзмененииНаСервере()
	
	Объект.КАНАТ_ГосНомер = Объект.КАНАТ_Транспорт.Код;
	Объект.КАНАТ_АвтомобильМарка = Объект.КАНАТ_Транспорт.Марка;
	
КонецПроцедуры

&НаКлиенте
Процедура КАНАТ_ПартнерБезКЛПриИзмененииПосле(Элемент)
	КАНАТ_ИзменитьАдресДоставки("Контрагент");
КонецПроцедуры

&НаСервере
Процедура ИзменениеВыбораВодителя()
	
	Если Объект.СпособДоставки = Перечисления.СпособыДоставки.ДоКлиента
		ИЛИ Объект.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу Тогда 
		
		Элементы.КАНАТ_Водитель.Видимость = Ложь;
		Элементы.КАНАТ_ВодительСсылка.Видимость = Истина;
	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ФизическиеЛица.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.ФизическиеЛица КАК ФизическиеЛица
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица1
		               |		ПО ФизическиеЛица.Родитель = ФизическиеЛица1.Ссылка
		               |ГДЕ
		               |	ФизическиеЛица1.Наименование = ""Водители""";
					   
		Выборка = Запрос.Выполнить().Выбрать();
		
		ДоступныеФизЛица = Новый Массив;
		
		Пока Выборка.Следующий() Цикл
			
			ДоступныеФизЛица.Добавить(Выборка.Ссылка);
			
		КонецЦикла; 
		
		Параметр = Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(ДоступныеФизЛица));
		мПараметрыВыбора = Новый Массив;
		мПараметрыВыбора.Добавить(Параметр);
		
		//ЭтаФорма.Элементы.Продукция.ПараметрыВыбора = Новый ФиксированныйМассив(мПараметрыВыбора);
		ЭтаФорма.Элементы.КАНАТ_ВодительСсылка.ПараметрыВыбора = Новый ФиксированныйМассив(мПараметрыВыбора);
			
	Иначе 
		
		Элементы.КАНАТ_Водитель.Видимость = Истина;
		Элементы.КАНАТ_ВодительСсылка.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

//++ Гурьев 23.11.23 ЧТЗ_2.10
//&НаСервере
//&Вместо("ЗаполнитьУстановитьРеквизитыДоставкиСервер")
//Процедура КАНАТ_ЗаполнитьУстановитьРеквизитыДоставкиСервер(ИмяЭлементаФормы)
//КонецПроцедуры
//-- Гурьев 23.11.23 ЧТЗ_2.10


//++ Гурьев 23.11.23 ЧТЗ_2.10
&НаСервере
Процедура КАНАТ_ИзменитьАдресДоставки(ИмяРеквизита)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтрагентыКонтактнаяИнформация.Представление КАК Представление
		|ИЗ
		|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
		|ГДЕ
		|	КонтрагентыКонтактнаяИнформация.Тип = &Тип
		|	И КонтрагентыКонтактнаяИнформация.Вид = &Вид
		|	И КонтрагентыКонтактнаяИнформация.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента);
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес);
	Запрос.УстановитьПараметр("Ссылка", Объект[ИмяРеквизита]);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Объект.АдресДоставки = Выборка.Представление;
	КонецЕсли;
	
КонецПроцедуры
//-- Гурьев 23.11.23 ЧТЗ_2.10

//++БИТ_Гурьев_11.01.24
&НаКлиенте
Процедура КАНАТ_ГрузополучательПриИзменении(Элемент)
	КАНАТ_ИзменитьАдресДоставки("Грузополучатель"); 
	ИзменитьДокументУдостоверяющийЛичность();
КонецПроцедуры //--БИТ_Гурьев_11.01.24


&НаКлиенте
Процедура КАНАТ_ГруппаСтраницыПриСменеСтраницыПосле(Элемент, ТекущаяСтраница)
	
	ПрокрутитьСтраницу = Истина;   
	//Тест
	Элементы.Товары.АвтоМаксимальнаяВысота = Истина;
	Элементы.Товары.АвтоМаксимальнаяВысотаВСтрокахТаблицы = Истина;
	Элементы.Товары.ВысотаВСтрокахТаблицы = 5;
	Элементы.Товары.Высота = 3;
	Элементы.Товары.ВариантУправленияВысотой = ВариантУправленияВысотойТаблицы.ВСтрокахТаблицы;
	//
	Оповестить("ПереключитьсяНаЭлементСтатус");
	
КонецПроцедуры


&НаКлиенте
Процедура КАНАТ_ОбработкаОповещенияПосле(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ПереключитьсяНаЭлементСтатус" тогда
		ТекущийЭлемент = Элементы.Статус;
	КонецЕсли;
	
КонецПроцедуры

//БИТ_Гурьев__28.03.24++
&НаСервере
Процедура КАНАТ_ПересчитатьСуммуБезНДС()
	
	ЭтотОбъект["КАНАТ_СуммаБезНДС"] = 0;
	
	Для Каждого Строка Из Объект.Товары Цикл
		
		ЭтотОбъект["КАНАТ_СуммаБезНДС"] = ЭтотОбъект["КАНАТ_СуммаБезНДС"] + Строка.Сумма;
		
	КонецЦикла;

КонецПроцедуры //БИТ_Гурьев__28.03.24--

&НаКлиенте
Процедура КАНАТ_ТоварыПриИзмененииПосле(Элемент)
	//БИТ_Гурьев__28.03.24++
	КАНАТ_ПересчитатьСуммуБезНДС();
	//БИТ_Гурьев__28.03.24--
КонецПроцедуры

&НаКлиенте
&После("СпособМестоДоставкиПеревозчикПриИзменении")
Процедура КАНАТ_СпособМестоДоставкиПеревозчикПриИзменении(Элемент)
	//БИТ_Гурьев__03.04.24++
	КАНАТ_СпособМестоДоставкиПеревозчикПриИзмененииСервер();
	//БИТ_Гурьев__03.04.24--
КонецПроцедуры

&НаСервере
Процедура КАНАТ_СпособМестоДоставкиПеревозчикПриИзмененииСервер()

	//БИТ_Гурьев__03.04.24++
	Если Не (Объект.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчика ИЛИ
		Объект.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу) Тогда
		Объект.ПеревозчикПартнер = Неопределено;
	КонецЕсли;
	//БИТ_Гурьев__03.04.24--

КонецПроцедуры


&НаСервере
&ИзменениеИКонтроль("ЗаполнитьУстановитьРеквизитыДоставкиСервер")
Процедура КАНАТ_ЗаполнитьУстановитьРеквизитыДоставкиСервер(ИмяЭлементаФормы)
	#Удаление
	ДоставкаТоваров.ЗаполнитьРеквизитыДоставки(Элементы, ИмяЭлементаФормы, Объект);
	#КонецУдаления
КонецПроцедуры


&НаСервере
Процедура КАНАТ_ПослеЗаписиНаСервереПосле(ТекущийОбъект, ПараметрыЗаписи)
	//++Бит_Зачетнова_21.05.2025_Обращение 1660201581 от 15.05.2025 14:38:44
	ДопДанныеЗаказ = ТекущийОбъект.Канат_ДопИнформация; 
	
	ТаблицаСвязанныхРеализаций = ЗаказСвязаннаяРеализация(ТекущийОбъект.Ссылка);
	
	Если ТаблицаСвязанныхРеализаций <> Неопределено тогда 
		Для каждого СтрокаТЧ из ТаблицаСвязанныхРеализаций цикл
			Попытка
			РеализацияСсылка = СтрокаТЧ.Ссылка; 
			РеализацияОбъект = РеализацияСсылка.ПолучитьОбъект(); 
			РеализацияОбъект.Заблокировать();
			РеализацияОбъект.Канат_ДопИнформация = ДопДанныеЗаказ; 
			РеализацияОбъект.Записать(РежимЗаписиДокумента.Проведение); 
			Исключение   
				Сообщение = Новый СообщениеПользователю; 
				Сообщение.Текст = "Не удалось изменить документ" + РеализацияСсылка; 
				Сообщение.Сообщить(); 
			КонецПопытки;
		КонецЦикла;  
	КонецЕсли;
	//--Бит_Зачетнова_21.05.2025_Обращение 1660201581 от 15.05.2025 14:38:44
КонецПроцедуры

Функция ЗаказСвязаннаяРеализация(ДокументЗаказ)
    //++Бит_Зачетнова_21.05.2025_Обращение 1660201581 от 15.05.2025 14:38:44
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.ЗаказКлиента = &ЗаказКлиента";
	
	Запрос.УстановитьПараметр("ЗаказКлиента", ДокументЗаказ);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() <> 0 тогда 
		Возврат РезультатЗапроса;
	Иначе Возврат Неопределено; 
		КонецЕсли;
	//--Бит_Зачетнова_21.05.2025_Обращение 1660201581 от 15.05.2025 14:38:44	
	КонецФункции
