
//&НаСервере
//Процедура КАНАТ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
//	//++БИТ_Гурьев_ЧТЗ_К5_11.01.24
//	Если КАНАТ_ЭтоСырье() Тогда
//		//++БИТ_Гурьев_ЧТЗ_К5_12.12.23
//		ГруппаНТДСырья = ЭтаФорма.Элементы.Добавить("ГруппаНТДСырья", Тип("ГруппаФормы"),ЭтаФорма);
//		ГруппаНТДСырья.Вид = ВидГруппыФормы.ОбычнаяГруппа;
//		ГруппаНТДСырья.Отображение = ОтображениеОбычнойГруппы.Нет;
//		ГруппаНТДСырья.ОтображатьЗаголовок = Ложь;
//		
//		Элементы.Переместить(ГруппаНТДСырья, ЭтаФорма, Элементы.ГиперссылкаПерейтиСоставНабора);
//		
//		КАНАТ_НТДСырья = ЭтаФорма.Элементы.Добавить("КАНАТ_НТДСырья", Тип("ПолеФормы"),ГруппаНТДСырья);
//		КАНАТ_НТДСырья.Вид = ВидПоляФормы.ПолеВвода;
//		КАНАТ_НТДСырья.ПутьКДанным = "Объект.КАНАТ_НТДНоменклатуры";
//		
//		Элементы.ЗаполнитьРабочееНаименованиеПоШаблону.Доступность = Истина;
//		//--БИТ_Гурьев_ЧТЗ_К5_12.12.23
//	КонецЕсли;
//	//--БИТ_Гурьев_ЧТЗ_К5_11.01.24
//	
//КонецПроцедуры

//&НаСервере
//&Вместо("ЗаполнитьНаименованиеПоШаблонуСервер")
//Процедура КАНАТ_ЗаполнитьНаименованиеПоШаблонуСервер(ВариантФормирования)
//	
//	//++БИТ_Гурьев_ЧТЗ_К5_11.01.24
//	Если КАНАТ_ЭтоСырье() Тогда
//		//++БИТ_Гурьев_ЧТЗ_К5_12.12.23
//		Наименование = "";
//		Производитель = "";
//		Цвет = "";
//		
//		Для Каждого Реквизит Из ЭтаФорма.ПолучитьРеквизиты() Цикл
//			
//			Если Реквизит.Заголовок = "Производитель" Тогда
//				Если ЗначениеЗаполнено(ЭтаФорма[Реквизит.Имя]) Тогда
//					Производитель = Строка(ЭтаФорма[Реквизит.Имя].Наименование);
//				КонецЕсли;
//				
//			КонецЕсли;
//			
//			Если Реквизит.Заголовок = "Цветность" Тогда
//				Если ЗначениеЗаполнено(ЭтаФорма[Реквизит.Имя]) Тогда
//					Цвет = Строка(ЭтаФорма[Реквизит.Имя].Наименование);
//				КонецЕсли;
//				
//			КонецЕсли;
//			
//		КонецЦикла;
//		
//		Наименование = СтрШаблон("%1%2%3%4%5",
//								 Производитель,
//								 ", ",
//								 Объект.КАНАТ_НТДНоменклатуры, 
//								 ", ",
//								 Цвет);
//								 
//		Если ВариантФормирования = "Рабочее" ИЛИ ВариантФормирования = "Оба" Тогда
//			Объект.Наименование = Наименование;
//		КонецЕсли;
//		Если ВариантФормирования = "ДляПечати" ИЛИ ВариантФормирования = "Оба" Тогда
//			Объект.НаименованиеПолное = Наименование;
//		КонецЕсли;
//		//--БИТ_Гурьев_ЧТЗ_К5_12.12.23
//	Иначе
//		УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, Объект);
//	
//		СправочникОбъект = РеквизитФормыВЗначение("Объект");
//		
//		Если ВариантФормирования = "Рабочее" ИЛИ ВариантФормирования = "Оба" Тогда
//			Объект.Наименование = НоменклатураСервер.НаименованиеПоШаблону(РеквизитыВидаНоменклатуры().ШаблонРабочегоНаименованияХарактеристики,
//				СправочникОбъект);
//			СправочникОбъект.Наименование = Объект.Наименование;
//		КонецЕсли;
//		Если ВариантФормирования = "ДляПечати" ИЛИ ВариантФормирования = "Оба" Тогда
//			Объект.НаименованиеПолное = НоменклатураСервер.НаименованиеПоШаблону(РеквизитыВидаНоменклатуры().ШаблонНаименованияДляПечатиХарактеристики,
//				СправочникОбъект);
//		КонецЕсли;
//	КонецЕсли;
//	//--БИТ_Гурьев_ЧТЗ_К5_11.01.24
//КонецПроцедуры

//&НаКлиенте
//Процедура КАНАТ_ПередЗаписьюПеред(Отказ, ПараметрыЗаписи)
//	//++БИТ_Гурьев_ЧТЗ_К5_11.01.24
//	Если КАНАТ_ЭтоСырье() Тогда
//		//++БИТ_Гурьев_ЧТЗ_К5_12.12.23
//		Если Не ЗначениеЗаполнено(Объект.Наименование) И Не ЗначениеЗаполнено(Объект.НаименованиеПолное) Тогда
//			ВариантФормирования = "Оба";
//		ИначеЕсли Не ЗначениеЗаполнено(Объект.НаименованиеПолное) Тогда
//			ВариантФормирования = "ДляПечати";
//		ИначеЕсли Не ЗначениеЗаполнено(Объект.Наименование) Тогда
//			ВариантФормирования = "Рабочее";
//		КонецЕсли;
//		
//		Если ЗначениеЗаполнено(ВариантФормирования) Тогда
//			ЗаполнитьНаименованиеПоШаблонуСервер(ВариантФормирования);
//		КонецЕсли;
//		//--БИТ_Гурьев_ЧТЗ_К5_12.12.23
//	КонецЕсли;
//	//--БИТ_Гурьев_ЧТЗ_К5_11.01.24

//КонецПроцедуры

//++БИТ_Гурьев_ЧТЗ_К5_11.01.24
&НаСервере
Функция КАНАТ_ЭтоСырье()
	
	Если Не ЗначениеЗаполнено(Объект.ВидНоменклатуры) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если СтрНайти(НРег(Объект.ВидНоменклатуры), "сырье") <> 0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции
//--БИТ_Гурьев_ЧТЗ_К5_11.01.24
