
&ИзменениеИКонтроль("ОбработкаПроверкиЗаполнения")
Процедура КАНАТ_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	НепроверяемыеРеквизиты = Новый Массив;

	Если Не ЗначениеЗаполнено(ВнутреннийИдентификаторЕИС) Тогда
		ПроверяемыеРеквизиты.Добавить("Состояние");
		ПроверяемыеРеквизиты.Добавить("ДатаЗаключения");
		ПроверяемыеРеквизиты.Добавить("ГодОкончанияСрокаДействия");

		Если ТипНаправленияДеятельности = Перечисления.ТипыНаправленийДеятельности.КонтрактГОЗ Тогда
			ПроверяемыеРеквизиты.Добавить("УполномоченныйБанк");
			#Удаление
			ПроверяемыеРеквизиты.Добавить("НомерГОЗ");
			#КонецУдаления
			ПроверяемыеРеквизиты.Добавить("КодСпособаОпределенияПоставщика");
			ПроверяемыеРеквизиты.Добавить("КодГосударственногоЗаказчика");
			ПроверяемыеРеквизиты.Добавить("ПорядковыйНомер");
			ПроверяемыеРеквизиты.Добавить("ДополнительныеРазряды");
		КонецЕсли;
	КонецЕсли;

	Если ТипНаправленияДеятельности = Перечисления.ТипыНаправленийДеятельности.ГосударственныйКонтракт Тогда

		НепроверяемыеРеквизиты.Добавить("УполномоченныйБанк");
		НепроверяемыеРеквизиты.Добавить("КодСпособаОпределенияПоставщика");
		НепроверяемыеРеквизиты.Добавить("КодГосударственногоЗаказчика");
		НепроверяемыеРеквизиты.Добавить("ПорядковыйНомер");
		НепроверяемыеРеквизиты.Добавить("ДополнительныеРазряды");

		Если ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций") Тогда
			ПроверяемыеРеквизиты.Добавить("Организация");
		КонецЕсли;

	КонецЕсли;

	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);

КонецПроцедуры
