//++ Гурьев_ЧТЗ_2.10

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//БИТ_Гурьев__18.12.24++
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Реализация = Объект.ДокументОснование;
		
		Если ЗначениеЗаполнено(Реализация) Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	СчетФактураВыданныйДокументыОснования.Ссылка КАК Ссылка,
			|	СчетФактураВыданныйДокументыОснования.ДокументОснование КАК ДокументОснование
			|ИЗ
			|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
			|		ПО (СчетФактураВыданныйДокументыОснования.Ссылка = СчетФактураВыданный.Ссылка)
			|ГДЕ
			|	СчетФактураВыданныйДокументыОснования.ДокументОснование = &ДокументОснование
			|	И СчетФактураВыданный.Проведен = ИСТИНА";
			
			Запрос.УстановитьПараметр("ДокументОснование", Реализация);
			РезультатЗапроса = Запрос.Выполнить();
			
			Если РезультатЗапроса.Пустой() Тогда
				
				Отказ = Истина;
				ОбщегоНазначения.СообщитьПользователю("Невозможно создать пропуск на выезд. На основании реализации не введена счет-фактура.");
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	//БИТ_Гурьев__18.12.24--
	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
КонецПроцедуры
