
&После("ПриКопировании")
Процедура КАНАТ_ПриКопировании(ОбъектКопирования)
	//++ Гурьев 27.09.23 ЧТЗ_К1_v3.2
	КАНАТ_ПоказателиНТД.Очистить();
	//-- Гурьев 27.09.23 ЧТЗ_К1_v3.2
	
	// <+БИТ> Руденков_Е.И. 26.02.2024 
	// #000000054, ЧТЗ_3_8 Артикул=код
	КАНАТ_НеГенерироватьАртикул	= Ложь;
	КАНАТ_ТекстДублиАртикулов	= "";
	// <-БИТ> Руденков_Е.И. 26.02.2024
	
КонецПроцедуры

&После("ПередЗаписью")
Процедура КАНАТ_ПередЗаписью(Отказ)
	
	// <+БИТ> Руденков_Е.И. 26.02.2024 
	// #000000054, ЧТЗ_3_8 Артикул=код
	
	////++БИТ_Гурьев_Задача_54_05.02.24
	//Если Не ЗначениеЗаполнено(Артикул) Тогда
	//	
	//	Артикул = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Код, Истина, Истина);
	//	
	//КонецЕсли;
	////--БИТ_Гурьев_Задача_54_05.02.24
	
	//VVLarionov_1095_fix_09.09.24	
	//Если Не ЭтоГРуппа Тогда
	//	Если Не ЗначениеЗаполнено(Артикул) И Не КАНАТ_НеГенерироватьАртикул Тогда
	//		Артикул = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Код, Истина, Истина);
	//	КонецЕсли;
	//	
	//	КАНАТ_НеГенерироватьАртикул = Ложь;
	//	Если ЭтоНовый() Или Артикул <> Ссылка.Артикул Тогда
	//		ПорверитьАртикулНоменклатуры(Артикул,Отказ);
	//	КонецЕсли;	
	//КонецЕсли;
	//VVLarionov_1095_fix_09.09.24	// <-БИТ> Руденков_Е.И. 26.02.2024
	
КонецПроцедуры

// <+БИТ> Руденков_Е.И. 26.02.2024 
// #000000054, ЧТЗ_3_8 Артикул=код
//Проверяет артикул номенклатуры на наличие дублей
//Возвращает значение Истина, если найдены ошибки заполнения
Процедура ПорверитьАртикулНоменклатуры(текАртикул,Отказ)Экспорт
	
	//Если текАртикул = "" Тогда
	//	КАНАТ_ТекстДублиАртикулов = "";
	//	Возврат;
	//КонецЕсли;
	//
	//ТекстДублиАртикулов = "";
	//
	//УстановитьПривилегированныйРежим(Истина);
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	Номенклатура.Представление КАК Представление,
	//|	Номенклатура.Артикул КАК Артикул,
	//|	Номенклатура.Ссылка КАК Ссылка,
	//|	Номенклатура.Код КАК Код
	//|ИЗ
	//|	Справочник.Номенклатура КАК Номенклатура
	//|ГДЕ
	//|	НЕ Номенклатура.ПометкаУдаления
	//|	И Номенклатура.Артикул = &Артикул
	//|	И Номенклатура.Ссылка <> &Ссылка";
	//
	//Запрос.УстановитьПараметр("Артикул"	,текАртикул);
	//Запрос.УстановитьПараметр("Ссылка"	,Ссылка);
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//Если Не РезультатЗапроса.Пустой() Тогда
	//	ТекстДублиАртикулов = "Значение данного артикула не уникально. Аналогичное уже используется в:";
	//	
	//	Выборка = РезультатЗапроса.Выбрать();
	//	Пока Выборка.Следующий() Цикл
	//		ТекстДублиАртикулов = ТекстДублиАртикулов + Символы.ПС + Выборка.Представление 
	//						+ ", код " + Выборка.Код;
	//	КонецЦикла;
	//	
	//	ТекстДублиАртикулов = ТекстДублиАртикулов + Символы.ПС + "Записать документ с таким значением артикула?";
	//	
	//	КАНАТ_ТекстДублиАртикулов = ТекстДублиАртикулов;
	//КонецЕсли;
	//
	//УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры // <-БИТ> Руденков_Е.И. 26.02.2024