&НаСервере
Процедура КАНАТ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//БИТ_Гурьев_ЧТЗ_3.2_05.04.24++
	//Команда создания технологической спецификации
	КомандаСоздатьСборкаТехнологическая = ЭтаФорма.Команды.Добавить("КАНАТ_СоздатьСборкаТехнологическая");
	КомандаСоздатьСборкаТехнологическая.Заголовок = "Изготовление, сборка (технологическая)";
	КомандаСоздатьСборкаТехнологическая.Действие = "КАНАТ_СоздатьСборкаТехнологическая";
	
	КнопкаСоздатьСборкаТехнологическая = Элементы.Добавить("КАНАТ_СоздатьСборкаТехнологическая", Тип("КнопкаФормы"), Элементы.ПодменюСоздать);
	КнопкаСоздатьСборкаТехнологическая.Заголовок = "Изготовление, сборка (технологическая)";
	КнопкаСоздатьСборкаТехнологическая.ИмяКоманды = "КАНАТ_СоздатьСборкаТехнологическая";
	
	//БИТ_Гурьев_ЧТЗ_3.2_05.04.24--
КонецПроцедуры

//БИТ_Гурьев_ЧТЗ_3.2_05.04.24++
&НаКлиенте
Процедура КАНАТ_СоздатьСборкаТехнологическая(Команда)
	
	ТекущиеДанные   = Элементы.Список.ТекущиеДанные;
	ТекущийРодитель = ПредопределенноеЗначение("Справочник.РесурсныеСпецификации.ПустаяСсылка");
	
	Если Элементы.Список.Отображение = ОтображениеТаблицы.ИерархическийСписок Тогда
		ТекущийРодитель = Элементы.Список.ТекущийРодитель;
	ИначеЕсли Элементы.Список.Отображение = ОтображениеТаблицы.Дерево И ТекущиеДанные <> Неопределено Тогда
		Если ТекущиеДанные.ЭтоГруппа Тогда
			ТекущийРодитель = ТекущиеДанные.Ссылка;
		Иначе
			ТекущийРодитель = ТекущиеДанные.Родитель;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущийРодитель) 
		И ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(ТекущийРодитель,"КАНАТ_ТехнологическаяСпецификация") Тогда
	
		ЗначенияЗаполнения = Новый Структура("КАНАТ_ТехнологическаяСпецификация,Родитель",
											 Истина,
											 ТекущийРодитель);
	Иначе
		
		КорневаяГруппа = КАНАТ_ПолучитьКорневуюГруппуТехнологическую();
		
		Если ЗначениеЗаполнено(КорневаяГруппа) Тогда
		
			ЗначенияЗаполнения = Новый Структура("КАНАТ_ТехнологическаяСпецификация,Родитель",
												 Истина,
												 КАНАТ_ПолучитьКорневуюГруппуТехнологическую());
		Иначе
		
			Сообщение = Новый СообщениеПользователю;
			
			Сообщение.Текст = "Корневая группа для технологической спецификации не найдена.";
			Сообщение.Сообщить();
			
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	
	ОткрытьФорму("Справочник.РесурсныеСпецификации.ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения));
	
КонецПроцедуры //БИТ_Гурьев_ЧТЗ_3.2_05.04.24--

//БИТ_Гурьев_ЧТЗ_3.2_08.04.24++
&НаСервере
Функция КАНАТ_ПолучитьКорневуюГруппуТехнологическую()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РесурсныеСпецификации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.РесурсныеСпецификации КАК РесурсныеСпецификации
		|ГДЕ
		|	РесурсныеСпецификации.КАНАТ_ТехнологическаяСпецификация = ИСТИНА
		|	И РесурсныеСпецификации.ЭтоГруппа = ИСТИНА
		|	И РесурсныеСпецификации.ПометкаУдаления = ЛОЖЬ
		|	И РесурсныеСпецификации.Родитель = ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		Возврат Справочники.РесурсныеСпецификации.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции //БИТ_Гурьев_ЧТЗ_3.2_08.04.24--

&НаКлиенте
&ИзменениеИКонтроль("УстановитьСтатусСпецификации")
Процедура КАНАТ_УстановитьСтатусСпецификации(ЗначениеСтатуса, ПредставлениеСтатуса)

	ВыделенныеСсылки = ОбщегоНазначенияУТКлиент.ПроверитьПолучитьВыделенныеВСпискеСсылки(Элементы.Список);
    #Вставка
	//БИТ_Гурьев_ЧТЗ_3.2_09.04.24++
	ПрисутствуютТехнологическиеСпецификации = Ложь;
	
	КАНАТ_УдалитьТехнологическиеСпецификации(ВыделенныеСсылки, ПрисутствуютТехнологическиеСпецификации);
	
	Если ПрисутствуютТехнологическиеСпецификации Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Невозможно изменить статус у технологических спецификаций";
		Сообщение.Сообщить();
	КонецЕсли;
	//БИТ_Гурьев_ЧТЗ_3.2_09.04.24--
	#КонецВставки
	УправлениеДаннымиОбИзделияхКлиент.УстановитьСтатусСпецификаций(ЗначениеСтатуса, ПредставлениеСтатуса, ВыделенныеСсылки);

КонецПроцедуры

//БИТ_Гурьев_ЧТЗ_3.2_09.04.24++
&НаСервере
Процедура КАНАТ_УдалитьТехнологическиеСпецификации(ВыделенныеСсылки, ПрисутствуютТехнологическиеСпецификации)
	
	ВыделенныеСсылкиБезТехнологических = Новый Массив;
	Для Каждого РесурснаяСпецификация Из ВыделенныеСсылки Цикл
		
		Если РесурснаяСпецификация.КАНАТ_ТехнологическаяСпецификация Тогда
			
			ПрисутствуютТехнологическиеСпецификации = Истина;
			
		Иначе
			
			ВыделенныеСсылкиБезТехнологических.Добавить(РесурснаяСпецификация);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ВыделенныеСсылки = ВыделенныеСсылкиБезТехнологических;
	
	
КонецПроцедуры //БИТ_Гурьев_ЧТЗ_3.2_09.04.24--

&НаКлиенте
Процедура КАНАТ_СписокПроверкаПеретаскиванияПосле(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	// Вставить содержимое обработчика.
КонецПроцедуры
//++Бит_Трейгер П.М. 23.10.2024
&НаКлиенте
Процедура КАНАТ_Бит_ГрупповоеСозданиеСпецификацииПосле(Команда)
	 ОткрытьФорму("Обработка.КАНАТ_ГрупповоеСозданиеСпецификации.Форма.Форма");	
КонецПроцедуры
//--Бит_Трейгер П.М. 23.10.2024