Функция ПараметрыСтолбцов(НазваниеОтчета)
	
	Результат = Новый Массив();
	Если НазваниеОтчета = "ОтчетПоИспытаниямГотовойПродукцииОбщий" Тогда
		
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.ЛинейнаяПлотность);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.Диаметр);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.ЧислоВитковНа1м);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.РазрывнаяНагрузка);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.УдельнаяРазрывнаяНагрузка);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.Удлинение75);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.УдлинениеПриРазрыве);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.КоэффициентВариацииCt);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.КоэффициентВариацииCd);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.КоэффициентВариацииCp);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.КоэффициентВариацииCk);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.ПодъемнаяПотопляющаяСила);
		
	ИначеЕсли НазваниеОтчета = "ОтчетПоИспытаниямГотовойПродукцииЦех" Тогда
		
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.ЛинейнаяПлотность);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.Диаметр);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.ЧислоВитковНа1м);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.РазрывнаяНагрузка);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.УдельнаяРазрывнаяНагрузка);
		
	ИначеЕсли НазваниеОтчета = "ОтчетКанатыДляЛазания" Тогда
		
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.Диаметр);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.ДлинаКаната);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.НадежностьКрепленияКанатаL1);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.НадежностьКрепленияКанатаL2);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.РазрывнаяНагрузка);
		
	ИначеЕсли НазваниеОтчета = "ОтчетПетлиСтраховочныеАрамидные" Тогда
		
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.Диаметр);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.ВысотаПлетения);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.ДлинаПетли);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.МассаПетли);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.ОтносительноеУдлинениеПриНагрузке);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.РазрывнаяНагрузка);
		
	ИначеЕсли НазваниеОтчета = "ОтчетСтропы" Тогда
		
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.Диаметр);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.ВысотаПлетения);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.РабочаяДлинаСтропа);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.МассаСтропа);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.ОтносительноеУдлинениеПриНагрузкеСГС);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.РазрывнаяНагрузка);
		
	ИначеЕсли НазваниеОтчета = "ОтчетПолуфабрикаты" Тогда
		
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.ЛинейнаяПлотность);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.Диаметр);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.ВиткиНа1м);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.РазрывнаяНагрузка);
		
	ИначеЕсли НазваниеОтчета = "ОтчетНитиSisol" Тогда
		
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.НомЛинПлотностьНити);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.ФактЛинПлотностьНитиСР);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.ФактЛинПлотностьНитиMinMax);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.РазрывнаяНагрузка);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.УдлинениеПриРазрыве);
		
	ИначеЕсли НазваниеОтчета = "ОтчетПоИспытаниямГотовойПродукцииСДатой" Тогда
		
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.ЛинейнаяПлотность);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.Диаметр);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.ЧислоВитковНа1м);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.РазрывнаяНагрузка);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.УдельнаяРазрывнаяНагрузка);
		
	ИначеЕсли НазваниеОтчета = "ОтчетНитиSisolСДатами" Тогда
		
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.НомЛинПлотностьНити);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.ФактЛинПлотностьНитиСР);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.ФактЛинПлотностьНитиMinMax);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.РазрывнаяНагрузка);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.УдлинениеПриРазрыве);
		
	ИначеЕсли НазваниеОтчета = "ОтчетСетематериалы" Тогда
		
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.ФабричныйРазмерЯчеи);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.РазрывнаяНагрузка);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.РасходНиткиНаУзел);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.КВПоРазрывнойНагрузке);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.КВПоШагуЯчеи);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.УсадкаТехнологическая);
		
	ИначеЕсли НазваниеОтчета = "ОтчетВеревкиСтраховочноСпасательные" Тогда
		
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.Диаметр);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.Масса1м);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.МассаОплетки);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.МассаСердечника);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.КоэфУзлования);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.СдвигОплетки);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.УдлинениеПодНагрузкой50150);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.УдлинениеПодНагрузкой80);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.МаксимальнаяСилаРывка03);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.МаксимальнаяСилаРывка177);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.КоличествоРывковДоРазрыва1);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.КоличествоРывковДоРазрыва177);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.УстойчивостьВеревкиСУзлом8);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.Усадка);
		Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.РазрывнаяНагрузка);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПараметрыЗапроса(Параметры, НазваниеОтчета)
	
	ПараметрыЗапроса = Новый Структура;
	Если НазваниеОтчета = "ОтчетПоИспытаниямГотовойПродукцииОбщий" Тогда
		
		ВидыДляОтчета = Новый Массив;
		//ВидыДляОтчета.Добавить(Перечисления.КАНАТКач_ВидКачестваДляОтчета.ВеревкиСтраховочноСпасательные);
		ВидыДляОтчета.Добавить(Перечисления.КАНАТКач_ВидКачестваДляОтчета.КанатыДляЛазания);
		ВидыДляОтчета.Добавить(Перечисления.КАНАТКач_ВидКачестваДляОтчета.ПетлиСтраховочныеТермостойкиеАрамидные);
		ВидыДляОтчета.Добавить(Перечисления.КАНАТКач_ВидКачестваДляОтчета.ПрочаяГотоваяПродукция);
		ВидыДляОтчета.Добавить(Перечисления.КАНАТКач_ВидКачестваДляОтчета.СтропыГрузовыеСинтетическиеШнуровыеКольцевые);
		
		ПараметрыЗапроса.Вставить("Период",       Параметры.Период);
		ПараметрыЗапроса.Вставить("ВидДляОтчета", ВидыДляОтчета);
		
	ИначеЕсли НазваниеОтчета = "ОтчетПоИспытаниямГотовойПродукцииЦех" Тогда
		
		ВидыДляОтчета = Новый Массив;
		ВидыДляОтчета.Добавить(Перечисления.КАНАТКач_ВидКачестваДляОтчета.ВеревкиСтраховочноСпасательные);
		ВидыДляОтчета.Добавить(Перечисления.КАНАТКач_ВидКачестваДляОтчета.КанатыДляЛазания);
		ВидыДляОтчета.Добавить(Перечисления.КАНАТКач_ВидКачестваДляОтчета.ПетлиСтраховочныеТермостойкиеАрамидные);
		ВидыДляОтчета.Добавить(Перечисления.КАНАТКач_ВидКачестваДляОтчета.ПрочаяГотоваяПродукция);
		ВидыДляОтчета.Добавить(Перечисления.КАНАТКач_ВидКачестваДляОтчета.НитиППсЭкструзионнойЛинииSisol);
		ВидыДляОтчета.Добавить(Перечисления.КАНАТКач_ВидКачестваДляОтчета.СтропыГрузовыеСинтетическиеШнуровыеКольцевые);
		
		ПараметрыЗапроса.Вставить("Период",       Параметры.Период);
		ПараметрыЗапроса.Вставить("Цех",          Параметры.Цех);
		ПараметрыЗапроса.Вставить("ВидДляОтчета", ВидыДляОтчета);
		
	ИначеЕсли НазваниеОтчета = "ОтчетКанатыДляЛазания" Тогда
		
		ВидыДляОтчета = Новый Массив;
		ВидыДляОтчета.Добавить(Перечисления.КАНАТКач_ВидКачестваДляОтчета.КанатыДляЛазания);
		
		ПараметрыЗапроса.Вставить("Период",       Параметры.Период);
		ПараметрыЗапроса.Вставить("ВидДляОтчета", ВидыДляОтчета);
		
	ИначеЕсли НазваниеОтчета = "ОтчетПетлиСтраховочныеАрамидные" Тогда
		
		ВидыДляОтчета = Новый Массив;
		ВидыДляОтчета.Добавить(Перечисления.КАНАТКач_ВидКачестваДляОтчета.ПетлиСтраховочныеТермостойкиеАрамидные);
		
		ПараметрыЗапроса.Вставить("Период",       Параметры.Период);
		ПараметрыЗапроса.Вставить("ВидДляОтчета", ВидыДляОтчета);
		
	ИначеЕсли НазваниеОтчета = "ОтчетСтропы" Тогда
		
		ВидыДляОтчета = Новый Массив;
		ВидыДляОтчета.Добавить(Перечисления.КАНАТКач_ВидКачестваДляОтчета.СтропыГрузовыеСинтетическиеШнуровыеКольцевые);
		
		ПараметрыЗапроса.Вставить("Период",       Параметры.Период);
		ПараметрыЗапроса.Вставить("ВидДляОтчета", ВидыДляОтчета);
		
	ИначеЕсли НазваниеОтчета = "ОтчетПолуфабрикаты" Тогда
		
		ВидыДляОтчета = Новый Массив;
		ВидыДляОтчета.Добавить(Перечисления.КАНАТКач_ВидКачестваДляОтчета.Полуфабрикаты);
		
		ПараметрыЗапроса.Вставить("Период",       Параметры.Период);
		//ПараметрыЗапроса.Вставить("Цех",          Параметры.Цех);
		ПараметрыЗапроса.Вставить("ВидДляОтчета", ВидыДляОтчета);
		
	ИначеЕсли НазваниеОтчета = "ОтчетНитиSisol" Тогда
		
		ВидыДляОтчета = Новый Массив;
		ВидыДляОтчета.Добавить(Перечисления.КАНАТКач_ВидКачестваДляОтчета.НитиППсЭкструзионнойЛинииSisol);
		
		ПараметрыЗапроса.Вставить("Период",       Параметры.Период);
		ПараметрыЗапроса.Вставить("Цех",          Параметры.Цех);
		ПараметрыЗапроса.Вставить("ВидДляОтчета", ВидыДляОтчета);
		
	ИначеЕсли НазваниеОтчета = "ОтчетПоИспытаниямГотовойПродукцииСДатой" Тогда
		
		ВидыДляОтчета = Новый Массив;
		ВидыДляОтчета.Добавить(Перечисления.КАНАТКач_ВидКачестваДляОтчета.ВеревкиСтраховочноСпасательные);
		ВидыДляОтчета.Добавить(Перечисления.КАНАТКач_ВидКачестваДляОтчета.КанатыДляЛазания);
		ВидыДляОтчета.Добавить(Перечисления.КАНАТКач_ВидКачестваДляОтчета.ПетлиСтраховочныеТермостойкиеАрамидные);
		ВидыДляОтчета.Добавить(Перечисления.КАНАТКач_ВидКачестваДляОтчета.ПрочаяГотоваяПродукция);
		ВидыДляОтчета.Добавить(Перечисления.КАНАТКач_ВидКачестваДляОтчета.НитиППсЭкструзионнойЛинииSisol);
		ВидыДляОтчета.Добавить(Перечисления.КАНАТКач_ВидКачестваДляОтчета.СтропыГрузовыеСинтетическиеШнуровыеКольцевые);
		
		ПараметрыЗапроса.Вставить("Период",       Параметры.Период);
		ПараметрыЗапроса.Вставить("ВидДляОтчета", ВидыДляОтчета);
		
	ИначеЕсли НазваниеОтчета = "ОтчетНитиSisolСДатами" Тогда
		
		ВидыДляОтчета = Новый Массив;
		ВидыДляОтчета.Добавить(Перечисления.КАНАТКач_ВидКачестваДляОтчета.НитиППсЭкструзионнойЛинииSisol);
		
		ПараметрыЗапроса.Вставить("Период",       Параметры.Период);
		ПараметрыЗапроса.Вставить("Цех",          Параметры.Цех);
		ПараметрыЗапроса.Вставить("ВидДляОтчета", ВидыДляОтчета);
		
	ИначеЕсли НазваниеОтчета = "ОтчетСетематериалы" Тогда
		
		ВидыДляОтчета = Новый Массив;
		ВидыДляОтчета.Добавить(Перечисления.КАНАТКач_ВидКачестваДляОтчета.Сетематериалы);
		
		ПараметрыЗапроса.Вставить("Период",       Параметры.Период);
		ПараметрыЗапроса.Вставить("ВидДляОтчета", ВидыДляОтчета);
		
	ИначеЕсли НазваниеОтчета = "ОтчетВеревкиСтраховочноСпасательные" Тогда
		
		ВидыДляОтчета = Новый Массив;
		ВидыДляОтчета.Добавить(Перечисления.КАНАТКач_ВидКачестваДляОтчета.ВеревкиСтраховочноСпасательные);
		
		ПараметрыЗапроса.Вставить("Период",       Параметры.Период);
		ПараметрыЗапроса.Вставить("ВидДляОтчета", ВидыДляОтчета);
		
	КонецЕсли;
	
	Возврат ПараметрыЗапроса;
	
КонецФункции

Функция ДанныеДляОтчета(Параметры, НазваниеОтчета) Экспорт
	
	ПараметрыЗапроса = ПолучитьПараметрыЗапроса(Параметры, НазваниеОтчета);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	КАНАТ_РезультатИспытаний.Продукция.Код КАК ПродукцияКод,
	               |	КАНАТ_РезультатИспытаний.Цех КАК Цех,
	               |	КАНАТ_РезультатИспытаний.Оборудование КАК Оборудование,
	               |	КАНАТ_РезультатИспытаний.Влажность КАК Влажность,
	               |	КАНАТ_РезультатИспытаний.Результат КАК Результат,
	               |	ВложенныйЗапрос.Факт КАК Факт,
	               |	ВложенныйЗапрос.ПараметрОтчетов КАК ПараметрОтчетов,
	               |	КАНАТ_РезультатИспытаний.Ссылка КАК Ссылка,
	               |	ВложенныйЗапрос.ЕдИзм КАК ЕдИзм,
	               |	НАЧАЛОПЕРИОДА(КАНАТ_РезультатИспытаний.Дата, ДЕНЬ) КАК Дата,
	               |	КАНАТ_РезультатИспытаний.Продукция.НаименованиеПолное КАК ПродукцияНаименование
	               |ИЗ
	               |	Документ.КАНАТ_РезультатИспытаний КАК КАНАТ_РезультатИспытаний
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			КАНАТ_РезультатИспытанийРезультатИспытаний.Ссылка КАК Ссылка,
	               |			КАНАТ_РезультатИспытанийРезультатИспытаний.Факт КАК Факт,
	               |			КАНАТКач_СоответствиеПоказателейНТДКолонкамОтчетов.ПараметрОтчетов КАК ПараметрОтчетов,
	               |			КАНАТ_РезультатИспытанийРезультатИспытаний.ЕдИзм КАК ЕдИзм
	               |		ИЗ
	               |			Документ.КАНАТ_РезультатИспытаний.РезультатИспытаний КАК КАНАТ_РезультатИспытанийРезультатИспытаний
	               |				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КАНАТКач_СоответствиеПоказателейНТДКолонкамОтчетов КАК КАНАТКач_СоответствиеПоказателейНТДКолонкамОтчетов
	               |				ПО КАНАТ_РезультатИспытанийРезультатИспытаний.Показатель = КАНАТКач_СоответствиеПоказателейНТДКолонкамОтчетов.Показатель
	               |		ГДЕ
	               |			КАНАТКач_СоответствиеПоказателейНТДКолонкамОтчетов.ПараметрОтчетов В(&МассивПараметров)
	               |			И КАНАТКач_СоответствиеПоказателейНТДКолонкамОтчетов.ВидДляОтчета В(&ВидДляОтчета)) КАК ВложенныйЗапрос
	               |		ПО КАНАТ_РезультатИспытаний.Ссылка = ВложенныйЗапрос.Ссылка
	               |ГДЕ
	               |	КАНАТ_РезультатИспытаний.Проведен = ИСТИНА";
	
	Если ПараметрыЗапроса.Свойство("Период") Тогда
		Запрос.Текст = Запрос.Текст + "
	               |	И КАНАТ_РезультатИспытаний.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";
	КонецЕсли; 
	
	Если ПараметрыЗапроса.Свойство("Цех") Тогда
		Запрос.Текст = Запрос.Текст + "
	               |	И КАНАТ_РезультатИспытаний.Цех = &Цех";
	КонецЕсли;
	
	Если ТипЗнч(ПараметрыЗапроса.ВидДляОтчета) = Тип("Массив") Тогда
		Запрос.Текст = Запрос.Текст + "
	               |	И КАНАТ_РезультатИспытаний.ВидГотовойПродукцииИспытания.ВидДляОтчета В (&ВидДляОтчета)";
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата
	               |ИТОГИ
	               |	МАКСИМУМ(ПродукцияКод),
	               |	МАКСИМУМ(ПродукцияНаименование),
	               |	МАКСИМУМ(Цех),
	               |	МАКСИМУМ(Оборудование),
	               |	МАКСИМУМ(Влажность),
	               |	МАКСИМУМ(Результат)
	               |ПО  
	               |	Цех,
				   |	Дата,
	               |	Ссылка";
	
	Запрос.УстановитьПараметр("МассивПараметров", ПараметрыСтолбцов(НазваниеОтчета));
	Если ПараметрыЗапроса.Свойство("Период") Тогда
		Запрос.УстановитьПараметр("ДатаНачала", ПараметрыЗапроса.Период.ДатаНачала);
		Запрос.УстановитьПараметр("ДатаОкончания", ПараметрыЗапроса.Период.ДатаОкончания);
	КонецЕсли;
	Если ПараметрыЗапроса.Свойство("Цех") Тогда
		Запрос.УстановитьПараметр("Цех", ПараметрыЗапроса.Цех);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ВидДляОтчета", ПараметрыЗапроса.ВидДляОтчета);

	
	Возврат Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);;
	
КонецФункции

