// <+БИТ> Руденков_Е.И. 08.08.2024  
// ЧТЗ ШК-1 Канат Процесс штрихкодирования
&НаСервере
Процедура КАНАТ_ПриСозданииНаСервереВместо(Отказ, СтандартнаяОбработка)
	
	Элементы.НачатьПриемку.Видимость = Параметры.ТипДокумента = 1;
	Элементы.НачатьОтгрузку.Видимость = Параметры.ТипДокумента = 2;
				
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры.СтруктураЗаполнения); 
	
	Если Параметры.ТипДокумента = 1 Тогда
		Распоряжение = Параметры.СтруктураЗаполнения.Распоряжение;	
		РезультатЗапроса = 
			Обработки.МобильноеРабочееМестоКладовщика.СписокТоваровНаОтгрузкуПриемку(Параметры.ТипДокумента, Распоряжение);
	Иначе
		// <+БИТ> Руденков_Е.И. 08.08.2024  
		// ЧТЗ ШК-1 Канат Процесс штрихкодирования
		//РаспоряжениеОтрузка = Параметры.СтруктураЗаполнения.Распоряжение;
		//РезультатЗапроса = 
		//	Обработки.МобильноеРабочееМестоКладовщика.СписокТоваровНаОтгрузкуПриемку(Параметры.ТипДокумента, РаспоряжениеОтрузка);
			
		РаспоряжениеОтгрузка = Параметры.СтруктураЗаполнения.Распоряжение;
		РезультатЗапроса = 
			Обработки.МобильноеРабочееМестоКладовщика.СписокТоваровНаОтгрузкуПриемку(Параметры.ТипДокумента, РаспоряжениеОтгрузка);
		// <-БИТ> Руденков_Е.И. 08.08.2024
	КонецЕсли;
		
	Товары.Загрузить(РезультатЗапроса);

	ПоказыватьФотоТоваров = Параметры.ПоказыватьФотоТоваров;
	
КонецПроцедуры // <-БИТ> Руденков_Е.И. 08.08.2024





