
&ИзменениеИКонтроль("ЗаполнитьТабличныйДокументУПД")
Процедура КАНАТ_ЗаполнитьТабличныйДокументУПД(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати)
	
	ВыводитьСерии = Константы.ВыводитьСерииВПечатныхФормах.Получить() 
					И ДанныеДляПечати.РезультатПоТабличнойЧасти.Колонки.Найти("СерияНаименование") <> Неопределено;
	ИспользоватьПечатныеФормыСФ2_5 = Ложь;
	
	МакетУПД = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьОбщихФорм.ПФ_MXL_УниверсальныйПередаточныйДокумент_ru");
	МакетУПД_625 = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьОбщихФорм.ПФ_MXL_УниверсальныйПередаточныйДокумент_625_ru");
	МакетУПД_981 = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьОбщихФорм.ПФ_MXL_УниверсальныйПередаточныйДокумент981_ru");
	МакетУПД_534 = УправлениеПечатью.МакетПечатнойФормы(
						"Обработка.ПечатьОбщихФорм.ПФ_MXL_УниверсальныйПередаточныйДокумент534_ru");
	МакетУПД_534_2_5 = УправлениеПечатью.МакетПечатнойФормы(
						"ОбщийМакет.ПФ_MXL_УниверсальныйПередаточныйДокумент534");
	МакетУПД_534Прослеж_2_5 = УправлениеПечатью.МакетПечатнойФормы(
						"ОбщийМакет.ПФ_MXL_УниверсальныйПередаточныйДокумент534Прослеж");
	МакетУПД2023Кв4Прослеж = УправлениеПечатью.МакетПечатнойФормы(
						"ОбщийМакет.ПФ_MXL_УниверсальныйПередаточныйДокумент2023Кв4Прослеж");
	МакетУПД_1096 = УправлениеПечатью.МакетПечатнойФормы(
						"Обработка.ПечатьОбщихФорм.ПФ_MXL_УниверсальныйПередаточныйДокумент1096_ru");
	МакетУПД_1096_2_5 = УправлениеПечатью.МакетПечатнойФормы(
						"ОбщийМакет.ПФ_MXL_УниверсальныйПередаточныйДокумент1096");
	МакетУПД_1096Прослеж_2_5 = УправлениеПечатью.МакетПечатнойФормы(
						"ОбщийМакет.ПФ_MXL_УниверсальныйПередаточныйДокумент1096Прослеж");
	
	ОпцииПечати = Новый Структура;
	ОпцииПечати.Вставить("НомерСформированВСчетеФактуре", ДанныеДляПечати.Свойство("НомерСформированВСчетеФактуре"));
	ОпцииПечати.Вставить("ИспользоватьПечатныеФормыСФ2_5", ИспользоватьПечатныеФормыСФ2_5);
	
	ДанныеПечати        = ДанныеДляПечати.РезультатПоШапке.Выбрать();
	ВыборкаПоДокументам = ДанныеДляПечати.РезультатПоТабличнойЧасти.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Если ДанныеДляПечати.Свойство("РезультатПоКонтрагентам") Тогда
		ВыборкаКонтрагентов = ДанныеДляПечати.РезультатПоКонтрагентам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Иначе
		ВыборкаКонтрагентов = Неопределено;
	КонецЕсли;
	Если ДанныеДляПечати.Свойство("РезультатПоИсходнымДанным") Тогда
		ВыборкаОснований = ДанныеДляПечати.РезультатПоИсходнымДанным.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Иначе
		ВыборкаОснований = Неопределено;
	КонецЕсли;
	ПрослеживаемыеОС = Неопределено;
	ПрослеживаемыеКомплектующие = Неопределено;
	ЕстьПрослеживаемыеТоварыВТабличнойЧасти = Ложь;
	Если ДанныеДляПечати.Свойство("Прослеживаемость") Тогда
		ПрослеживаемыеОС = ДанныеДляПечати.Прослеживаемость.Выгрузить();
		Если ПрослеживаемыеОС.Количество() > 0 Тогда
			ЕстьПрослеживаемыеТоварыВТабличнойЧасти = Истина;
		Иначе
			ПрослеживаемыеОС = Неопределено;
		КонецЕсли;
	КонецЕсли;
	Если ДанныеДляПечати.Свойство("ПрослеживаемыеКомплектующие") Тогда
		ПрослеживаемыеКомплектующие = ДанныеДляПечати.ПрослеживаемыеКомплектующие;
		Если ПрослеживаемыеКомплектующие.Количество() > 0 Тогда
			ЕстьПрослеживаемыеТоварыВТабличнойЧасти = Истина;
		Иначе
			ПрослеживаемыеКомплектующие = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	ЕстьПостановление1096 = ЛОЖЬ;
	ЕстьПостановление534 = ЛОЖЬ;
	ЕстьПостановление981 = ЛОЖЬ;
	ЕстьПостановление1137_625 = ЛОЖЬ;
	ЕстьПостановление1137 = ЛОЖЬ;
	
	ПервыйДокумент = Истина;
	Пока ДанныеПечати.Следующий() Цикл
		
		Если ДанныеПечати.СтатусУПД = 2
			И ЗначениеЗаполнено(ДанныеПечати.НалогообложениеНДС)
			И ДанныеПечати.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС
			И НЕ ДанныеПечати.ЭтоПередачаНаКомиссию
			И ДанныеПечати.ТребуетсяНаличиеСФ Тогда
			
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Для документа %1 не введен %2';
					|en = '%2 is not entered for document %1'"),
				ДанныеПечати.Ссылка,
				ДанныеПечати.ПредставлениеДокумента);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				Текст,
				ДанныеПечати.Ссылка,
				,
				"ТекстСчетФактура");
				
			Продолжить;
		КонецЕсли;
		
		Действует2023Кв4 = Действует2023Кв4(ДанныеПечати.Дата, ДанныеПечати.ДатаИсправления);
		
		Если ДействуетПостановление1096(ДанныеПечати.Дата, ДанныеПечати.ДатаИсправления) Тогда
			ИспользоватьПечатныеФормыСФ2_5 = ПолучитьФункциональнуюОпцию("ИспользоватьПечатныеФормыСФ2_5");
			Если ИспользоватьПечатныеФормыСФ2_5 Тогда
				ОпцииПечати.ИспользоватьПечатныеФормыСФ2_5 = ИспользоватьПечатныеФормыСФ2_5;
				Если ЗначениеЗаполнено(ДанныеПечати.ЕстьПрослеживаемыеТовары) И ДанныеПечати.ЕстьПрослеживаемыеТовары Или ЕстьПрослеживаемыеТоварыВТабличнойЧасти Тогда
					Макет = МакетУПД_1096Прослеж_2_5;
				Иначе
					Макет = МакетУПД_1096_2_5;
				КонецЕсли;
			Иначе
				Макет = МакетУПД_1096;
			КонецЕсли;
			ЕстьПостановление1096 = Истина;
		ИначеЕсли ДействуетПостановление534(ДанныеПечати.Дата, ДанныеПечати.ДатаИсправления) Тогда
			ИспользоватьПечатныеФормыСФ2_5 = ПолучитьФункциональнуюОпцию("ИспользоватьПечатныеФормыСФ2_5");
			Если ИспользоватьПечатныеФормыСФ2_5 Тогда
				ОпцииПечати.ИспользоватьПечатныеФормыСФ2_5 = ИспользоватьПечатныеФормыСФ2_5;
				Если ЗначениеЗаполнено(ДанныеПечати.ЕстьПрослеживаемыеТовары) И ДанныеПечати.ЕстьПрослеживаемыеТовары Или ЕстьПрослеживаемыеТоварыВТабличнойЧасти Тогда
					Макет = ?(Действует2023Кв4, МакетУПД2023Кв4Прослеж, МакетУПД_534Прослеж_2_5);
				Иначе
					Макет = МакетУПД_534_2_5;
				КонецЕсли;
			Иначе
				Макет = МакетУПД_534;
			КонецЕсли;
			ЕстьПостановление534 = Истина;
		ИначеЕсли ДействуетПостановление981(ДанныеПечати.Дата, ДанныеПечати.ДатаИсправления) Тогда
			Макет = МакетУПД_981;
			ЕстьПостановление981 = Истина;
		ИначеЕсли ВедетсяУчетНДСПоФЗ56(ДанныеПечати.Дата, ДанныеПечати.ДатаИсправления) Тогда
			Макет = МакетУПД_625;
			ЕстьПостановление1137_625 = Истина;
		Иначе
			Макет = МакетУПД;
			ЕстьПостановление1137 = Истина;
		КонецЕсли;
		Макет.КодЯзыка = Метаданные.Языки.Русский.КодЯзыка;
		
		Если ЕстьПостановление1137_625 И ЕстьПостановление1137 Тогда
			
			Текст = НСтр("ru = 'Недоступна одновременная печать универсальных передаточных документов,
				|сформированных до и после начала применения постановления Правительства РФ №625 от 25 мая 2017 г.';
				|en = 'Cannot print universal transfer documents
				|generated both before and after the commencement date of RF Government decree No.625 dated 05/25/2017 at the same time'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				Текст,
				ДанныеПечати.Ссылка);
			
			ТабличныйДокумент.Очистить();
			Прервать;
			
		КонецЕсли;
		
		Если (ЕстьПостановление1137_625 ИЛИ ЕстьПостановление1137) И ЕстьПостановление981 Тогда
			
			Текст = НСтр("ru = 'Недоступна одновременная печать универсальных передаточных документов,
				|сформированных до и после начала применения постановления Правительства РФ №981 от 19 августа 2017 г.';
				|en = 'Cannot print universal transfer documents
				|generated both before and after the commencement date of RF Government decree No.981 dated 08/19/2017 at the same time'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				Текст,
				ДанныеПечати.Ссылка);
			
			ТабличныйДокумент.Очистить();
			Прервать;
		
		ИначеЕсли (ЕстьПостановление1137_625 Или ЕстьПостановление1137 Или ЕстьПостановление981)
				И ЕстьПостановление534 Тогда
			
			ТекстСообщения = НСтр("ru = 'Недоступна одновременная печать универсальных передаточных документов,
			|сформированных до и после начала применения постановления Правительства РФ №534 от 2 апреля 2021 г.';
			|en = 'Cannot simultaneously print universal transfer documents
			|generated before and after the commencement date of RF Government decree No.534 dated 04/02/2021'");
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ДанныеПечати.Ссылка);
			
			ТабличныйДокумент.Очистить();
			Прервать;
			
		ИначеЕсли (ЕстьПостановление1137_625 Или ЕстьПостановление1137 Или ЕстьПостановление981 Или ЕстьПостановление534)
				И ЕстьПостановление1096 Тогда
			
			ТекстСообщения = НСтр("ru = 'Недоступна одновременная печать универсальных передаточных документов,
			|сформированных до и после начала применения постановления Правительства РФ №1096 от 16 августа 2024 г.';
			|en = 'Cannot simultaneously print universal transfer documents
			|generated both before and after the commencement date of the Decree of the Russian Federation Government No. 1096 dated 08/16/2024.'");
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ДанныеПечати.Ссылка);
			
			ТабличныйДокумент.Очистить();
			Прервать;
			
		КонецЕсли;	
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Если ДанныеДляПечати.Свойство("РезультатПоПоставщикам")
			И ДанныеПечати.ПеревыставленныйСчетФактура Тогда
			ВыборкаПоставщиков = ДанныеДляПечати.РезультатПоПоставщикам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		КонецЕсли;
			
		// Выводим общие реквизиты шапки
		СведенияОбОрганизации = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Организация, ДанныеПечати.Дата);
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьШапка,
			ДанныеПечати.Ссылка);
		
		ЗаполнитьРеквизитыШапкиУПД(ДанныеПечати, СведенияОбОрганизации, ВыборкаКонтрагентов, ОбластьШапка, ВыборкаПоставщиков, ОпцииПечати);
		
		НомерСтраницы = 1;
		
		// Инициализация итогов в документе
		Если ИспользоватьПечатныеФормыСФ2_5 Тогда
			ИтоговыеСуммы = СтруктураИтоговыеСуммы2_5();
		Иначе
			ИтоговыеСуммы = СтруктураИтоговыеСуммы();
		КонецЕсли;
		
		// Создаем массив для проверки вывода
		МассивВыводимыхОбластей = Новый Массив;
		
		// Выводим многострочную часть документа
		ОбластьСтрокаСтандарт = Макет.ПолучитьОбласть("Строка");
		ОбластьИтого = Макет.ПолучитьОбласть("Итого");
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		Если ИспользоватьПечатныеФормыСФ2_5 Тогда
			ОбластьПодвалНакладной = Макет.ПолучитьОбласть("ПодвалНакладной");
		КонецЕсли;
		#Удаление
		Если ИспользоватьПечатныеФормыСФ2_5 Тогда
			ЗаполнитьРеквизитыПодвалаУПД2_5(ОбластьПодвал, ОбластьПодвалНакладной, ДанныеПечати, СведенияОбОрганизации, ВыборкаКонтрагентов);
		Иначе
			ЗаполнитьРеквизитыПодвалаУПД(ОбластьПодвал, ДанныеПечати, СведенияОбОрганизации, ВыборкаКонтрагентов);
		КонецЕсли;
		#КонецУдаления
		#Вставка
		// <+БИТ> Руденков_Е.И. 08.04.2024 
		// #000000229, Счет-фактура (УПД)
		Если ИспользоватьПечатныеФормыСФ2_5 Тогда
			Канат_ЗаполнитьРеквизитыПодвалаУПД2_5(ОбластьПодвал, ОбластьПодвалНакладной, ДанныеПечати, СведенияОбОрганизации, ВыборкаКонтрагентов);
		Иначе
			Канат_ЗаполнитьРеквизитыПодвалаУПД(ОбластьПодвал, ДанныеПечати, СведенияОбОрганизации, ВыборкаКонтрагентов);
		КонецЕсли;
		// <-БИТ> Руденков_Е.И. 08.04.2024
		#КонецВставки
		Если ДанныеДляПечати.РезультатПоШапке.Колонки.Найти("ВыводитьКодНоменклатуры") <> Неопределено Тогда
			ВыводитьКодНоменклатуры = ДанныеПечати.ВыводитьКодНоменклатуры;
		Иначе
			ВыводитьКодНоменклатуры = Истина;
		КонецЕсли;
		
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);
		ВыборкаПоДокументам.НайтиСледующий(СтруктураПоиска);
			
		ИспользоватьНаборы = Ложь;
		Если ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(ВыборкаПоДокументам, "ЭтоНабор") Тогда
			ИспользоватьНаборы = Истина;
			Если ИспользоватьПечатныеФормыСФ2_5 Тогда
				ОбластьСтрокаНабор         = Макет.ПолучитьОбласть("Строка");
				ОбластьСтрокаКомплектующие = Макет.ПолучитьОбласть("Строка");
			Иначе
				ОбластьСтрокаНабор         = Макет.ПолучитьОбласть("СтрокаНабор");
				ОбластьСтрокаКомплектующие = Макет.ПолучитьОбласть("СтрокаКомплектующие");
			КонецЕсли;
		КонецЕсли;
		
		ВыводитьКодыТНВЭД = ВыводитьКодыТНВЭД(ДанныеПечати, ЕстьПостановление981 Или ЕстьПостановление534 Или ЕстьПостановление1096);
		
		ОперацияОблагаетсяНДСУПокупателя = Ложь;
		Если ДанныеПечати.СтатусУПД = 1
		И ДанныеПечати.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДСУПокупателя Тогда
			ОперацияОблагаетсяНДСУПокупателя = Истина;
		КонецЕсли;
		
		ОперацияОблагаетсяНДССМежценовойРазницы = Ложь;
		Если ДанныеПечати.СтатусУПД = 1
			И ДанныеПечати.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДССМежценовойРазницы Тогда
			ОперацияОблагаетсяНДССМежценовойРазницы = Истина;
		КонецЕсли;
		
		СтрокаТовары = ВыборкаПоДокументам.Выбрать();
		#Вставка 
		//++Бит Трейгер П.М. 17.10.2024
		выб = ДанныеДляПечати.РезультатПоТабличнойЧасти.Выгрузить();
		выб.Очистить();
		Пока СтрокаТовары.Следующий() Цикл
			Новстрок = выб.добавить(); 
			ЗаполнитьЗначенияСвойств(Новстрок, СтрокаТовары);
		КонецЦикла;
		//++Бит Ларионов В.В. 17.04.2025
		Если выб.Колонки.Найти("ВариантПредставленияНабораВПечатныхФормах") <> Неопределено Тогда 
		//--Бит Ларионов В.В. 17.04.2025
	    СтрокаТовары.Сбросить();
		//Бобер = выб.Выгрузить(); 
		МойЗапрос = новый запрос;
		МойЗапрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаЗначений.ВариантПредставленияНабораВПечатныхФормах КАК ВариантПредставленияНабораВПечатныхФормах,
		|	ТаблицаЗначений.ВариантРасчетаЦеныНабора КАК ВариантРасчетаЦеныНабора,
		|	ТаблицаЗначений.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ТаблицаЗначений.ЕдиницаИзмеренияКод КАК ЕдиницаИзмеренияКод,
		|	ТаблицаЗначений.ЕдиницаИзмеренияНаименование КАК ЕдиницаИзмеренияНаименование,
		|	ТаблицаЗначений.ЕдиницаИзмеренияТНВЭД КАК ЕдиницаИзмеренияТНВЭД,
		|	ТаблицаЗначений.ЕдиницаИзмеренияТНВЭДКод КАК ЕдиницаИзмеренияТНВЭДКод,
		|	ТаблицаЗначений.ЕдиницаИзмеренияТНВЭДНаименование КАК ЕдиницаИзмеренияТНВЭДНаименование,
		|	ТаблицаЗначений.КодТНВЭД КАК КодТНВЭД,
		|	ТаблицаЗначений.Количество КАК Количество,
		|	ТаблицаЗначений.КоличествоБазовыхЕдиниц КАК КоличествоБазовыхЕдиниц,
		|	ТаблицаЗначений.КоличествоБазовыхЕдиницДо КАК КоличествоБазовыхЕдиницДо,
		|	ТаблицаЗначений.КоличествоДо КАК КоличествоДо,
		|	ТаблицаЗначений.КоличествоПоРНПТ КАК КоличествоПоРНПТ,
		|	ТаблицаЗначений.КоличествоПоРНПТДо КАК КоличествоПоРНПТДо,
		|	ТаблицаЗначений.КоличествоПрослежУвеличение КАК КоличествоПрослежУвеличение,
		|	ТаблицаЗначений.КоличествоПрослежУменьшение КАК КоличествоПрослежУменьшение,
		|	ТаблицаЗначений.Номенклатура КАК Номенклатура,
		|	ТаблицаЗначений.НоменклатураКод КАК НоменклатураКод,
		|	ТаблицаЗначений.НоменклатураНабора КАК НоменклатураНабора,
		|	ТаблицаЗначений.НоменклатураНаименование КАК НоменклатураНаименование,
		|	ТаблицаЗначений.НоменклатураПартнера КАК НоменклатураПартнера,
		|	ТаблицаЗначений.НомерГТД КАК НомерГТД,
		|	ТаблицаЗначений.НомерГТДСсылка КАК НомерГТДСсылка,
		|	ТаблицаЗначений.НомерСтроки КАК НомерСтроки,
		|	ТаблицаЗначений.НомерСтрокиИсходногоСФ КАК НомерСтрокиИсходногоСФ,
		|	ТаблицаЗначений.НомерСтрокиНаборы КАК НомерСтрокиНаборы,
		|	ТаблицаЗначений.ПолныйНабор КАК ПолныйНабор,
		|	ТаблицаЗначений.РазницаБезНДСУвеличение КАК РазницаБезНДСУвеличение,
		|	ТаблицаЗначений.РазницаБезНДСУменьшение КАК РазницаБезНДСУменьшение,
		|	ТаблицаЗначений.РазницаНДСУвеличение КАК РазницаНДСУвеличение,
		|	ТаблицаЗначений.РазницаНДСУменьшение КАК РазницаНДСУменьшение,
		|	ТаблицаЗначений.РазницаСНДСУвеличение КАК РазницаСНДСУвеличение,
		|	ТаблицаЗначений.РазницаСНДСУменьшение КАК РазницаСНДСУменьшение,
		|	ТаблицаЗначений.СерияНаименование КАК СерияНаименование,
		|	ТаблицаЗначений.Ссылка КАК Ссылка,
		|	ТаблицаЗначений.СтавкаНДС КАК СтавкаНДС,
		|	ТаблицаЗначений.СтранаПроисхождения КАК СтранаПроисхождения,
		|	ТаблицаЗначений.СтранаПроисхожденияКод КАК СтранаПроисхожденияКод,
		|	ТаблицаЗначений.СуммаБезНДС КАК СуммаБезНДС,
		|	ТаблицаЗначений.СуммаБезНДСДо КАК СуммаБезНДСДо,
		|	ТаблицаЗначений.СуммаНДС КАК СуммаНДС,
		|	ТаблицаЗначений.СуммаНДСДо КАК СуммаНДСДо,
		|	ТаблицаЗначений.СуммаСНДС КАК СуммаСНДС,
		|	ТаблицаЗначений.СуммаСНДСДо КАК СуммаСНДСДо,
		|	ТаблицаЗначений.ТипНомераГТД КАК ТипНомераГТД,
		|	ТаблицаЗначений.Характеристика КАК Характеристика,
		|	ТаблицаЗначений.ХарактеристикаНабора КАК ХарактеристикаНабора,
		|	ТаблицаЗначений.ХарактеристикаНаименование КАК ХарактеристикаНаименование,
		|	ТаблицаЗначений.Цена КАК Цена,
		|	ТаблицаЗначений.ЦенаДо КАК ЦенаДо,
		|	ТаблицаЗначений.ЭтоВозвратнаяТара КАК ЭтоВозвратнаяТара,
		|	ТаблицаЗначений.ЭтоКомплектующие КАК ЭтоКомплектующие,
		|	ТаблицаЗначений.ЭтоНабор КАК ЭтоНабор
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ТаблицаЗначений КАК ТаблицаЗначений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ВТ.ВариантПредставленияНабораВПечатныхФормах) КАК ВариантПредставленияНабораВПечатныхФормах,
		|	МАКСИМУМ(ВТ.ВариантРасчетаЦеныНабора) КАК ВариантРасчетаЦеныНабора,
		|	МАКСИМУМ(ВТ.ЕдиницаИзмерения) КАК ЕдиницаИзмерения,
		|	МАКСИМУМ(ВТ.ЕдиницаИзмеренияКод) КАК ЕдиницаИзмеренияКод,
		|	МАКСИМУМ(ВЫРАЗИТЬ(ЕСТЬNULL(ВТ.ЕдиницаИзмеренияНаименование, "" "") КАК СТРОКА(255))) КАК ЕдиницаИзмеренияНаименование,
		|	МАКСИМУМ(ВТ.ЕдиницаИзмеренияТНВЭД) КАК ЕдиницаИзмеренияТНВЭД,
		|	МАКСИМУМ(ВТ.ЕдиницаИзмеренияТНВЭДКод) КАК ЕдиницаИзмеренияТНВЭДКод,
		|	МАКСИМУМ(ВЫРАЗИТЬ(ЕСТЬNULL(ВТ.ЕдиницаИзмеренияТНВЭДНаименование, "" "") КАК СТРОКА(255))) КАК ЕдиницаИзмеренияТНВЭДНаименование,
		|	МАКСИМУМ(ВТ.КодТНВЭД) КАК КодТНВЭД,
		|	СУММА(ВТ.Количество) КАК Количество,
		|	МАКСИМУМ(ВТ.КоличествоБазовыхЕдиниц) КАК КоличествоБазовыхЕдиниц,
		|	МАКСИМУМ(ВТ.КоличествоБазовыхЕдиницДо) КАК КоличествоБазовыхЕдиницДо,
		|	СУММА(ВТ.КоличествоДо) КАК КоличествоДо,
		|	СУММА(ВТ.КоличествоПоРНПТ) КАК КоличествоПоРНПТ,
		|	СУММА(ВТ.КоличествоПоРНПТДо) КАК КоличествоПоРНПТДо,
		|	СУММА(ВТ.КоличествоПрослежУвеличение) КАК КоличествоПрослежУвеличение,
		|	СУММА(ВТ.КоличествоПрослежУменьшение) КАК КоличествоПрослежУменьшение,
		|	ВТ.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ВТ.НоменклатураКод) КАК НоменклатураКод,
		|	МАКСИМУМ(ВТ.НоменклатураНабора) КАК НоменклатураНабора,
		|	МАКСИМУМ(ВТ.НоменклатураНаименование) КАК НоменклатураНаименование,
		|	МАКСИМУМ(ВТ.НоменклатураПартнера) КАК НоменклатураПартнера,
		|	МАКСИМУМ(ВТ.НомерГТД) КАК НомерГТД,
		|	МАКСИМУМ(ВТ.НомерГТДСсылка) КАК НомерГТДСсылка,
		|	МИНИМУМ(ВТ.НомерСтроки) КАК НомерСтроки,
		|	МИНИМУМ(ВТ.НомерСтрокиИсходногоСФ) КАК НомерСтрокиИсходногоСФ,
		|	МИНИМУМ(ВТ.НомерСтрокиНаборы) КАК НомерСтрокиНаборы,
		|	МАКСИМУМ(ВТ.ПолныйНабор) КАК ПолныйНабор,
		|	СУММА(ВТ.РазницаБезНДСУвеличение) КАК РазницаБезНДСУвеличение,
		|	СУММА(ВТ.РазницаБезНДСУменьшение) КАК РазницаБезНДСУменьшение,
		|	СУММА(ВТ.РазницаНДСУвеличение) КАК РазницаНДСУвеличение,
		|	СУММА(ВТ.РазницаНДСУменьшение) КАК РазницаНДСУменьшение,
		|	СУММА(ВТ.РазницаСНДСУвеличение) КАК РазницаСНДСУвеличение,
		|	СУММА(ВТ.РазницаСНДСУменьшение) КАК РазницаСНДСУменьшение,
		|	МИНИМУМ(ВТ.СерияНаименование) КАК СерияНаименование,
		|	МАКСИМУМ(ВТ.Ссылка) КАК Ссылка,
		|	МАКСИМУМ(ВТ.СтавкаНДС) КАК СтавкаНДС,
		|	МАКСИМУМ(ВТ.СтранаПроисхождения) КАК СтранаПроисхождения,
		|	МАКСИМУМ(ВТ.СтранаПроисхожденияКод) КАК СтранаПроисхожденияКод,
		|	СУММА(ВТ.СуммаБезНДС) КАК СуммаБезНДС,
		|	СУММА(ВТ.СуммаБезНДСДо) КАК СуммаБезНДСДо,
		|	СУММА(ВТ.СуммаНДС) КАК СуммаНДС,
		|	СУММА(ВТ.СуммаНДСДо) КАК СуммаНДСДо,
		|	СУММА(ВТ.СуммаСНДС) КАК СуммаСНДС,
		|	СУММА(ВТ.СуммаСНДСДо) КАК СуммаСНДСДо,
		|	МАКСИМУМ(ВТ.ТипНомераГТД) КАК ТипНомераГТД,
		|	МАКСИМУМ(ВТ.Характеристика) КАК Характеристика,
		|	МАКСИМУМ(ВТ.ХарактеристикаНабора) КАК ХарактеристикаНабора,
		|	МАКСИМУМ(ВТ.ХарактеристикаНаименование) КАК ХарактеристикаНаименование,
		|	ВТ.Цена КАК Цена,
		|	СУММА(ВТ.ЦенаДо) КАК ЦенаДо,
		|	МАКСИМУМ(ВТ.ЭтоВозвратнаяТара) КАК ЭтоВозвратнаяТара,
		|	МАКСИМУМ(ВТ.ЭтоКомплектующие) КАК ЭтоКомплектующие,
		|	МАКСИМУМ(ВТ.ЭтоНабор) КАК ЭтоНабор
		|ИЗ
		|	ВТ КАК ВТ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ.Цена,
		|	ВТ.Номенклатура";
	
		МойЗапрос.УстановитьПараметр("ТаблицаЗначений", выб);	
		МойРезультат = МойЗапрос.Выполнить();
		МояПеременная = МойРезультат.выбрать();
		СтрокаТовары = МояПеременная;
		//--Бит Трейгер П.М 17.10.2024
		//++Бит Ларионов В.В. 17.04.2025
	КонецЕсли;                      
	//--Бит Ларионов В.В. 17.04.2025
		#КонецВставки

		КоличествоСтрок = 0;
		Пока СтрокаТовары.Следующий() Цикл
			Если Не НаборыСервер.ИспользоватьОбластьНабор(СтрокаТовары, ИспользоватьНаборы) Тогда
				КоличествоСтрок = КоличествоСтрок + 1;
			КонецЕсли;
		КонецЦикла;
		СтрокаТовары.Сбросить();
		
		Если ИспользоватьПечатныеФормыСФ2_5 Тогда
			Если ЕстьПостановление1096 Тогда
				ОбластьШапка.Параметры.ДокументыОбОтгрузке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = '%1, № %2 от %3';
							|en = '%1, No. %2 dated %3'"),
						НСтр("ru = 'Универсальный передаточный документ';
							|en = 'Universal transfer document'"),
						ОбластьШапка.Параметры.Номер,
						ОбластьШапка.Параметры.Дата);
			ИначеЕсли ЕстьПостановление534 Тогда
				ОбластьШапка.Параметры.ДокументыОбОтгрузке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = '№ п/п %1 № %2 от %3';
							|en = 'Item No. %1 # %2 of %3'"),
						?(КоличествоСтрок = 1, "1" , "1-" + Формат(КоличествоСтрок, "ЧГ=0")),
						ОбластьШапка.Параметры.Номер,
						ОбластьШапка.Параметры.Дата);
			КонецЕсли;
		Иначе
			Если ЕстьПостановление1096 Тогда
				ОбластьШапка.Параметры.ПоДокументуОтгрузки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = '%1, № %2 от %3';
							|en = '%1, No. %2 dated %3'"),
						НСтр("ru = 'Универсальный передаточный документ';
							|en = 'Universal transfer document'"),
						ОбластьШапка.Параметры.Номер,
						ОбластьШапка.Параметры.Дата);
			ИначеЕсли ЕстьПостановление534 Тогда
				ОбластьШапка.Параметры.ПоДокументуОтгрузки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = '№ п/п %1 № %2 от %3';
							|en = 'Item No. %1 # %2 of %3'"),
						?(КоличествоСтрок = 1, "1" , "1-" + Формат(КоличествоСтрок, "ЧГ=0")),
						ОбластьШапка.Параметры.Номер,
						ОбластьШапка.Параметры.Дата);
			КонецЕсли;
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		// Выводим заголовок таблицы
		ЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
		ТабличныйДокумент.Вывести(ЗаголовокТаблицы);
		
		ТолькоСтавкаБезНДС = Истина;
		НомерСтроки = 0; 
		
		Пока СтрокаТовары.Следующий() Цикл
			
				Если ПрослеживаемыеОС <> Неопределено Тогда
					ПрослеживаемыеТоварыСтрокаТовары = ПрослеживаемыеОС.НайтиСтроки(Новый Структура("НомерСтрокиСФ", СтрокаТовары.НомерСтроки));
				ИначеЕсли ПрослеживаемыеКомплектующие <> Неопределено Тогда
					ПрослеживаемыеТоварыСтрокаТовары = ПрослеживаемыеКомплектующие.НайтиСтроки(Новый Структура("НомерГТД", СтрокаТовары.НомерГТД));
				Иначе
					ПрослеживаемыеТоварыСтрокаТовары = Неопределено;
				КонецЕсли;
			
			Если ТипЗнч(ДанныеПечати.Ссылка) = Тип("ДокументСсылка.ОтчетКомиссионера")
				ИЛИ ТипЗнч(ДанныеПечати.Ссылка) = Тип("ДокументСсылка.ОтчетПоКомиссииМеждуОрганизациями") Тогда
				Если СтрокаТовары.Покупатель <> ДанныеПечати.Покупатель
					И СтрокаТовары.Покупатель <> НЕОПРЕДЕЛЕНО Тогда
						Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			Если СтрокаТовары.Количество = 0 
				И СтрокаТовары.СуммаСНДС = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Если НаборыСервер.ИспользоватьОбластьНабор(СтрокаТовары, ИспользоватьНаборы) Тогда
				ОбластьСтрока = ОбластьСтрокаНабор;
			ИначеЕсли НаборыСервер.ИспользоватьОбластьКомплектующие(СтрокаТовары, ИспользоватьНаборы) Тогда
				ОбластьСтрока = ОбластьСтрокаКомплектующие;
			Иначе
				ОбластьСтрока = ОбластьСтрокаСтандарт;
			КонецЕсли;
			
			ПараметрыПечати = Новый Структура("Корректировочный,СчетФактураНаАванс,ЕстьПрослеживаемыеТовары,ЕстьПостановление1096", Ложь, Ложь, ДанныеПечати.ЕстьПрослеживаемыеТовары, ЕстьПостановление1096);
			
			Если НаборыСервер.ВыводитьТолькоЗаголовок(СтрокаТовары, ИспользоватьНаборы) Тогда
				Если ИспользоватьПечатныеФормыСФ2_5 Тогда
					ЗаполнитьРеквизитыСтрокиТовара2_5(СтрокаТовары, ПрослеживаемыеТоварыСтрокаТовары, ОбластьСтрока, Неопределено, ПараметрыПечати, , ВыводитьКодыТНВЭД, ВыводитьСерии);
				Иначе
					ЗаполнитьРеквизитыСтрокиТовара(СтрокаТовары, ОбластьСтрока, Неопределено, , ВыводитьКодыТНВЭД, ВыводитьСерии);
				КонецЕсли;
			Иначе
				НомерСтроки = НомерСтроки + 1;
				Если ИспользоватьПечатныеФормыСФ2_5 Тогда
					ЗаполнитьРеквизитыСтрокиТовара2_5(СтрокаТовары, ПрослеживаемыеТоварыСтрокаТовары, ОбластьСтрока, НомерСтроки, ПараметрыПечати, , ВыводитьКодыТНВЭД, ВыводитьСерии);
				Иначе
					ЗаполнитьРеквизитыСтрокиТовара(СтрокаТовары, ОбластьСтрока, НомерСтроки, , ВыводитьКодыТНВЭД, ВыводитьСерии);
				КонецЕсли;
				ПроставитьПрочеркиВПустыеПоляСтроки(ОбластьСтрока);
			КонецЕсли;
			
			Если ОперацияОблагаетсяНДССМежценовойРазницы Тогда
				Если ИспользоватьПечатныеФормыСФ2_5 Тогда
					ОбластьСтрока.Параметры.Стоимость   = СтрокаТовары.МежценоваяРазница;
				Иначе
					ОбластьСтрока.Параметры.СуммаБезНДС   = СтрокаТовары.МежценоваяРазница;
				КонецЕсли;
				Если ПараметрыПечати.Корректировочный Тогда
					Если ИспользоватьПечатныеФормыСФ2_5 Тогда
						ОбластьСтрока.Параметры.СуммаБезНДСДо = СтрокаТовары.МежценоваяРазницаДо;
					Иначе 
						ОбластьСтрока.Параметры.СтоимостьБезНДСДоИзменения = СтрокаТовары.МежценоваяРазницаДо;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			СтруктураПараметров = Новый Структура;
			Если ОперацияОблагаетсяНДСУПокупателя Тогда
				СтруктураПараметров.Вставить("СтавкаНДС", НСтр("ru = 'НДС исчисляется налоговым агентом';
																|en = 'VAT is calculated by tax agent'", Метаданные.Языки.Русский.КодЯзыка));
				Если ИспользоватьПечатныеФормыСФ2_5 Тогда
					СтруктураПараметров.Вставить("Всего", "--");
				Иначе
					СтруктураПараметров.Вставить("СуммаСНДС", "--");
				КонецЕсли;
				ТолькоСтавкаБезНДС = Ложь;
			ИначеЕсли СтрокаТовары.СтавкаНДС = Справочники.СтавкиНДС.БезНДС Тогда
				СтруктураПараметров.Вставить("СтавкаНДС", НСтр("ru = 'без НДС';
																|en = 'Excluding VAT'", Метаданные.Языки.Русский.КодЯзыка));
				СтруктураПараметров.Вставить("СуммаНДС", НСтр("ru = 'без НДС';
																|en = 'Excluding VAT'", Метаданные.Языки.Русский.КодЯзыка));
			ИначеЕсли СтрокаТовары.СтавкаНДС = УчетНДСЛокализация.СтавкаНДСПоПеречислению(Перечисления.СтавкиНДС.НДС0) Тогда
				СтруктураПараметров.Вставить("СуммаНДС", 0);
				ТолькоСтавкаБезНДС = Ложь;
			Иначе
				ТолькоСтавкаБезНДС = Ложь;
			КонецЕсли;
			Если Не НаборыСервер.ВыводитьТолькоЗаголовок(СтрокаТовары, ИспользоватьНаборы) Тогда
				Если ИспользоватьПечатныеФормыСФ2_5 Тогда
					СтруктураПараметров.Вставить("Акциз", НСтр("ru = 'без
					|акциза';
					|en = 'without
					|excise duty'", Метаданные.Языки.Русский.КодЯзыка));
				Иначе
					СтруктураПараметров.Вставить("Акциз", НСтр("ru = 'без акциза';
																|en = 'no excise'", Метаданные.Языки.Русский.КодЯзыка));
				КонецЕсли;
			КонецЕсли;
			ОбластьСтрока.Параметры.Заполнить(СтруктураПараметров);
			
			МассивВыводимыхОбластей.Очистить();
			МассивВыводимыхОбластей.Добавить(ОбластьСтрока);
			
			Если НомерСтроки = КоличествоСтрок Тогда
				МассивВыводимыхОбластей.Добавить(ОбластьИтого);
				МассивВыводимыхОбластей.Добавить(ОбластьПодвал);
				Если ИспользоватьПечатныеФормыСФ2_5 Тогда
					МассивВыводимыхОбластей.Добавить(ОбластьПодвалНакладной);
				КонецЕсли;
			КонецЕсли;
			
			Если НомерСтроки <> 1 И НЕ ТабличныйДокумент.ПроверитьВывод(МассивВыводимыхОбластей) Тогда
				
				НомерСтраницы = НомерСтраницы + 1;
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				
				ОбластьНумерацияЛистов = Макет.ПолучитьОбласть("НумерацияЛистов");
				Если ОпцииПечати.НомерСформированВСчетеФактуре Тогда
					ОбластьНумерацияЛистов.Параметры.Номер = ДанныеПечати.Номер;
				Иначе
					ОбластьНумерацияЛистов.Параметры.Номер = НомерСчетаФактурыНаПечать(ДанныеПечати.Номер, ДанныеПечати.ИндексПодразделения);
				КонецЕсли;
				Если ИспользоватьПечатныеФормыСФ2_5 Тогда
					ОбластьНумерацияЛистов.Параметры.НомерЛиста = НомерСтраницы;
					ОбластьНумерацияЛистов.Параметры.Номер = "Универсальный передаточный документ № " + ОбластьНумерацияЛистов.Параметры.Номер + " от " +  Формат(ДанныеПечати.Дата, "ДЛФ=ДД; ДП=--");
				Иначе
					ОбластьНумерацияЛистов.Параметры.НомерСтраницы = НомерСтраницы;
					ОбластьНумерацияЛистов.Параметры.Дата = Формат(ДанныеПечати.Дата, "ДЛФ=ДД; ДП=--");
				КонецЕсли;
				
				ТабличныйДокумент.Вывести(ОбластьНумерацияЛистов);
				ТабличныйДокумент.Вывести(ЗаголовокТаблицы);
				
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(ОбластьСтрока);
			
			Если Не НаборыСервер.ИспользоватьОбластьКомплектующие(СтрокаТовары, ИспользоватьНаборы) Тогда
				Если ИспользоватьПечатныеФормыСФ2_5 Тогда
					РассчитатьИтоговыеСуммы2_5(ИтоговыеСуммы, ПараметрыПечати, СтрокаТовары, ПрослеживаемыеТоварыСтрокаТовары, ОперацияОблагаетсяНДССМежценовойРазницы);
				Иначе
					РассчитатьИтоговыеСуммы(ИтоговыеСуммы, СтрокаТовары, ОперацияОблагаетсяНДССМежценовойРазницы);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		// Выводим итоги по документу
		ДобавитьИтоговыеДанныеПодвала(ИтоговыеСуммы, НомерСтроки, ВалютаРегламентированногоУчета(ДанныеПечати));
		
		Если ТолькоСтавкаБезНДС Тогда
			ИтоговыеСуммы.ИтогоСуммаНДС = НСтр("ru = 'без НДС';
												|en = 'Excluding VAT'", Метаданные.Языки.Русский.КодЯзыка);
		КонецЕсли;
		
		Если ОперацияОблагаетсяНДСУПокупателя Тогда
			Если ИспользоватьПечатныеФормыСФ2_5 Тогда
				ИтоговыеСуммы.Вставить("ИтогоВсего", "--");
				ИтоговыеСуммы.Вставить("ИтогоВсегоНаСтранице", "--");
			Иначе
				ИтоговыеСуммы.Вставить("ИтогоСуммаСНДС", "--");
				ИтоговыеСуммы.Вставить("ИтогоСуммаСНДСНаСтранице", "--");
			КонецЕсли;
		КонецЕсли;
		
		ОбластьИтого.Параметры.Заполнить(ИтоговыеСуммы);
		ПроставитьПрочеркиВПустыеПоляСтроки(ОбластьИтого);
		ТабличныйДокумент.Вывести(ОбластьИтого);
		
		// Если строка таблицы одна, то проверим поместится ли все на одной странице
		Если КоличествоСтрок = 1 Тогда
			МассивВыводимыхОбластей = Новый Массив;
			МассивВыводимыхОбластей.Добавить(ОбластьПодвал);
			Если ИспользоватьПечатныеФормыСФ2_5 Тогда
				МассивВыводимыхОбластей.Добавить(ОбластьПодвалНакладной);
			КонецЕсли;
			Если Не ТабличныйДокумент.ПроверитьВывод(МассивВыводимыхОбластей) Тогда
				НомерСтраницы = НомерСтраницы + 1;
			КонецЕсли;
		КонецЕсли;
		
		КоличествоСтраниц = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Документ составлен на %1 %2';
				|en = 'Document is created on %1 %2'", Метаданные.Языки.Русский.КодЯзыка),
			НомерСтраницы,
			ОбщегоНазначенияУТКлиентСервер.ФормаМножественногоЧисла(
				НСтр("ru = 'листе';
					|en = 'sheet'", Метаданные.Языки.Русский.КодЯзыка),
				НСтр("ru = 'листах';
					|en = 'sheets'", Метаданные.Языки.Русский.КодЯзыка),
				НСтр("ru = 'листах';
					|en = 'sheets'", Метаданные.Языки.Русский.КодЯзыка), НомерСтраницы));
		Если ИспользоватьПечатныеФормыСФ2_5 Тогда
			СтруктураПараметров = Новый Структура("КоличествоЛистов", КоличествоСтраниц);
		Иначе
			СтруктураПараметров = Новый Структура("КоличествоСтраниц", КоличествоСтраниц);
		КонецЕсли;
		ОбластьПодвал.Параметры.Заполнить(СтруктураПараметров);
		
		Если ИспользоватьПечатныеФормыСФ2_5 Тогда
			УдалитьВсеОбластиФаксимиле(ОбластьПодвал);
			УдалитьВсеОбластиФаксимиле(ОбластьПодвалНакладной);
		КонецЕсли;
		#Вставка
		//БИТ_Гурьев__27.03.24++
		Если ЗначениеЗаполнено(ДанныеПечати.ДокументОснование.Договор) Тогда
			//ОбластьПодвал.Параметры.Основание = ДанныеПечати.ДокументОснование.Договор;
		Иначе
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	СчетНаОплатуКлиенту.Ссылка КАК Ссылка
			               |ИЗ
			               |	Документ.СчетНаОплатуКлиенту КАК СчетНаОплатуКлиенту
			               |ГДЕ
			               |	СчетНаОплатуКлиенту.ДокументОснование = &ДокументОснование";
			Запрос.УстановитьПараметр("ДокументОснование", ДанныеПечати.ДокументОснование);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				ОбластьПодвал.Параметры.Основание = Выборка.Ссылка;
			КонецЕсли;
		КонецЕсли;
		//БИТ_Гурьев__27.03.24--
		#КонецВставки
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		Если ИспользоватьПечатныеФормыСФ2_5 Тогда
			ТабличныйДокумент.Вывести(ОбластьПодвалНакладной);
		КонецЕсли;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати,
			ДанныеПечати.Ссылка);
			
	КонецЦикла;
	
КонецПроцедуры

// <+БИТ> Руденков_Е.И. 08.04.2024 
// #000000229, Счет-фактура (УПД)
Процедура Канат_ЗаполнитьРеквизитыПодвалаУПД2_5(ОбластьПодвала, ОбластьПодвалаНакладной, ДанныеПечати, СведенияОбОрганизации, ДанныеКонтрагентов)
	
	ОбластьПодвалаНакладной.Параметры.Заполнить(ДанныеПечати);
	
	Если ТипЗнч(ДанныеПечати.Ссылка) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		Если СтрНайти(ДанныеПечати.Основание,"Заказ клиента") <> 0 Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СчетНаОплатуКлиенту.Ссылка КАК СчетНаОплатуКлиенту,
			|	СчетНаОплатуКлиенту.Номер КАК НомерСчета,
			|	СчетНаОплатуКлиенту.Дата КАК ДатаСчета
			|ИЗ
			|	Документ.СчетНаОплатуКлиенту КАК СчетНаОплатуКлиенту
			|ГДЕ
			|	СчетНаОплатуКлиенту.ДокументОснование = &Ссылка";
			
			Запрос.УстановитьПараметр("Ссылка", ДанныеПечати.Ссылка.ДокументОснование.ЗаказКлиента);
			РезультатЗапроса = Запрос.Выполнить();
			
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				//ОбластьПодвала.Параметры.Основание = "Счет на оплату " 
				//									+ ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.НомерСчета, Ложь, Истина)
				//									+ " от " + Формат(Выборка.ДатаСчета,"ДФ=dd.MM.yyyy");
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ФИООтветственного", ДанныеПечати.Руководитель);
	Если СведенияОбОрганизации.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
		СтруктураПараметров.Вставить("ФИОРуководителя", ДанныеПечати.Руководитель);
		СтруктураПараметров.Вставить("ФИОГлавногоБухгалтера", ДанныеПечати.ГлавныйБухгалтер);
	Иначе
		СтруктураПараметров.Вставить("ФИОПБОЮЛ", ДанныеПечати.Руководитель);
		СтруктураПараметров.Вставить("Свидетельство", СведенияОбОрганизации.Свидетельство);
	КонецЕсли;
	
	ОбластьПодвала.Параметры.Заполнить(СтруктураПараметров);
		
	СтруктураПараметров.Вставить("ФИОКладовщика", ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ДанныеПечати.Кладовщик, ДанныеПечати.Дата));
	СтруктураПараметров.Вставить("ДолжностьКладовщика", ДанныеПечати.ДолжностьКладовщика);
	СтруктураПараметров.Вставить("ДолжностьОтветственного", ДанныеПечати.ДолжностьРуководителя);
	
	ПолнаяДатаДокумента = СтрЗаменить(Формат(ДанныеПечати.Дата, "ДЛФ=DD"),НСтр("ru = 'г.';
																				|en = 'year'", Метаданные.Языки.Русский.КодЯзыка),"");
	ДлинаСтроки = СтрДлина(ПолнаяДатаДокумента);
	ПозицияРазделителя = СтрНайти(ПолнаяДатаДокумента, " ");
	ПредставлениеДаты = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = '""%1"" %2года';
			|en = '""%1"" %2'", Метаданные.Языки.Русский.КодЯзыка),
		Лев(ПолнаяДатаДокумента, ПозицияРазделителя -1),
		Прав(ПолнаяДатаДокумента, ДлинаСтроки - ПозицияРазделителя));
	
	СтруктураПараметров.Вставить("ДатаОтгрузкиПередачи", ПредставлениеДаты);
	
	ИННПоставщика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "ИНН,", Ложь);
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеПечати, "ОрганизацияВДокументе") Тогда
		КПППоставщика = ОрганизацииЛокализация.КППНаДату(ДанныеПечати.ОрганизацияВДокументе, ДанныеПечати.Дата); 
	Иначе
		КПППоставщика = ОрганизацииЛокализация.КППНаДату(ДанныеПечати.Организация, ДанныеПечати.Дата);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КПППоставщика) Тогда
		ПредставлениеОрганизации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1, ИНН/КПП %2/%3';
																								|en = '%1, TIN/KPP %2/%3'", Метаданные.Языки.Русский.КодЯзыка),
			СведенияОбОрганизации.ПолноеНаименование,
			ИННПоставщика,
			КПППоставщика);
	ИначеЕсли ЗначениеЗаполнено(ИННПоставщика) Тогда
		ПредставлениеОрганизации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1, ИНН %2';
																								|en = '%1, TIN %2'", Метаданные.Языки.Русский.КодЯзыка),
			СведенияОбОрганизации.ПолноеНаименование,
			ИННПоставщика);
	Иначе
		ПредставлениеОрганизации = СведенияОбОрганизации.ПолноеНаименование;
	КонецЕсли;
	СтруктураПараметров.Вставить("ПредставлениеОрганизации", ПредставлениеОрганизации);
	
	ТаблицаКонтрагентов = ТаблицаКонтрагентовСчетаФактуры(ДанныеПечати, ДанныеКонтрагентов);
	ПредставлениеКонтрагента    = "";
	
	Для Каждого СтрокаТаблицы Из ТаблицаКонтрагентов Цикл
		СведенияОПокупателе = СтрокаТаблицы.СведенияОПокупателе;
		ПолноеНаименование = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе, "ПолноеНаименование", Ложь);
		ИННПокупателя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе, "ИНН", Ложь);
		Если Не ПустаяСтрока(СтрокаТаблицы.КПП) Тогда
			ПредставлениеКонтрагента = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1; %2, ИНН/КПП %3/%4';
					|en = '%1; %2, TIN/KPP %3/%4'", Метаданные.Языки.Русский.КодЯзыка),
				ПредставлениеКонтрагента,
				ПолноеНаименование,
				ИННПокупателя,
				СтрокаТаблицы.КПП);
		ИначеЕсли ЗначениеЗаполнено(ИННПокупателя) Тогда
			ПредставлениеКонтрагента = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1; %2, ИНН %3';
					|en = '%1; %2, TIN %3'", Метаданные.Языки.Русский.КодЯзыка),
				ПредставлениеКонтрагента,
				ПолноеНаименование,
				ИННПокупателя);
		Иначе
			ПредставлениеКонтрагента = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1; %2';
					|en = '%1; %2'"),
				ПредставлениеКонтрагента,
				ПолноеНаименование);
		КонецЕсли;
	
	КонецЦикла;
	СтруктураПараметров.Вставить("ПредставлениеКонтрагента", Сред(ПредставлениеКонтрагента, 3));
	
	Если ЗначениеЗаполнено(ДанныеПечати.ДоверенностьНомер) И ЗначениеЗаполнено(ДанныеПечати.ДоверенностьДата)
		И (ЗначениеЗаполнено(ДанныеПечати.ДоверенностьВыдана) Или ЗначениеЗаполнено(ДанныеПечати.ДоверенностьЛицо)) Тогда
		
		ТекстОснования = СокрЛП(ДанныеПечати.Основание) + "; "
			+ СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'по доверенности №%1 от %2, выданной %3 %4';
																			|en = 'against the letter of authority No. %1 from %2 issued by %3 to %4'", Метаданные.Языки.Русский.КодЯзыка),
				ДанныеПечати.ДоверенностьНомер,
				Формат(ДанныеПечати.ДоверенностьДата, "ДЛФ=DD"),
				ДанныеПечати.ДоверенностьВыдана,
				ДанныеПечати.ДоверенностьЛицо);
		СтруктураПараметров.Вставить("Основание", ТекстОснования);
		
	КонецЕсли;
	
	ОбластьПодвалаНакладной.Параметры.Заполнить(СтруктураПараметров);  
	
	//++Бит_Зачетнова_19.05.2025_Обращение 1660201581 от 15.05.2025 14:38:44 	
	Если ТипЗнч(ДанныеПечати.Ссылка) = ТИП("ДокументСсылка.РеализацияТоваровУслуг") тогда
		
		Если  ЗначениеЗаполнено(ДанныеПечати.Ссылка.ЗаказКлиента) тогда         
		   Если ЗначениеЗаполнено(ДанныеПечати.Ссылка.ЗаказКлиента.Договор) тогда  
		       ОбластьПодвалаНакладной.Параметры.Основание = ДанныеПечати.Ссылка.ЗаказКлиента.Договор;
		   ИначеЕсли ЗначениеЗаполнено(СчетНаОплатуСвязанныйЗаказОснованиеРеализации(ДанныеПечати.Ссылка.ЗаказКлиента)) тогда 
			    ОбластьПодвалаНакладной.Параметры.Основание = СчетНаОплатуСвязанныйЗаказОснованиеРеализации(ДанныеПечати.Ссылка.ЗаказКлиента); 
		   КонецЕсли;
		ИначеЕсли ЗначениеЗаполнено(СчетНаОплатуСвязаннаяРеализация(ДанныеПечати.Ссылка)) тогда   
			ОбластьПодвалаНакладной.Параметры.Основание = СчетНаОплатуСвязаннаяРеализация(ДанныеПечати.Ссылка);   
		ИначеЕсли ЗначениеЗаполнено(ДанныеПечати.Ссылка.Договор) тогда  	
			ОбластьПодвалаНакладной.Параметры.Основание = ДанныеПечати.Ссылка.Договор; 
		Иначе  
				ОбластьПодвалаНакладной.Параметры.Заполнить(СтруктураПараметров);
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДанныеПечати.ДокументОснование) = ТИП("ДокументСсылка.РеализацияТоваровУслуг") Тогда 		
		
		Если  ЗначениеЗаполнено(ДанныеПечати.ДокументОснование.ЗаказКлиента) тогда         
		   Если ЗначениеЗаполнено(ДанныеПечати.ДокументОснование.ЗаказКлиента.Договор) тогда  
		       ОбластьПодвалаНакладной.Параметры.Основание = ДанныеПечати.ДокументОснование.ЗаказКлиента.Договор;
		   ИначеЕсли ЗначениеЗаполнено(СчетНаОплатуСвязанныйЗаказОснованиеРеализации(ДанныеПечати.ДокументОснование.ЗаказКлиента)) тогда 
			    ОбластьПодвалаНакладной.Параметры.Основание = СчетНаОплатуСвязанныйЗаказОснованиеРеализации(ДанныеПечати.ДокументОснование.ЗаказКлиента); 
		   КонецЕсли;
		ИначеЕсли ЗначениеЗаполнено(СчетНаОплатуСвязаннаяРеализация(ДанныеПечати.ДокументОснование)) тогда   
			ОбластьПодвалаНакладной.Параметры.Основание = СчетНаОплатуСвязаннаяРеализация(ДанныеПечати.ДокументОснование);   
		ИначеЕсли ЗначениеЗаполнено(ДанныеПечати.ДокументОснование.Договор) тогда  	
			ОбластьПодвалаНакладной.Параметры.Основание = ДанныеПечати.ДокументОснование.Договор; 
		Иначе  
				ОбластьПодвалаНакладной.Параметры.Заполнить(СтруктураПараметров);
		КонецЕсли;	
		
	ИначеЕсли ТипЗнч(ДанныеПечати.ДокументОснование) = ТИП("ДокументСсылка.РеализацияУслугПрочихАктивов") тогда 
		
		Если ЗначениеЗаполнено(ДанныеПечати.ДокументОснование.Договор) тогда
			ОбластьПодвалаНакладной.Параметры.Основание = ДанныеПечати.ДокументОснование.Договор; 
		Иначе 
				ОбластьПодвалаНакладной.Параметры.Заполнить(СтруктураПараметров);
			КонецЕсли;  
			
	ИначеЕсли ТипЗнч(ДанныеПечати) = ТИП("ДокументСсылка.РеализацияУслугПрочихАктивов") тогда
		
		Если ЗначениеЗаполнено(ДанныеПечати.Договор) тогда
			ОбластьПодвалаНакладной.Параметры.Основание = ДанныеПечати.Договор; 
		Иначе 
				ОбластьПодвалаНакладной.Параметры.Заполнить(СтруктураПараметров);
			КонецЕсли; 
	Иначе
		ОбластьПодвалаНакладной.Параметры.Заполнить(СтруктураПараметров);
	КонецЕсли;
	//--Бит_Зачетнова_19.05.2025_Обращение 1660201581 от 15.05.2025 14:38:44     
	
	//++Бит_Зачетнова_20.05.2025_Обращение 1660201581 от 15.05.2025 14:38:44   
	Если ТипЗнч(ДанныеПечати.Ссылка) = ТИП("ДокументСсылка.РеализацияТоваровУслуг") тогда
		Если ДанныеПечати.Ссылка.Метаданные().Реквизиты.Найти("Канат_ДопИнформация") <> Неопределено Тогда
			ОбластьПодвалаНакладной.Параметры.СопроводительныеДокументы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеПечати.Ссылка,"Канат_ДопИнформация");
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДанныеПечати.ДокументОснование) = ТИП("ДокументСсылка.РеализацияТоваровУслуг") ТОгда
		Если ДанныеПечати.ДокументОснование.Метаданные().Реквизиты.Найти("Канат_ДопИнформация") <> Неопределено Тогда
			ОбластьПодвалаНакладной.Параметры.СопроводительныеДокументы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеПечати.ДокументОснование,"Канат_ДопИнформация");
		КонецЕсли;
	КонецЕсли;
	//--Бит_Зачетнова_20.05.2025_Обращение 1660201581 от 15.05.2025 14:38:44
КонецПроцедуры

//++Бит_Зачетнова_19.05.2025_Обращение 1660201581 от 15.05.2025 14:38:44    
Функция СчетНаОплатуСвязаннаяРеализация(ДокументОснование)    
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетНаОплатуКлиенту.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СчетНаОплатуКлиенту КАК СчетНаОплатуКлиенту
		|ГДЕ
		|	СчетНаОплатуКлиенту.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() <> 0 тогда
		Для каждого СтрокаТЧ из РезультатЗапроса цикл    
			СчетНаОснованииРеализации = СтрокаТч.Ссылка;
		КонецЦикла; 
		Возврат СчетНаОснованииРеализации; 
	Иначе Возврат Неопределено; 
	КонецЕсли;
	
КонецФункции      

Функция СчетНаОплатуСвязанныйЗаказОснованиеРеализации(ДокументОснование)    
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетНаОплатуКлиенту.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СчетНаОплатуКлиенту КАК СчетНаОплатуКлиенту
		|ГДЕ
		|	СчетНаОплатуКлиенту.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() <> 0 тогда
		Для каждого СтрокаТЧ из РезультатЗапроса цикл    
			СчетНаОснованииРеализации = СтрокаТч.Ссылка;
		КонецЦикла; 
		Возврат СчетНаОснованииРеализации; 
	Иначе Возврат Неопределено; 
	КонецЕсли;
	
КонецФункции    
//--Бит_Зачетнова_19.05.2025_Обращение 1660201581 от 15.05.2025 14:38:44

Процедура Канат_ЗаполнитьРеквизитыПодвалаУПД(ОбластьПодвала, ДанныеПечати, СведенияОбОрганизации, ДанныеКонтрагентов)
	
	ОбластьПодвала.Параметры.Заполнить(ДанныеПечати);
	//VVLarionov_11.09.24
	Если ТипЗнч(ДанныеПечати.ДокументОснование) = ТИП("ДокументСсылка.РеализацияТоваровУслуг") ТОгда
		Если ДанныеПечати.ДокументОснование.Метаданные().Реквизиты.Найти("Канат_ДопИнформация") <> Неопределено Тогда
			ОбластьПодвала.Параметры.СопроводительныеДокументы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеПечати.ДокументОснование,"Канат_ДопИнформация");
		КонецЕсли;
	КонецЕсли;
	//VVLarionov_11.09.24

	Если ТипЗнч(ДанныеПечати.Ссылка) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		Если СтрНайти(ДанныеПечати.Основание,"Заказ клиента") <> 0 Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СчетНаОплатуКлиенту.Ссылка КАК СчетНаОплатуКлиенту,
			|	СчетНаОплатуКлиенту.Номер КАК НомерСчета,
			|	СчетНаОплатуКлиенту.Дата КАК ДатаСчета
			|ИЗ
			|	Документ.СчетНаОплатуКлиенту КАК СчетНаОплатуКлиенту
			|ГДЕ
			|	СчетНаОплатуКлиенту.ДокументОснование = &Ссылка";
			
			Запрос.УстановитьПараметр("Ссылка", ДанныеПечати.Ссылка.ДокументОснование.ЗаказКлиента);
			РезультатЗапроса = Запрос.Выполнить();
			
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				ОбластьПодвала.Параметры.Основание = "Счет на оплату " 
													+ ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.НомерСчета, Ложь, Истина)
													+ " от " + Формат(Выборка.ДатаСчета,"ДФ=dd.MM.yyyy");
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ФИОРуководителя", ДанныеПечати.Руководитель);
	Если СведенияОбОрганизации.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
		СтруктураПараметров.Вставить("ФИОРуководителяОрганизации", ДанныеПечати.Руководитель);
		СтруктураПараметров.Вставить("ФИОГлавногоБухгалтера", ДанныеПечати.ГлавныйБухгалтер);
	Иначе
		СтруктураПараметров.Вставить("ФИОПБОЮЛ", ДанныеПечати.Руководитель);
		СтруктураПараметров.Вставить("Свидетельство", СведенияОбОрганизации.Свидетельство);
	КонецЕсли;
	
	СтруктураПараметров.Вставить("ФИОКладовщика", ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ДанныеПечати.Кладовщик, ДанныеПечати.Дата));
	//++БИТ Трейгер П.М 03.12.2024 Правка
	//++БИТ Трейгер П.М 17.10.2024
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	РеализацияТоваровУслуг.ДолжностьКладовщика КАК ДолжностьКладовщика
	//	|ИЗ
	//	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	//	|ГДЕ
	//	|	РеализацияТоваровУслуг.Ссылка = &Ссылка";
	//
	//Запрос.УстановитьПараметр("Ссылка", ДанныеПечати.ДокументОснование);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
	//Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда 
	//ДолжностьКладовщика = ВыборкаДетальныеЗаписи[0].ДолжностьКладовщика;
	//КонецЕсли;
	Реализация = ДанныеПечати.ДокументОснование;
	склад = Реализация.Склад;
	ДолжностьКладовщика = склад.ТекущаяДолжностьОтветственного;
	ФиоКладовщика =  склад.ТекущийОтветственный;	
	СтруктураПараметров.Вставить("ФИОКладовщика", ФиоКладовщика);
	//--БИТ Трейгер П.М 03.12.2024 Правка

	
	
	//СтруктураПараметров.Вставить("ДолжностьКладовщика", ДанныеПечати.ДолжностьКладовщика);
	  СтруктураПараметров.Вставить("ДолжностьКладовщика", ДолжностьКладовщика);
	//--БИТ Трейгер П.М 17.10.2024
	ПолнаяДатаДокумента = СтрЗаменить(Формат(ДанныеПечати.Дата, "ДЛФ=DD"),НСтр("ru = 'г.';
																				|en = 'year'", Метаданные.Языки.Русский.КодЯзыка),"");
	ДлинаСтроки = СтрДлина(ПолнаяДатаДокумента);
	ПозицияРазделителя = СтрНайти(ПолнаяДатаДокумента, " ");
	ПредставлениеДаты = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = '""%1"" %2года';
			|en = '""%1"" %2'", Метаданные.Языки.Русский.КодЯзыка),
		Лев(ПолнаяДатаДокумента, ПозицияРазделителя -1),
		Прав(ПолнаяДатаДокумента, ДлинаСтроки - ПозицияРазделителя));
	
	СтруктураПараметров.Вставить("ДатаДокумента", ПредставлениеДаты);
	
	ИННПоставщика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "ИНН,", Ложь);
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеПечати, "ОрганизацияВДокументе") Тогда
		КПППоставщика = ОрганизацииЛокализация.КППНаДату(ДанныеПечати.ОрганизацияВДокументе, ДанныеПечати.Дата);
	Иначе
		КПППоставщика = ОрганизацииЛокализация.КППНаДату(ДанныеПечати.Организация, ДанныеПечати.Дата);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КПППоставщика) Тогда
		ПредставлениеОрганизации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1, ИНН/КПП %2/%3';
																								|en = '%1, TIN/KPP %2/%3'", Метаданные.Языки.Русский.КодЯзыка),
			СведенияОбОрганизации.ПолноеНаименование,
			ИННПоставщика,
			КПППоставщика);
	ИначеЕсли ЗначениеЗаполнено(ИННПоставщика) Тогда
		ПредставлениеОрганизации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1, ИНН %2';
																								|en = '%1, TIN %2'", Метаданные.Языки.Русский.КодЯзыка),
			СведенияОбОрганизации.ПолноеНаименование,
			ИННПоставщика);
	Иначе
		ПредставлениеОрганизации = СведенияОбОрганизации.ПолноеНаименование;
	КонецЕсли;
	СтруктураПараметров.Вставить("ПредставлениеОрганизации", ПредставлениеОрганизации);
	
	ТаблицаКонтрагентов = ТаблицаКонтрагентовСчетаФактуры(ДанныеПечати, ДанныеКонтрагентов);
	ПредставлениеКонтрагента    = "";
	
	Для Каждого СтрокаТаблицы Из ТаблицаКонтрагентов Цикл
		СведенияОПокупателе = СтрокаТаблицы.СведенияОПокупателе;
		ПолноеНаименование = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе, "ПолноеНаименование", Ложь);
		ИННПокупателя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе, "ИНН", Ложь);
		Если Не ПустаяСтрока(СтрокаТаблицы.КПП) Тогда
			ПредставлениеКонтрагента = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1; %2, ИНН/КПП %3/%4';
					|en = '%1; %2, TIN/KPP %3/%4'", Метаданные.Языки.Русский.КодЯзыка),
				ПредставлениеКонтрагента,
				ПолноеНаименование,
				ИННПокупателя,
				СтрокаТаблицы.КПП);
		ИначеЕсли ЗначениеЗаполнено(ИННПокупателя) Тогда
			ПредставлениеКонтрагента = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1; %2, ИНН %3';
					|en = '%1; %2, TIN %3'", Метаданные.Языки.Русский.КодЯзыка),
				ПредставлениеКонтрагента,
				ПолноеНаименование,
				ИННПокупателя);
		Иначе
			ПредставлениеКонтрагента = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1; %2';
					|en = '%1; %2'"),
				ПредставлениеКонтрагента,
				ПолноеНаименование);
		КонецЕсли;
	
	КонецЦикла;
	СтруктураПараметров.Вставить("ПредставлениеКонтрагента", Сред(ПредставлениеКонтрагента, 3));
	
	Если ЗначениеЗаполнено(ДанныеПечати.ДоверенностьНомер) И ЗначениеЗаполнено(ДанныеПечати.ДоверенностьДата)
		И (ЗначениеЗаполнено(ДанныеПечати.ДоверенностьВыдана) Или ЗначениеЗаполнено(ДанныеПечати.ДоверенностьЛицо)) Тогда
		
		ТекстОснования = СокрЛП(ДанныеПечати.Основание) + "; "
			+ СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'по доверенности №%1 от %2, выданной %3 %4';
																			|en = 'against the letter of authority No. %1 from %2 issued by %3 to %4'", Метаданные.Языки.Русский.КодЯзыка),
				ДанныеПечати.ДоверенностьНомер,
				Формат(ДанныеПечати.ДоверенностьДата, "ДЛФ=DD"),
				ДанныеПечати.ДоверенностьВыдана,
				ДанныеПечати.ДоверенностьЛицо);
		СтруктураПараметров.Вставить("Основание", ТекстОснования);
		
	КонецЕсли;
	
	ОбластьПодвала.Параметры.Заполнить(СтруктураПараметров);
	
КонецПроцедуры // <-БИТ> Руденков_Е.И. 08.04.2024

//&Вместо("ЗаполнитьТабличныйДокументСчетФактура")
//Процедура КАНАТ_ЗаполнитьТабличныйДокументСчетФактура(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати, ОпцииПечатиСчетаФактуры)
//	Перем ВыборкаОснований, ВыборкаКонтрагентов, ВыборкаПоставщиков;
//	
//	ВыводитьСерии = Константы.ВыводитьСерииВПечатныхФормах.Получить() 
//					И ДанныеДляПечати.РезультатПоТабличнойЧасти.Колонки.Найти("СерияНаименование") <> Неопределено;
//	ИспользоватьПечатныеФормыСФ2_5 = Ложь;
//	ОпцииПечатиСчетаФактуры.Вставить("ИспользоватьПечатныеФормыСФ2_5", ИспользоватьПечатныеФормыСФ2_5);
//					
//	Макет451            = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьОбщихФорм.ПФ_MXL_СчетФактура451_ru");
//	Макет1137           = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьОбщихФорм.ПФ_MXL_СчетФактура1137_ru");
//	Макет1137_625       = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьОбщихФорм.ПФ_MXL_СчетФактура1137_625_ru");
//	Макет981            = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьОбщихФорм.ПФ_MXL_СчетФактура981_ru");
//	Макет534            = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьОбщихФорм.ПФ_MXL_СчетФактура534_ru");
//	Макет534_2_5        = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_СчетФактура534");
//	Макет534Прослеж_2_5 = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_СчетФактура534Прослеж");
//	Макет2023Кв4Прослеж = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_СчетФактура2023Кв4Прослеж");
//	МакетКорр           = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьОбщихФорм.ПФ_MXL_СчетФактураКорректировочный1137_ru");
//	МакетКорр_625       = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьОбщихФорм.ПФ_MXL_СчетФактураКорректировочный1137_625_ru");
//	МакетКорр_981       = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьОбщихФорм.ПФ_MXL_СчетФактураКорректировочный981_ru");
//	МакетКорр_534       = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьОбщихФорм.ПФ_MXL_СчетФактураКорректировочный534_ru");
//	МакетКорр_534_2_5   = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_КорректировочныйСчетФактура534");
//	МакетКорр_534Прослеж_2_5 = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_КорректировочныйСчетФактура534Прослеж");
//	МакетКорр_2023Кв4Прослеж = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_КорректировочныйСчетФактура2023Кв4Прослеж");
//	
//	ДанныеПечати        = ДанныеДляПечати.РезультатПоШапке.Выбрать();
//	ВыборкаПоДокументам = ДанныеДляПечати.РезультатПоТабличнойЧасти.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
//	Если ДанныеДляПечати.Свойство("РезультатПоКонтрагентам") И Не ДанныеДляПечати.РезультатПоКонтрагентам.Пустой() Тогда
//		ВыборкаКонтрагентов = ДанныеДляПечати.РезультатПоКонтрагентам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
//	КонецЕсли;
//	Если ДанныеДляПечати.Свойство("РезультатПоИсходнымДанным") Тогда
//		ВыборкаОснований = ДанныеДляПечати.РезультатПоИсходнымДанным.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
//	КонецЕсли;
//	ПрослеживаемыеОС = Неопределено;
//	ПрослеживаемыеКомплектующие = Неопределено;
//	ЕстьПрослеживаемыеТоварыВТабличнойЧасти = Ложь;
//	Если ДанныеДляПечати.Свойство("Прослеживаемость") Тогда
//		ПрослеживаемыеОС = ДанныеДляПечати.Прослеживаемость.Выгрузить();
//		Если ПрослеживаемыеОС.Количество() > 0 Тогда
//			ЕстьПрослеживаемыеТоварыВТабличнойЧасти = Истина;
//		Иначе
//			ПрослеживаемыеОС = Неопределено;
//		КонецЕсли;
//	КонецЕсли;
//	Если ДанныеДляПечати.Свойство("ПрослеживаемыеКомплектующие") Тогда
//		ПрослеживаемыеКомплектующие = ДанныеДляПечати.ПрослеживаемыеКомплектующие;
//		Если ПрослеживаемыеКомплектующие.Количество() > 0 Тогда
//			ЕстьПрослеживаемыеТоварыВТабличнойЧасти = Истина;
//		Иначе
//			ПрослеживаемыеКомплектующие = Неопределено;
//		КонецЕсли;
//	КонецЕсли;
//	
//	ЕстьПостановление914 = ЛОЖЬ;
//	ЕстьПостановление534 = ЛОЖЬ;
//	ЕстьПостановление981 = ЛОЖЬ;
//	ЕстьПостановление1137_625 = ЛОЖЬ;
//	ЕстьПостановление1137 = ЛОЖЬ;
//	
//	ПервыйДокумент = Истина;
//	Пока ДанныеПечати.Следующий() Цикл
//		
//		ВалютаРегламентированногоУчета = ВалютаРегламентированногоУчета(ДанныеПечати);
//		
//		Если ЗначениеЗаполнено(ДанныеПечати.ВалютаСчетаФактуры)
//			И ОпцииПечатиСчетаФактуры.ПечатьВВалюте
//			И ДанныеПечати.ВалютаСчетаФактуры = ВалютаРегламентированногоУчета Тогда
//			
//			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
//				НСтр("ru = 'Для %1 указана валюта: рубли. Не требуется печатать счет-фактуру в иностранной валюте.';
//					|en = 'Currency is specified for %1: rubles. No need to print a tax invoice in a foreign currency.'"),
//				ДанныеПечати.Ссылка);
//			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
//				Текст,
//				ДанныеПечати.Ссылка);
//			
//		ИначеЕсли ЗначениеЗаполнено(ДанныеПечати.ВалютаСчетаФактуры)
//			И НЕ ОпцииПечатиСчетаФактуры.ПечатьВВалюте
//			И ДанныеПечати.ВалютаСчетаФактуры <> ВалютаРегламентированногоУчета  Тогда
//			
//			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
//				НСтр("ru = 'Для %1 указана иностранная валюта. Не требуется печатать счет-фактуру в рублях.';
//					|en = 'Foreign currency is specified for %1. No need to print the tax invoice in rubles.'"),
//				ДанныеПечати.Ссылка);
//			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
//				Текст,
//				ДанныеПечати.Ссылка);
//			
//		Иначе
//			
//			ДействующиеПостановления = Новый Структура;
//			ДействующиеПостановления.Вставить("Постановление914",  Ложь);
//			ДействующиеПостановления.Вставить("Постановление1137", Истина);
//			ДействующиеПостановления.Вставить("Постановление1137_625", ВедетсяУчетНДСПоФЗ56(ДанныеПечати.Дата,ДанныеПечати.ДатаИсправления));
//			ДействующиеПостановления.Вставить("Постановление981", ДействуетПостановление981(ДанныеПечати.Дата,ДанныеПечати.ДатаИсправления));
//			ДействующиеПостановления.Вставить(
//				"Постановление534",
//				ДействуетПостановление534(ДанныеПечати.Дата, ДанныеПечати.ДатаИсправления));
//				
//			Действует2023Кв4 = Действует2023Кв4(ДанныеПечати.Дата, ДанныеПечати.ДатаИсправления);
//			
//			ОпцииПечатиСчетаФактуры.Вставить("ДействующиеПостановления", ДействующиеПостановления);
//			
//			Если ДанныеПечати.КорректировочныйСчетФактура Тогда
//				Если ДействующиеПостановления.Постановление534 Тогда
//					ИспользоватьПечатныеФормыСФ2_5 = ПолучитьФункциональнуюОпцию("ИспользоватьПечатныеФормыСФ2_5");
//					Если ИспользоватьПечатныеФормыСФ2_5 И Не ОпцииПечатиСчетаФактуры.СчетФактураНаАванс Тогда
//						ОпцииПечатиСчетаФактуры.ИспользоватьПечатныеФормыСФ2_5 = ИспользоватьПечатныеФормыСФ2_5;
//						Если ДанныеПечати.ЕстьПрослеживаемыеТовары Тогда
//							Макет = ?(Действует2023Кв4, МакетКорр_2023Кв4Прослеж, МакетКорр_534Прослеж_2_5);
//						Иначе
//							Макет = МакетКорр_534_2_5;
//						КонецЕсли;
//					Иначе
//						Макет = МакетКорр_534;
//					КонецЕсли;
//					ЕстьПостановление534 = Истина;
//				ИначеЕсли ДействующиеПостановления.Постановление981 Тогда
//					Макет = МакетКорр_981;
//					ЕстьПостановление981 = Истина;
//				ИначеЕсли ДействующиеПостановления.Постановление1137_625 Тогда
//					Макет = МакетКорр_625;
//					ЕстьПостановление1137_625 = Истина;
//				Иначе
//					Макет = МакетКорр;
//					ЕстьПостановление1137 = Истина;
//				КонецЕсли;
//			ИначеЕсли ДействующиеПостановления.Постановление914 Тогда
//				Макет = Макет451;
//				ЕстьПостановление914 = Истина;
//			ИначеЕсли ДействующиеПостановления.Постановление534 Тогда
//				ИспользоватьПечатныеФормыСФ2_5 = ПолучитьФункциональнуюОпцию("ИспользоватьПечатныеФормыСФ2_5");
//				Если ИспользоватьПечатныеФормыСФ2_5 Тогда
//					ОпцииПечатиСчетаФактуры.ИспользоватьПечатныеФормыСФ2_5 = ИспользоватьПечатныеФормыСФ2_5;
//					Если ДанныеПечати.ЕстьПрослеживаемыеТовары Или ЕстьПрослеживаемыеТоварыВТабличнойЧасти Тогда
//						Макет = ?(Действует2023Кв4, Макет2023Кв4Прослеж, Макет534Прослеж_2_5);
//					Иначе
//						Макет = Макет534_2_5;
//					КонецЕсли;
//				Иначе
//					Макет = Макет534;
//				КонецЕсли;
//				ЕстьПостановление534 = Истина;
//			ИначеЕсли ДействующиеПостановления.Постановление981 Тогда
//				Макет = Макет981;
//				ЕстьПостановление981 = Истина;
//			ИначеЕсли ДействующиеПостановления.Постановление1137_625 Тогда
//				Макет = Макет1137_625;
//				ЕстьПостановление1137_625 = Истина;
//			Иначе
//				Макет = Макет1137;
//				ЕстьПостановление1137 = Истина;
//			КонецЕсли;
//			Макет.КодЯзыка = Метаданные.Языки.Русский.КодЯзыка;
//			
//			Если (ЕстьПостановление914 И ЕстьПостановление1137)
//				ИЛИ (ЕстьПостановление914 И ЕстьПостановление981)
//				ИЛИ ((ЕстьПостановление1137 ИЛИ ЕстьПостановление1137_625) И ЕстьПостановление981)
//				Или ЕстьПостановление534 И (ЕстьПостановление914
//											Или ЕстьПостановление1137
//											Или ЕстьПостановление1137_625
//											Или ЕстьПостановление981) Тогда
//				
//				Текст = НСтр("ru = 'Недоступна одновременная печать счетов-фактур, сформированных по разным постановлениям Правительства РФ';
//							|en = 'Cannot print tax invoices generated by different decrees of the RF Government at the same time'");
//				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
//					Текст,
//					ДанныеПечати.Ссылка);
//				
//				ТабличныйДокумент.Очистить();
//				Прервать;
//				
//			КонецЕсли;
//			
//			ОпцииПечатиСчетаФактуры.Вставить("Макет", Макет);
//			
//			Если Не ПервыйДокумент Тогда
//				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
//			КонецЕсли;
//			
//			ПервыйДокумент = Ложь;
//			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
//			
//			ТекстПредставленияКомиссионера = "";
//			ВыборкаПоставщиков = Неопределено;
//			Если ДанныеДляПечати.Свойство("РезультатПоПоставщикам")
//				И ДанныеПечати.ПеревыставленныйСчетФактура
//				И (ЕстьПостановление981 Или ЕстьПостановление534) Тогда
//				ВыборкаПоставщиков = ДанныеДляПечати.РезультатПоПоставщикам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
//				СведенияОКомиссионере = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Организация, ДанныеПечати.Дата);
//				
//				ДополнительноеПредставление = "";
//				Если ДействующиеПостановления.Постановление914 И СведенияОКомиссионере.ОфициальноеНаименование <> СведенияОКомиссионере.ПолноеНаименование Тогда
//					ДополнительноеПредставление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
//						НСтр("ru = '(%1)';
//							|en = '(%1)'"),
//						ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОКомиссионере, "ПолноеНаименование"));
//				КонецЕсли;
//				
//				ПредставлениеКомиссионера = СокрЛП(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
//					НСтр("ru = '%1 %2';
//						|en = '%1 %2'"),
//					СведенияОКомиссионере.ПолноеНаименование,
//					ДополнительноеПредставление));
//					
//				АдресКомиссионера = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
//					НСтр("ru = '%1';
//						|en = '%1'"),
//					ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОКомиссионере, "ЮридическийАдрес"));
//					
//				ИННКомиссионера = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
//					НСтр("ru = '%1/%2';
//						|en = '%1/%2'"),
//					ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОКомиссионере, "ИНН", Ложь),
//					ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОКомиссионере, "КПП", Ложь));

//				ТекстПредставленияКомиссионера = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
//					НСтр("ru = 'Составлен комиссионером (агентом):%1, %2, ИНН/КПП: %3';
//						|en = 'Completed by consignee (agent):%1, %2, TIN/KPP: %3'"),
//					ПредставлениеКомиссионера, АдресКомиссионера, ИННКомиссионера);

//			ИначеЕсли ЕстьПостановление534 Тогда
//				ТекстПредставленияКомиссионера = ДанныеПечати.ПредставлениеВыставленКомиссионеру;
//			КонецЕсли;
//				
//			// Выводим общие реквизиты шапки
//			СведенияОбОрганизации = Новый Структура;
//			ЗаполнитьРеквизитыШапкиСчетФактура(
//				ДанныеПечати,
//				ВыборкаОснований,
//				СведенияОбОрганизации,
//				ВыборкаКонтрагентов,
//				ТабличныйДокумент,
//				ОпцииПечатиСчетаФактуры,
//				ВыборкаПоставщиков);
//			
//			// Выводим заголовок таблицы
//			ЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
//			Если ДействующиеПостановления.Постановление914 И Не ДанныеПечати.КорректировочныйСчетФактура Тогда
//				СтруктураПараметров = Новый Структура;
//				Если ОпцииПечатиСчетаФактуры.ПечатьВВалюте Тогда
//					СтруктураПараметров.Вставить("Валюта", ДанныеПечати.Валюта)
//				Иначе
//					СтруктураПараметров.Вставить("Валюта", ВалютаРегламентированногоУчета);
//				КонецЕсли;
//				ЗаголовокТаблицы.Параметры.Заполнить(СтруктураПараметров);
//			КонецЕсли;
//			ТабличныйДокумент.Вывести(ЗаголовокТаблицы);
//			
//			НомерСтраницы = 1;
//			
//			// Инициализация итогов в документе
//			Если ИспользоватьПечатныеФормыСФ2_5 Тогда
//				ИтоговыеСуммы = СтруктураИтоговыеСуммы2_5();
//			Иначе
//				ИтоговыеСуммы = СтруктураИтоговыеСуммы();
//			КонецЕсли;
//			
//			// Создаем массив для проверки вывода
//			МассивВыводимыхОбластей = Новый Массив;
//			
//			// Выводим многострочную часть документа
//			Если ОпцииПечатиСчетаФактуры.СчетФактураНаАванс И ДанныеПечати.КорректировочныйСчетФактура И Не ИспользоватьПечатныеФормыСФ2_5 Тогда
//				ОбластьМакетаСтандарт = Макет.ПолучитьОбласть("СтрокаАвансы");
//			Иначе
//				ОбластьМакетаСтандарт = Макет.ПолучитьОбласть("Строка");
//			КонецЕсли;
//			ОбластьИтого = Макет.ПолучитьОбласть("Итого");
//			ОбластьПодвала = Макет.ПолучитьОбласть("Подвал");
//			ВыводитьОбластьКомиссионера = Ложь;
//			
//			Если Не ПустаяСтрока(ТекстПредставленияКомиссионера) Тогда
//				ОбластьКомиссионера = Макет.ПолучитьОбласть("РеквизитыКомиссионера");
//				СтруктураПараметров = Новый Структура();
//				СтруктураПараметров.Вставить("ПредставлениеКомиссионера",ТекстПредставленияКомиссионера);
//				ОбластьКомиссионера.Параметры.Заполнить(СтруктураПараметров);
//				ВыводитьОбластьКомиссионера = Истина;
//			КонецЕсли;
//			
//			СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);
//			ВыборкаПоДокументам.НайтиСледующий(СтруктураПоиска);
//			
//			ИспользоватьНаборы = Ложь;
//			Если ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(ВыборкаПоДокументам, "ЭтоНабор") Тогда
//				ИспользоватьНаборы = Истина;
//				Если ИспользоватьПечатныеФормыСФ2_5 Тогда
//					ОбластьМакетаНабор         = Макет.ПолучитьОбласть("Строка");
//					ОбластьМакетаКомплектующие = Макет.ПолучитьОбласть("Строка");
//				Иначе
//					ОбластьМакетаНабор         = Макет.ПолучитьОбласть("СтрокаНабор");
//					ОбластьМакетаКомплектующие = Макет.ПолучитьОбласть("СтрокаКомплектующие");
//				КонецЕсли;
//			КонецЕсли;
//			
//			ЗаполнитьРеквизитыПодвалаСчетФактура(ОбластьПодвала, ДанныеПечати, СведенияОбОрганизации);
//			
//			ВыводитьКодыТНВЭД = ВыводитьКодыТНВЭД(ДанныеПечати, ДействующиеПостановления.Постановление981);
//			
//			ОперацияОблагаетсяНДСУПокупателя = Ложь;
//			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеПечати,"НалогообложениеНДС") 
//				И ДанныеПечати.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДСУПокупателя Тогда
//				ОперацияОблагаетсяНДСУПокупателя = Истина;
//			КонецЕсли;
//			
//			ОперацияОблагаетсяНДССМежценовойРазницы = Ложь;
//			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеПечати,"НалогообложениеНДС") 
//				И ДанныеПечати.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДССМежценовойРазницы Тогда
//				ОперацияОблагаетсяНДССМежценовойРазницы = Истина;
//			КонецЕсли;
//			
//			СтрокаТовары = ВыборкаПоДокументам.Выбрать();
//			КоличествоСтрок = СтрокаТовары.Количество();
//			ТолькоСтавкаБезНДС = Истина;
//			НомерСтроки = 0;
//			ПрефиксНабора = "";
//			ТекущаяНоменклатураНабора = Справочники.Номенклатура.ПустаяСсылка();
//			ТекущаяХарактеристикаНабора = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
//			Пока СтрокаТовары.Следующий() Цикл
//			СтрокаБезРасхождений = ДанныеПечати.КорректировочныйСчетФактура
//									И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТовары, "РазницаБезНДСУвеличение")
//									И СтрокаТовары.РазницаБезНДСУвеличение = СтрокаТовары.РазницаБезНДСУменьшение
//									И СтрокаТовары.РазницаНДСУвеличение = СтрокаТовары.РазницаНДСУменьшение
//									И СтрокаТовары.РазницаСНДСУвеличение = СтрокаТовары.РазницаСНДСУменьшение;
//			Если Не СтрокаБезРасхождений Тогда
//				Если ПрослеживаемыеОС <> Неопределено Тогда
//					ПрослеживаемыеТоварыСтрокаТовары = ПрослеживаемыеОС.НайтиСтроки(Новый Структура("НомерСтрокиСФ", СтрокаТовары.НомерСтроки));
//				ИначеЕсли ПрослеживаемыеКомплектующие <> Неопределено Тогда
//					ПрослеживаемыеТоварыСтрокаТовары = ПрослеживаемыеКомплектующие.НайтиСтроки(Новый Структура("НомерГТД", СтрокаТовары.НомерГТД));
//				Иначе
//					ПрослеживаемыеТоварыСтрокаТовары = Неопределено;
//				КонецЕсли;
//				
//				Если ДанныеПечати.КорректировочныйСчетФактура Тогда
//					ОбластьМакета = ОбластьМакетаСтандарт;
//				ИначеЕсли НаборыСервер.ИспользоватьОбластьНабор(СтрокаТовары, ИспользоватьНаборы) Тогда
//					ОбластьМакета = ОбластьМакетаНабор;
//				ИначеЕсли НаборыСервер.ИспользоватьОбластьКомплектующие(СтрокаТовары, ИспользоватьНаборы) Тогда
//					ОбластьМакета = ОбластьМакетаКомплектующие;
//				Иначе
//					ОбластьМакета = ОбластьМакетаСтандарт;
//				КонецЕсли;
//				
//				ПараметрыПечати = Новый Структура("Корректировочный,СчетФактураНаАванс,ЕстьПрослеживаемыеТовары", ДанныеПечати.КорректировочныйСчетФактура, ОпцииПечатиСчетаФактуры.СчетФактураНаАванс, ДанныеПечати.ЕстьПрослеживаемыеТовары);
//				
//				Если НаборыСервер.ВыводитьТолькоЗаголовок(СтрокаТовары, ИспользоватьНаборы) Тогда
//					КоличествоСтрок = КоличествоСтрок - 1;
//					Если ИспользоватьПечатныеФормыСФ2_5 Тогда
//						ЗаполнитьРеквизитыСтрокиТовара2_5(СтрокаТовары,
//													   ПрослеживаемыеТоварыСтрокаТовары,
//													   ОбластьМакета,
//													   Неопределено,
//													   ПараметрыПечати,
//													   ДанныеПечати.КорректировочныйСчетФактура,
//													   ВыводитьКодыТНВЭД,
//													   ВыводитьСерии);
//													   
//						Если НаборыСервер.ИспользоватьОбластьНабор(СтрокаТовары, ИспользоватьНаборы) 
//							И ДанныеПечати.КорректировочныйСчетФактура Тогда
//							ПрефиксНабора = ОбластьМакета.Параметры.НаименованиеНоменклатуры;
//							ТекущаяНоменклатураНабора = СтрокаТовары.НоменклатураНабора;
//							ТекущаяХарактеристикаНабора = СтрокаТовары.ХарактеристикаНабора;
//						КонецЕсли;
//					Иначе
//						ЗаполнитьРеквизитыСтрокиТовара(СтрокаТовары, 
//													   ОбластьМакета, 
//													   Неопределено, 
//													   ДанныеПечати.КорректировочныйСчетФактура, 
//													   ВыводитьКодыТНВЭД, 
//													   ВыводитьСерии,
//													   ОпцииПечатиСчетаФактуры.СчетФактураНаАванс);
//													   
//						Если НаборыСервер.ИспользоватьОбластьНабор(СтрокаТовары, ИспользоватьНаборы) 
//							И ДанныеПечати.КорректировочныйСчетФактура Тогда
//							ПрефиксНабора = ОбластьМакета.Параметры.ПредставлениеНоменклатуры;
//							ТекущаяНоменклатураНабора = СтрокаТовары.НоменклатураНабора;
//							ТекущаяХарактеристикаНабора = СтрокаТовары.ХарактеристикаНабора;
//						КонецЕсли;
//					КонецЕсли;
//				Иначе
//					НомерСтроки = НомерСтроки + 1;
//					Если ИспользоватьПечатныеФормыСФ2_5 И Не (ОпцииПечатиСчетаФактуры.СчетФактураНаАванс И ДанныеПечати.КорректировочныйСчетФактура) Тогда
//						ЗаполнитьРеквизитыСтрокиТовара2_5(СтрокаТовары,
//													   ПрослеживаемыеТоварыСтрокаТовары,
//													   ОбластьМакета,
//													   СтрокаТовары.НомерСтроки,
//													   ПараметрыПечати,
//													   ДанныеПечати.КорректировочныйСчетФактура,
//													   ВыводитьКодыТНВЭД,
//													   ВыводитьСерии);
//						ПроставитьПрочеркиВПустыеПоляСтроки(ОбластьМакета);
//						
//						Если НаборыСервер.ИспользоватьОбластьКомплектующие(СтрокаТовары, ИспользоватьНаборы) 
//							И ПрефиксНабора <> ""
//							И СтрокаТовары.НоменклатураНабора = ТекущаяНоменклатураНабора
//							И СтрокаТовары.ХарактеристикаНабора = ТекущаяХарактеристикаНабора Тогда
//							ОбластьМакета.Параметры.НаименованиеНоменклатуры = ПрефиксНабора
//																				+ Символы.ПС
//																				+ ОбластьМакета.Параметры.НаименованиеНоменклатуры;
//						КонецЕсли;
//					Иначе
//						//БИТ_Гурьев__02.05.24++
//						//ЗаполнитьРеквизитыСтрокиТовара(СтрокаТовары, 
//						//							   ОбластьМакета, 
//						//							   СтрокаТовары.НомерСтроки, 
//						//							   ДанныеПечати.КорректировочныйСчетФактура, 
//						//							   ВыводитьКодыТНВЭД, 
//						//							   ВыводитьСерии,
//						//							   ОпцииПечатиСчетаФактуры.СчетФактураНаАванс);
//						ЗаполнитьРеквизитыСтрокиТовара(СтрокаТовары, 
//													   ОбластьМакета, 
//													   НомерСтроки, 
//													   ДанныеПечати.КорректировочныйСчетФактура, 
//													   ВыводитьКодыТНВЭД, 
//													   ВыводитьСерии,
//													   ОпцииПечатиСчетаФактуры.СчетФактураНаАванс);
//						//БИТ_Гурьев__02.05.24--
//						ПроставитьПрочеркиВПустыеПоляСтроки(ОбластьМакета);
//						
//						Если НаборыСервер.ИспользоватьОбластьКомплектующие(СтрокаТовары, ИспользоватьНаборы) 
//							И ПрефиксНабора <> ""
//							И СтрокаТовары.НоменклатураНабора = ТекущаяНоменклатураНабора
//							И СтрокаТовары.ХарактеристикаНабора = ТекущаяХарактеристикаНабора Тогда
//							ОбластьМакета.Параметры.ПредставлениеНоменклатуры = ПрефиксНабора
//																				+ Символы.ПС
//																				+ ОбластьМакета.Параметры.ПредставлениеНоменклатуры;
//						КонецЕсли;
//					КонецЕсли;
//					
//					Если ОперацияОблагаетсяНДССМежценовойРазницы Тогда
//						ЗначениеСтавкиНДС = УчетНДСУПКлиентСервер.ЗначениеСтавкиНДС(СтрокаТовары.СтавкаНДС);
//						Если ИспользоватьПечатныеФормыСФ2_5 Тогда 
//							Если ПараметрыПечати.Корректировочный Тогда 
//								ОбластьМакета.Параметры.СтоимостьБезНДСДоИзменения = ?(ЗначениеСтавкиНДС = 0, 0, 100 * СтрокаТовары.СуммаНДСДо / ЗначениеСтавкиНДС);
//								ОбластьМакета.Параметры.СтоимостьБезНДСПослеИзменения = ?(ЗначениеСтавкиНДС = 0, 0, 100 * СтрокаТовары.СуммаНДС / ЗначениеСтавкиНДС);
//							Иначе
//								ОбластьМакета.Параметры.Стоимость   = ?(ЗначениеСтавкиНДС = 0, 0, 100 * СтрокаТовары.СуммаНДС / ЗначениеСтавкиНДС);
//							КонецЕсли;
//						Иначе 
//							Если ПараметрыПечати.Корректировочный Тогда 
//								ОбластьМакета.Параметры.СуммаБезНДСДо = ?(ЗначениеСтавкиНДС = 0, 0, 100 * СтрокаТовары.СуммаНДСДо / ЗначениеСтавкиНДС);
//							КонецЕсли;
//							ОбластьМакета.Параметры.СуммаБезНДС   = ?(ЗначениеСтавкиНДС = 0, 0, 100 * СтрокаТовары.СуммаНДС / ЗначениеСтавкиНДС);
//						КонецЕсли;
//					КонецЕсли;
//					
//				КонецЕсли;
//				
//				СтруктураПараметров = Новый Структура;
//				Если ОперацияОблагаетсяНДСУПокупателя Тогда
//					Если ИспользоватьПечатныеФормыСФ2_5 Тогда
//						СтруктураПараметров.Вставить("СтавкаНДС",               НСтр("ru = 'НДС исчисляется налоговым агентом';
//																					|en = 'VAT is calculated by tax agent'", Метаданные.Языки.Русский.КодЯзыка));
//						СтруктураПараметров.Вставить("СтавкаНДСДоИзменения",    НСтр("ru = 'НДС исчисляется налоговым агентом';
//																					|en = 'VAT is calculated by tax agent'", Метаданные.Языки.Русский.КодЯзыка));
//						СтруктураПараметров.Вставить("СтавкаНДСПослеИзменения", НСтр("ru = 'НДС исчисляется налоговым агентом';
//																					|en = 'VAT is calculated by tax agent'", Метаданные.Языки.Русский.КодЯзыка));
//						СтруктураПараметров.Вставить("СуммаНДСПослеИзменения", "--");
//						СтруктураПараметров.Вставить("СуммаНДСДоИзменения", "--");
//						СтруктураПараметров.Вставить("СтоимостьСНДСПослеИзменения", "--");
//						СтруктураПараметров.Вставить("СтоимостьСНДСДоИзменения", "--");
//						СтруктураПараметров.Вставить("Всего", "--");
//					Иначе
//						СтруктураПараметров.Вставить("СтавкаНДС", НСтр("ru = 'НДС исчисляется налоговым агентом';
//																		|en = 'VAT is calculated by tax agent'", Метаданные.Языки.Русский.КодЯзыка));
//						СтруктураПараметров.Вставить("СуммаНДС", "--");
//						СтруктураПараметров.Вставить("СуммаНДСДо", "--");
//						СтруктураПараметров.Вставить("СуммаСНДС", "--");
//						СтруктураПараметров.Вставить("СуммаСНДСДо", "--");
//					КонецЕсли;
//					СтруктураПараметров.Вставить("РазницаНДСУменьшение", "--");
//					СтруктураПараметров.Вставить("РазницаНДСУвеличение", "--");
//					СтруктураПараметров.Вставить("РазницаСНДСУменьшение", "--");
//					СтруктураПараметров.Вставить("РазницаСНДСУвеличение", "--");
//					Если ОпцииПечатиСчетаФактуры.СчетФактураНаАванс Тогда
//						Если ИспользоватьПечатныеФормыСФ2_5 Тогда
//							СтруктураПараметров.Вставить("Стоимость", СтрокаТовары.СуммаСНДС);
//						Иначе
//							СтруктураПараметров.Вставить("СуммаБезНДС", СтрокаТовары.СуммаСНДС);
//						КонецЕсли;
//					КонецЕсли;
//				ИначеЕсли СтрокаТовары.СтавкаНДС = Справочники.СтавкиНДС.БезНДС Тогда
//					Если ИспользоватьПечатныеФормыСФ2_5 Тогда
//						СтруктураПараметров.Вставить("СтавкаНДСДоИзменения", НСтр("ru = 'без НДС';
//																					|en = 'Excluding VAT'", Метаданные.Языки.Русский.КодЯзыка));
//						СтруктураПараметров.Вставить("СтавкаНДСПослеИзменения", НСтр("ru = 'без НДС';
//																					|en = 'Excluding VAT'", Метаданные.Языки.Русский.КодЯзыка));
//						СтруктураПараметров.Вставить("СуммаНДСПослеИзменения", НСтр("ru = 'без НДС';
//																					|en = 'Excluding VAT'", Метаданные.Языки.Русский.КодЯзыка));
//						СтруктураПараметров.Вставить("СуммаНДСДоИзменения", НСтр("ru = 'без НДС';
//																				|en = 'Excluding VAT'", Метаданные.Языки.Русский.КодЯзыка));
//					Иначе
//						СтруктураПараметров.Вставить("СтавкаНДС", НСтр("ru = 'без НДС';
//																		|en = 'Excluding VAT'", Метаданные.Языки.Русский.КодЯзыка));
//						СтруктураПараметров.Вставить("СуммаНДС", НСтр("ru = 'без НДС';
//																		|en = 'Excluding VAT'", Метаданные.Языки.Русский.КодЯзыка));
//						СтруктураПараметров.Вставить("СуммаНДСДо", НСтр("ru = 'без НДС';
//																		|en = 'Excluding VAT'", Метаданные.Языки.Русский.КодЯзыка));
//					КонецЕсли;
//				ИначеЕсли СтрокаТовары.СтавкаНДС = УчетНДСЛокализация.СтавкаНДСПоПеречислению(Перечисления.СтавкиНДС.НДС0) Тогда
//					Если ИспользоватьПечатныеФормыСФ2_5 Тогда
//						СтруктураПараметров.Вставить("СуммаНДСПослеИзменения", 0);
//						СтруктураПараметров.Вставить("СуммаНДСДоИзменения", 0);
//					Иначе
//						СтруктураПараметров.Вставить("СуммаНДС", 0);
//						СтруктураПараметров.Вставить("СуммаНДСДо", 0);
//					КонецЕсли;
//					ТолькоСтавкаБезНДС = Ложь;
//				Иначе
//					ТолькоСтавкаБезНДС = Ложь;
//				КонецЕсли;
//				
//				Если Не НаборыСервер.ВыводитьТолькоЗаголовок(СтрокаТовары, ИспользоватьНаборы) Тогда
//					Если ДействующиеПостановления.Постановление914 
//						ИЛИ ОпцииПечатиСчетаФактуры.СчетФактураНаАванс
//						ИЛИ ОпцииПечатиСчетаФактуры.СчетФактураНалоговыйАгент Тогда
//						СтруктураПараметров.Вставить("Акциз", "--");
//					Иначе
//						СтруктураПараметров.Вставить("Акциз", НСтр("ru = 'без акциза';
//																	|en = 'no excise'", Метаданные.Языки.Русский.КодЯзыка));
//					КонецЕсли;
//				КонецЕсли;
//				
//				МассивВыводимыхОбластей.Очистить();
//				
//				Если Не(НаборыСервер.ВыводитьТолькоЗаголовок(СтрокаТовары, ИспользоватьНаборы) 
//					И ДанныеПечати.КорректировочныйСчетФактура) Тогда
//			
//					ОбластьМакета.Параметры.Заполнить(СтруктураПараметров);
//					МассивВыводимыхОбластей.Добавить(ОбластьМакета);
//					
//					Если НомерСтроки = КоличествоСтрок Тогда
//						МассивВыводимыхОбластей.Добавить(ОбластьИтого);
//						МассивВыводимыхОбластей.Добавить(ОбластьПодвала);
//						
//						Если ВыводитьОбластьКомиссионера Тогда
//							МассивВыводимыхОбластей.Добавить(ОбластьКомиссионера);
//						КонецЕсли;
//						
//					КонецЕсли;
//					
//					Если НЕ ТабличныйДокумент.ПроверитьВывод(МассивВыводимыхОбластей) Тогда
//						
//						НомерСтраницы = НомерСтраницы + 1;
//						ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
//						
//						Если Не ДействующиеПостановления.Постановление914 Тогда
//							
//							ОбластьНумерацияЛистов = Макет.ПолучитьОбласть("НумерацияЛистов");
//							Если ОпцииПечатиСчетаФактуры.НомерСформированВСчетеФактуре Тогда
//								ОбластьНумерацияЛистов.Параметры.Номер = ДанныеПечати.Номер;
//							Иначе
//								ОбластьНумерацияЛистов.Параметры.Номер = НомерСчетаФактурыНаПечать(ДанныеПечати.Номер, ДанныеПечати.ИндексПодразделения);
//							КонецЕсли;
//							Если Не ИспользоватьПечатныеФормыСФ2_5 Или ДанныеПечати.КорректировочныйСчетФактура Тогда
//								ОбластьНумерацияЛистов.Параметры.Дата = Формат(ДанныеПечати.Дата, "ДЛФ=ДД; ДП=--");
//							КонецЕсли;
//							ОбластьНумерацияЛистов.Параметры.НомерЛиста = НомерСтраницы;
//							
//							ТабличныйДокумент.Вывести(ОбластьНумерацияЛистов);
//							
//						КонецЕсли;
//						
//						ТабличныйДокумент.Вывести(ЗаголовокТаблицы);
//						
//					КонецЕсли;
//				
//					ТабличныйДокумент.Вывести(ОбластьМакета);
//				КонецЕсли;
//				
//				Если Не НаборыСервер.ИспользоватьОбластьКомплектующие(СтрокаТовары, ИспользоватьНаборы) Тогда
//					Если ИспользоватьПечатныеФормыСФ2_5 Тогда
//						РассчитатьИтоговыеСуммы2_5(ИтоговыеСуммы, ПараметрыПечати, СтрокаТовары, ПрослеживаемыеТоварыСтрокаТовары, ОперацияОблагаетсяНДССМежценовойРазницы);
//					Иначе
//						РассчитатьИтоговыеСуммы(ИтоговыеСуммы, СтрокаТовары, ОперацияОблагаетсяНДССМежценовойРазницы);
//					КонецЕсли;
//				КонецЕсли;
//			КонецЕсли;
//		КонецЦикла;
//			
//			// Выводим итоги по документу
//			ДобавитьИтоговыеДанныеПодвала(ИтоговыеСуммы, НомерСтроки, ВалютаРегламентированногоУчета);
//			
//			Если ДействующиеПостановления.Постановление1137
//				И (НЕ ОпцииПечатиСчетаФактуры.СчетФактураНаАванс)
//				И (НЕ ДанныеПечати.КорректировочныйСчетФактура)
//				И ТолькоСтавкаБезНДС Тогда
//				ИтоговыеСуммы.ИтогоСуммаНДС = НСтр("ru = 'без НДС';
//													|en = 'Excluding VAT'", Метаданные.Языки.Русский.КодЯзыка);
//			КонецЕсли;
//			
//			Если ДанныеПечати.КорректировочныйСчетФактура
//				И ТолькоСтавкаБезНДС Тогда
//					Если ИспользоватьПечатныеФормыСФ2_5 Тогда
//						ИтоговыеСуммы.Вставить("РазницаНДСУвеличение", НСтр("ru = 'без НДС';
//																			|en = 'Excluding VAT'", Метаданные.Языки.Русский.КодЯзыка));
//						ИтоговыеСуммы.Вставить("РазницаНДСУменьшение", НСтр("ru = 'без НДС';
//																			|en = 'Excluding VAT'", Метаданные.Языки.Русский.КодЯзыка));
//					Иначе
//						ИтоговыеСуммы.Вставить("ИтогоРазницаНДСУвеличение", НСтр("ru = 'без НДС';
//																				|en = 'Excluding VAT'", Метаданные.Языки.Русский.КодЯзыка));
//						ИтоговыеСуммы.Вставить("ИтогоРазницаНДСУменьшение", НСтр("ru = 'без НДС';
//																				|en = 'Excluding VAT'", Метаданные.Языки.Русский.КодЯзыка));
//					КонецЕсли;
//			КонецЕсли;
//			
//			Если ОперацияОблагаетсяНДСУПокупателя Тогда
//				Если ОпцииПечатиСчетаФактуры.СчетФактураНаАванс Тогда
//					Если ИспользоватьПечатныеФормыСФ2_5 Тогда
//						ИтоговыеСуммы.Вставить("ИтогоСтоимость", ИтоговыеСуммы.ИтогоСтоимость);
//					Иначе
//						ИтоговыеСуммы.Вставить("ИтогоСуммаБезНДС", ИтоговыеСуммы.ИтогоСуммаСНДС);
//						ИтоговыеСуммы.Вставить("ИтогоСуммаБезНДСНаСтранице", ИтоговыеСуммы.ИтогоСуммаСНДСНаСтранице);
//					КонецЕсли;
//				КонецЕсли;
//				Если ИспользоватьПечатныеФормыСФ2_5 Тогда
//					ИтоговыеСуммы.Вставить("ИтогоСуммаНДС", "--");
//					ИтоговыеСуммы.Вставить("ИтогоСуммаНДСНаСтранице", "--");
//					ИтоговыеСуммы.Вставить("ИтогоВсего", "--");
//					ИтоговыеСуммы.Вставить("ИтогоВсегоНаСтранице", "--");
//					Если ИтоговыеСуммы.РазницаСНДСУменьшение <> 0 Тогда
//						ИтоговыеСуммы.Вставить("РазницаСНДСУменьшение", "--");
//						ИтоговыеСуммы.Вставить("РазницаСНДСУменьшениеНаСтранице", "--");
//						ИтоговыеСуммы.Вставить("РазницаНДСУменьшение", "--");
//						ИтоговыеСуммы.Вставить("РазницаНДСУменьшениеНаСтранице", "--");
//					КонецЕсли;
//					Если ИтоговыеСуммы.РазницаСНДСУвеличение <> 0 Тогда
//						ИтоговыеСуммы.Вставить("РазницаСНДСУвеличение", "--");
//						ИтоговыеСуммы.Вставить("РазницаСНДСУвеличениеНаСтранице", "--");
//						ИтоговыеСуммы.Вставить("РазницаНДСУвеличение", "--");
//						ИтоговыеСуммы.Вставить("РазницаНДСУвеличениеНаСтранице", "--");
//					КонецЕсли;
//				Иначе
//					ИтоговыеСуммы.Вставить("ИтогоСуммаНДС", "--");
//					ИтоговыеСуммы.Вставить("ИтогоСуммаНДСНаСтранице", "--");
//					ИтоговыеСуммы.Вставить("ИтогоСуммаСНДС", "--");
//					ИтоговыеСуммы.Вставить("ИтогоСуммаСНДСНаСтранице", "--");
//					Если ИтоговыеСуммы.ИтогоРазницаСНДСУменьшение <> 0 Тогда
//						ИтоговыеСуммы.Вставить("ИтогоРазницаСНДСУменьшение", "--");
//						ИтоговыеСуммы.Вставить("ИтогоРазницаСНДСУменьшениеНаСтранице", "--");
//						ИтоговыеСуммы.Вставить("ИтогоРазницаНДСУменьшение", "--");
//						ИтоговыеСуммы.Вставить("ИтогоРазницаНДСУменьшениеНаСтранице", "--");
//					КонецЕсли;
//					Если ИтоговыеСуммы.ИтогоРазницаСНДСУвеличение <> 0 Тогда
//						ИтоговыеСуммы.Вставить("ИтогоРазницаСНДСУвеличение", "--");
//						ИтоговыеСуммы.Вставить("ИтогоРазницаСНДСУвеличениеНаСтранице", "--");
//						ИтоговыеСуммы.Вставить("ИтогоРазницаНДСУвеличение", "--");
//						ИтоговыеСуммы.Вставить("ИтогоРазницаНДСУвеличениеНаСтранице", "--");
//					КонецЕсли;
//				КонецЕсли;
//			КонецЕсли;
//			
//			ОбластьИтого.Параметры.Заполнить(ИтоговыеСуммы);
//			ПроставитьПрочеркиВПустыеПоляСтроки(ОбластьИтого);
//			ТабличныйДокумент.Вывести(ОбластьИтого);
//			
//			Если ИспользоватьПечатныеФормыСФ2_5 Тогда
//				УдалитьВсеОбластиФаксимиле(ОбластьПодвала);
//			КонецЕсли;
//			
//			ТабличныйДокумент.Вывести(ОбластьПодвала);
//			
//			Если ВыводитьОбластьКомиссионера Тогда
//				ТабличныйДокумент.Вывести(ОбластьКомиссионера);
//			КонецЕсли;
//			
//			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
//			
//		КонецЕсли;
//		
//	КонецЦикла;

//КонецПроцедуры

&ИзменениеИКонтроль("ЗаполнитьРеквизитыСтрокиТовара")
Процедура КАНАТ_ЗаполнитьРеквизитыСтрокиТовара(СтрокаТовары, ОбластьМакета, НомерСтроки, ВыводитьКодНоменклатуры, ВыводитьКодТНВД, ВыводитьСерии, СчетФактураНаАванс)

	ИспользоватьНаборы = ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(СтрокаТовары, "ЭтоНабор");

	ПрефиксИПостфикс = НаборыСервер.ПолучитьПрефиксИПостфикс(СтрокаТовары, ИспользоватьНаборы);

	ОбластьМакета.Параметры.Заполнить(СтрокаТовары);

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("КоличествоМест", 0);
	СтруктураПараметров.Вставить("КоличествоВОдномМесте", 0);
	СтруктураПараметров.Вставить("НоменклатураКод", "");
	СтруктураПараметров.Вставить("КодТНВЭД", "--");

	ЗаполнитьЗначенияСвойств(СтруктураПараметров, СтрокаТовары);
	ОкруглитьДоЦелого(СтруктураПараметров.КоличествоМест);
	СтруктураПараметров.Вставить("НомерСтроки", НомерСтроки);

	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТовары, "НомерГТД")
		И ЗначениеЗаполнено(СтрокаТовары.НомерГТД) Тогда

		ПредставлениеНомераГТД = Строка(СтрокаТовары.НомерГТД);
		ПозицияПодстроки = СтрНайти(ПредставлениеНомераГТД, НСтр("ru = 'и еще';
		|en = 'and'"));

		Если ПозицияПодстроки > 0 Тогда
			КоличествоСимволов			= СтрДлина(ПредставлениеНомераГТД);
			ИтоговоеКоличествоСимволов	= КоличествоСимволов - (КоличествоСимволов - ПозицияПодстроки + 2);

			ШаблонПредставдения		= "                              ";
			ПредставлениеНомераГТД	= СокрЛП(Лев(ПредставлениеНомераГТД, ИтоговоеКоличествоСимволов));
			ПредставлениеНомераГТД	= ПредставлениеНомераГТД + Лев(ШаблонПредставдения, 30 - СтрДлина(ПредставлениеНомераГТД));

			СтруктураПараметров.Вставить("НомерГТД", ПредставлениеНомераГТД);
		КонецЕсли;

	КонецЕсли;

	ДополнительныеПараметрыПолученияНаименованияДляПечати = НоменклатураКлиентСервер.ДополнительныеПараметрыПредставлениеНоменклатурыДляПечати();
	ДополнительныеПараметрыПолученияНаименованияДляПечати.ВозвратнаяТара = СтрокаТовары.ЭтоВозвратнаяТара;	
	ДополнительныеПараметрыПолученияНаименованияДляПечати.КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
	Если ВыводитьКодТНВД <> Неопределено Тогда
		ДополнительныеПараметрыПолученияНаименованияДляПечати.КодТНВЭД = ?(НЕ ВыводитьКодТНВД.ВыводитьВКолонке И ВыводитьКодТНВД.ВыводитьВСтроке, СтрокаТовары.КодТНВЭД, "");
		Если НЕ ВыводитьКодТНВД.ВыводитьВКолонке Тогда
			СтруктураПараметров.КодТНВЭД = "--";
		КонецЕсли;
	КонецЕсли;
	СерияНаименование = Неопределено;
	Если ВыводитьСерии Тогда
		СерияНаименование = СтрокаТовары.СерияНаименование;
	КонецЕсли;	
	ПредставлениеНоменклатуры =  ПрефиксИПостфикс.Префикс
	+ НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
	Строка(СтрокаТовары.НоменклатураНаименование),
	СтрокаТовары.ХарактеристикаНаименование,
	,
	СерияНаименование,
	ДополнительныеПараметрыПолученияНаименованияДляПечати)
	+ ПрефиксИПостфикс.Постфикс;
	
    #Вставка
	//Бит Трейгер П.М. 17.10.2024
	ПредставлениеНоменклатуры = СтрокаТовары.НоменклатураНаименование;
	//Бит Трейгер П.М. 17.10.2024
	#КонецВставки
	СтруктураПараметров.Вставить("ПредставлениеНоменклатуры", ПредставлениеНоменклатуры);

	Если Не ВыводитьКодНоменклатуры Тогда
		СтруктураПараметров.НоменклатураКод = "";
	КонецЕсли;
	ОбластьМакета.Параметры.Заполнить(СтруктураПараметров);

	Если ИспользоватьНаборы
		И СтрокаТовары.ЭтоКомплектующие
		И СтрокаТовары.ВариантПредставленияНабораВПечатныхФормах = Перечисления.ВариантыПредставленияНаборовВПечатныхФормах.НаборИКомплектующие
		И (СтрокаТовары.ВариантРасчетаЦеныНабора = Перечисления.ВариантыРасчетаЦенНаборов.ЦенаЗадаетсяЗаНаборРаспределяетсяПоДолям
		ИЛИ СтрокаТовары.ВариантРасчетаЦеныНабора = Перечисления.ВариантыРасчетаЦенНаборов.ЦенаЗадаетсяЗаНаборРаспределяетсяПоЦенам) Тогда
		// Область должна остаться незаполненной
		ОбластьМакета.Параметры.Заполнить(НаборыСервер.ПустыеДанные());
	ИначеЕсли ИспользоватьНаборы
		И СтрокаТовары.ЭтоНабор
		И СтрокаТовары.ВариантПредставленияНабораВПечатныхФормах = Перечисления.ВариантыПредставленияНаборовВПечатныхФормах.НаборИКомплектующие
		И (СтрокаТовары.ВариантРасчетаЦеныНабора = Перечисления.ВариантыРасчетаЦенНаборов.РассчитываетсяИзЦенКомплектующих
		ИЛИ СчетФактураНаАванс) Тогда
		// Область должна остаться незаполненной
		ОбластьМакета.Параметры.Заполнить(НаборыСервер.ПустыеДанные());
	КонецЕсли;

КонецПроцедуры

&ИзменениеИКонтроль("ЗаполнитьТабличныйДокументСчетФактура")
Процедура КАНАТ_ЗаполнитьТабличныйДокументСчетФактура(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати, ОпцииПечатиСчетаФактуры)

	Перем ВыборкаОснований, ВыборкаКонтрагентов, ВыборкаПоставщиков;

	ВыводитьСерии = Константы.ВыводитьСерииВПечатныхФормах.Получить() 
	И ДанныеДляПечати.РезультатПоТабличнойЧасти.Колонки.Найти("СерияНаименование") <> Неопределено;
	ИспользоватьПечатныеФормыСФ2_5 = Ложь;
	ОпцииПечатиСчетаФактуры.Вставить("ИспользоватьПечатныеФормыСФ2_5", ИспользоватьПечатныеФормыСФ2_5);

	Макет451             = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьОбщихФорм.ПФ_MXL_СчетФактура451_ru");
	Макет1137            = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьОбщихФорм.ПФ_MXL_СчетФактура1137_ru");
	Макет1137_625        = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьОбщихФорм.ПФ_MXL_СчетФактура1137_625_ru");
	Макет981             = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьОбщихФорм.ПФ_MXL_СчетФактура981_ru");
	Макет534             = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьОбщихФорм.ПФ_MXL_СчетФактура534_ru");
	Макет534_2_5         = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_СчетФактура534");
	Макет534Прослеж_2_5  = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_СчетФактура534Прослеж");
	Макет2023Кв4Прослеж  = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_СчетФактура2023Кв4Прослеж");
	Макет1096            = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьОбщихФорм.ПФ_MXL_СчетФактура1096_ru");
	Макет1096_2_5        = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_СчетФактура1096");
	Макет1096Прослеж_2_5 = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_СчетФактура1096Прослеж");
	МакетКорр            = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьОбщихФорм.ПФ_MXL_СчетФактураКорректировочный1137_ru");
	МакетКорр_625        = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьОбщихФорм.ПФ_MXL_СчетФактураКорректировочный1137_625_ru");
	МакетКорр_981        = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьОбщихФорм.ПФ_MXL_СчетФактураКорректировочный981_ru");
	МакетКорр_534        = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьОбщихФорм.ПФ_MXL_СчетФактураКорректировочный534_ru");
	МакетКорр_534_2_5    = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_КорректировочныйСчетФактура534");
	МакетКорр_534Прослеж_2_5  = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_КорректировочныйСчетФактура534Прослеж");
	МакетКорр_2023Кв4Прослеж  = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_КорректировочныйСчетФактура2023Кв4Прослеж");
	МакетКорр_1096            = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьОбщихФорм.ПФ_MXL_СчетФактураКорректировочный1096_ru");
	МакетКорр_1096_2_5        = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_КорректировочныйСчетФактура1096");
	МакетКорр_1096Прослеж_2_5 = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_КорректировочныйСчетФактура1096Прослеж");

	ДанныеПечати        = ДанныеДляПечати.РезультатПоШапке.Выбрать();
	ВыборкаПоДокументам = ДанныеДляПечати.РезультатПоТабличнойЧасти.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Если ДанныеДляПечати.Свойство("РезультатПоКонтрагентам") И Не ДанныеДляПечати.РезультатПоКонтрагентам.Пустой() Тогда
		ВыборкаКонтрагентов = ДанныеДляПечати.РезультатПоКонтрагентам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	КонецЕсли;
	Если ДанныеДляПечати.Свойство("РезультатПоИсходнымДанным") Тогда
		ВыборкаОснований = ДанныеДляПечати.РезультатПоИсходнымДанным.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	КонецЕсли;
	ПрослеживаемыеОС = Неопределено;
	ПрослеживаемыеКомплектующие = Неопределено;
	ЕстьПрослеживаемыеТоварыВТабличнойЧасти = Ложь;
	Если ДанныеДляПечати.Свойство("Прослеживаемость") Тогда
		ПрослеживаемыеОС = ДанныеДляПечати.Прослеживаемость.Выгрузить();
		Если ПрослеживаемыеОС.Количество() > 0 Тогда
			ЕстьПрослеживаемыеТоварыВТабличнойЧасти = Истина;
		Иначе
			ПрослеживаемыеОС = Неопределено;
		КонецЕсли;
	КонецЕсли;
	Если ДанныеДляПечати.Свойство("ПрослеживаемыеКомплектующие") Тогда
		ПрослеживаемыеКомплектующие = ДанныеДляПечати.ПрослеживаемыеКомплектующие;
		Если ПрослеживаемыеКомплектующие.Количество() > 0 Тогда
			ЕстьПрослеживаемыеТоварыВТабличнойЧасти = Истина;
		Иначе
			ПрослеживаемыеКомплектующие = Неопределено;
		КонецЕсли;
	КонецЕсли;

	ЕстьПостановление914 = ЛОЖЬ;
	ЕстьПостановление534 = ЛОЖЬ;
	ЕстьПостановление981 = ЛОЖЬ;
	ЕстьПостановление1137_625 = ЛОЖЬ;
	ЕстьПостановление1137 = ЛОЖЬ;
	ЕстьПостановление1096 = ЛОЖЬ;

	ПервыйДокумент = Истина;
	Пока ДанныеПечати.Следующий() Цикл

		ВалютаРегламентированногоУчета = ВалютаРегламентированногоУчета(ДанныеПечати);

		Если ЗначениеЗаполнено(ДанныеПечати.ВалютаСчетаФактуры)
			И ОпцииПечатиСчетаФактуры.ПечатьВВалюте
			И ДанныеПечати.ВалютаСчетаФактуры = ВалютаРегламентированногоУчета Тогда

			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Для %1 указана валюта: рубли. Не требуется печатать счет-фактуру в иностранной валюте.';
			|en = 'Currency is specified for %1: rubles. No need to print a tax invoice in a foreign currency.'"),
			ДанныеПечати.Ссылка);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			Текст,
			ДанныеПечати.Ссылка);

		ИначеЕсли ЗначениеЗаполнено(ДанныеПечати.ВалютаСчетаФактуры)
			И НЕ ОпцииПечатиСчетаФактуры.ПечатьВВалюте
			И ДанныеПечати.ВалютаСчетаФактуры <> ВалютаРегламентированногоУчета  Тогда

			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Для %1 указана иностранная валюта. Не требуется печатать счет-фактуру в рублях.';
			|en = 'Foreign currency is specified for %1. No need to print the tax invoice in rubles.'"),
			ДанныеПечати.Ссылка);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			Текст,
			ДанныеПечати.Ссылка);

		Иначе

			ДействующиеПостановления = Новый Структура;
			ДействующиеПостановления.Вставить("Постановление914",  Ложь);
			ДействующиеПостановления.Вставить("Постановление1137", Истина);
			ДействующиеПостановления.Вставить("Постановление1137_625", ВедетсяУчетНДСПоФЗ56(ДанныеПечати.Дата,ДанныеПечати.ДатаИсправления));
			ДействующиеПостановления.Вставить("Постановление981", ДействуетПостановление981(ДанныеПечати.Дата,ДанныеПечати.ДатаИсправления));
			ДействующиеПостановления.Вставить(
			"Постановление534",
			ДействуетПостановление534(ДанныеПечати.Дата, ДанныеПечати.ДатаИсправления));
			ДействующиеПостановления.Вставить(
			"Постановление1096",
			ДействуетПостановление1096(ДанныеПечати.Дата, ДанныеПечати.ДатаИсправления));

			Действует2023Кв4 = Действует2023Кв4(ДанныеПечати.Дата, ДанныеПечати.ДатаИсправления);

			ОпцииПечатиСчетаФактуры.Вставить("ДействующиеПостановления", ДействующиеПостановления);

			Если ДанныеПечати.КорректировочныйСчетФактура Тогда
				Если ДействующиеПостановления.Постановление1096 Тогда
					ИспользоватьПечатныеФормыСФ2_5 = ПолучитьФункциональнуюОпцию("ИспользоватьПечатныеФормыСФ2_5");
					Если ИспользоватьПечатныеФормыСФ2_5 И Не ОпцииПечатиСчетаФактуры.СчетФактураНаАванс Тогда
						ОпцииПечатиСчетаФактуры.ИспользоватьПечатныеФормыСФ2_5 = ИспользоватьПечатныеФормыСФ2_5;
						Если ДанныеПечати.ЕстьПрослеживаемыеТовары Тогда
							Макет = МакетКорр_1096Прослеж_2_5;
						Иначе
							Макет = МакетКорр_1096_2_5;
						КонецЕсли;
					Иначе
						Макет = МакетКорр_1096;
					КонецЕсли;
					ЕстьПостановление1096 = Истина;
				ИначеЕсли ДействующиеПостановления.Постановление534 Тогда
					ИспользоватьПечатныеФормыСФ2_5 = ПолучитьФункциональнуюОпцию("ИспользоватьПечатныеФормыСФ2_5");
					Если ИспользоватьПечатныеФормыСФ2_5 И Не ОпцииПечатиСчетаФактуры.СчетФактураНаАванс Тогда
						ОпцииПечатиСчетаФактуры.ИспользоватьПечатныеФормыСФ2_5 = ИспользоватьПечатныеФормыСФ2_5;
						Если ДанныеПечати.ЕстьПрослеживаемыеТовары Тогда
							Макет = ?(Действует2023Кв4, МакетКорр_2023Кв4Прослеж, МакетКорр_534Прослеж_2_5);
						Иначе
							Макет = МакетКорр_534_2_5;
						КонецЕсли;
					Иначе
						Макет = МакетКорр_534;
					КонецЕсли;
					ЕстьПостановление534 = Истина;
				ИначеЕсли ДействующиеПостановления.Постановление981 Тогда
					Макет = МакетКорр_981;
					ЕстьПостановление981 = Истина;
				ИначеЕсли ДействующиеПостановления.Постановление1137_625 Тогда
					Макет = МакетКорр_625;
					ЕстьПостановление1137_625 = Истина;
				Иначе
					Макет = МакетКорр;
					ЕстьПостановление1137 = Истина;
				КонецЕсли;
			ИначеЕсли ДействующиеПостановления.Постановление914 Тогда
				Макет = Макет451;
				ЕстьПостановление914 = Истина;
			ИначеЕсли ДействующиеПостановления.Постановление1096 Тогда
				ИспользоватьПечатныеФормыСФ2_5 = ПолучитьФункциональнуюОпцию("ИспользоватьПечатныеФормыСФ2_5");
				Если ИспользоватьПечатныеФормыСФ2_5 Тогда
					ОпцииПечатиСчетаФактуры.ИспользоватьПечатныеФормыСФ2_5 = ИспользоватьПечатныеФормыСФ2_5;
					Если ДанныеПечати.ЕстьПрослеживаемыеТовары Или ЕстьПрослеживаемыеТоварыВТабличнойЧасти Тогда
						Макет = Макет1096Прослеж_2_5;
					Иначе
						Макет = Макет1096_2_5;
					КонецЕсли;
				Иначе
					Макет = Макет1096;
				КонецЕсли;
				ЕстьПостановление1096 = Истина;
			ИначеЕсли ДействующиеПостановления.Постановление534 Тогда
				ИспользоватьПечатныеФормыСФ2_5 = ПолучитьФункциональнуюОпцию("ИспользоватьПечатныеФормыСФ2_5");
				Если ИспользоватьПечатныеФормыСФ2_5 Тогда
					ОпцииПечатиСчетаФактуры.ИспользоватьПечатныеФормыСФ2_5 = ИспользоватьПечатныеФормыСФ2_5;
					Если ДанныеПечати.ЕстьПрослеживаемыеТовары Или ЕстьПрослеживаемыеТоварыВТабличнойЧасти Тогда
						Макет = ?(Действует2023Кв4, Макет2023Кв4Прослеж, Макет534Прослеж_2_5);
					Иначе
						Макет = Макет534_2_5;
					КонецЕсли;
				Иначе
					Макет = Макет534;
				КонецЕсли;
				ЕстьПостановление534 = Истина;
			ИначеЕсли ДействующиеПостановления.Постановление981 Тогда
				Макет = Макет981;
				ЕстьПостановление981 = Истина;
			ИначеЕсли ДействующиеПостановления.Постановление1137_625 Тогда
				Макет = Макет1137_625;
				ЕстьПостановление1137_625 = Истина;
			Иначе
				Макет = Макет1137;
				ЕстьПостановление1137 = Истина;
			КонецЕсли;
			Макет.КодЯзыка = Метаданные.Языки.Русский.КодЯзыка;

			Если (ЕстьПостановление914 И ЕстьПостановление1137)
				ИЛИ (ЕстьПостановление914 И ЕстьПостановление981)
				ИЛИ ((ЕстьПостановление1137 ИЛИ ЕстьПостановление1137_625) И ЕстьПостановление981)
				Или ЕстьПостановление534 И (ЕстьПостановление914
				Или ЕстьПостановление1137
				Или ЕстьПостановление1137_625
				Или ЕстьПостановление981)
				Или ЕстьПостановление1096 И (ЕстьПостановление914
				Или ЕстьПостановление1137
				Или ЕстьПостановление1137_625
				Или ЕстьПостановление981
				Или ЕстьПостановление534) Тогда

				Текст = НСтр("ru = 'Недоступна одновременная печать счетов-фактур, сформированных по разным постановлениям Правительства РФ';
				|en = 'Cannot print tax invoices generated by different decrees of the RF Government at the same time'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				Текст,
				ДанныеПечати.Ссылка);

				ТабличныйДокумент.Очистить();
				Прервать;

			КонецЕсли;

			ОпцииПечатиСчетаФактуры.Вставить("Макет", Макет);

			Если Не ПервыйДокумент Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;

			ПервыйДокумент = Ложь;
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

			ТекстПредставленияКомиссионера = "";
			ВыборкаПоставщиков = Неопределено;
			Если ДанныеДляПечати.Свойство("РезультатПоПоставщикам")
				И ДанныеПечати.ПеревыставленныйСчетФактура
				И (ЕстьПостановление981 Или ЕстьПостановление534 Или ЕстьПостановление1096) Тогда
				ВыборкаПоставщиков = ДанныеДляПечати.РезультатПоПоставщикам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				СведенияОКомиссионере = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Организация, ДанныеПечати.Дата);

				ДополнительноеПредставление = "";
				Если ДействующиеПостановления.Постановление914 И СведенияОКомиссионере.ОфициальноеНаименование <> СведенияОКомиссионере.ПолноеНаименование Тогда
					ДополнительноеПредставление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = '(%1)';
					|en = '(%1)'"),
					ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОКомиссионере, "ПолноеНаименование"));
				КонецЕсли;

				ПредставлениеКомиссионера = СокрЛП(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1 %2';
				|en = '%1 %2'"),
				СведенияОКомиссионере.ПолноеНаименование,
				ДополнительноеПредставление));

				АдресКомиссионера = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1';
				|en = '%1'"),
				ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОКомиссионере, "ЮридическийАдрес"));

				ИННКомиссионера = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1/%2';
				|en = '%1/%2'"),
				ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОКомиссионере, "ИНН", Ложь),
				ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОКомиссионере, "КПП", Ложь));

				ТекстПредставленияКомиссионера = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Составлен комиссионером (агентом):%1, %2, ИНН/КПП: %3';
				|en = 'Completed by consignee (agent):%1, %2, TIN/KPP: %3'"),
				ПредставлениеКомиссионера, АдресКомиссионера, ИННКомиссионера);

			ИначеЕсли ЕстьПостановление534 Или ЕстьПостановление1096 Тогда
				ТекстПредставленияКомиссионера = ДанныеПечати.ПредставлениеВыставленКомиссионеру;
			КонецЕсли;

			// Выводим общие реквизиты шапки
			СведенияОбОрганизации = Новый Структура;
			ЗаполнитьРеквизитыШапкиСчетФактура(
			ДанныеПечати,
			ВыборкаОснований,
			СведенияОбОрганизации,
			ВыборкаКонтрагентов,
			ТабличныйДокумент,
			ОпцииПечатиСчетаФактуры,
			ВыборкаПоставщиков);

			// Выводим заголовок таблицы
			ЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
			Если ДействующиеПостановления.Постановление914 И Не ДанныеПечати.КорректировочныйСчетФактура Тогда
				СтруктураПараметров = Новый Структура;
				Если ОпцииПечатиСчетаФактуры.ПечатьВВалюте Тогда
					СтруктураПараметров.Вставить("Валюта", ДанныеПечати.Валюта)
				Иначе
					СтруктураПараметров.Вставить("Валюта", ВалютаРегламентированногоУчета);
				КонецЕсли;
				ЗаголовокТаблицы.Параметры.Заполнить(СтруктураПараметров);
			КонецЕсли;
			ТабличныйДокумент.Вывести(ЗаголовокТаблицы);

			НомерСтраницы = 1;

			// Инициализация итогов в документе
			Если ИспользоватьПечатныеФормыСФ2_5 Тогда
				ИтоговыеСуммы = СтруктураИтоговыеСуммы2_5();
			Иначе
				ИтоговыеСуммы = СтруктураИтоговыеСуммы();
			КонецЕсли;

			// Создаем массив для проверки вывода
			МассивВыводимыхОбластей = Новый Массив;

			// Выводим многострочную часть документа
			Если ОпцииПечатиСчетаФактуры.СчетФактураНаАванс И ДанныеПечати.КорректировочныйСчетФактура И Не ИспользоватьПечатныеФормыСФ2_5 Тогда
				ОбластьМакетаСтандарт = Макет.ПолучитьОбласть("СтрокаАвансы");
			Иначе
				ОбластьМакетаСтандарт = Макет.ПолучитьОбласть("Строка");
			КонецЕсли;
			ОбластьИтого = Макет.ПолучитьОбласть("Итого");
			ОбластьПодвала = Макет.ПолучитьОбласть("Подвал");
			ВыводитьОбластьКомиссионера = Ложь;

			Если Не ПустаяСтрока(ТекстПредставленияКомиссионера) Тогда
				ОбластьКомиссионера = Макет.ПолучитьОбласть("РеквизитыКомиссионера");
				СтруктураПараметров = Новый Структура();
				СтруктураПараметров.Вставить("ПредставлениеКомиссионера",ТекстПредставленияКомиссионера);
				ОбластьКомиссионера.Параметры.Заполнить(СтруктураПараметров);
				ВыводитьОбластьКомиссионера = Истина;
			КонецЕсли;

			СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);
			ВыборкаПоДокументам.НайтиСледующий(СтруктураПоиска);

			ИспользоватьНаборы = Ложь;
			Если ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(ВыборкаПоДокументам, "ЭтоНабор") Тогда
				ИспользоватьНаборы = Истина;
				Если ИспользоватьПечатныеФормыСФ2_5 Тогда
					ОбластьМакетаНабор         = Макет.ПолучитьОбласть("Строка");
					ОбластьМакетаКомплектующие = Макет.ПолучитьОбласть("Строка");
				Иначе
					ОбластьМакетаНабор         = Макет.ПолучитьОбласть("СтрокаНабор");
					ОбластьМакетаКомплектующие = Макет.ПолучитьОбласть("СтрокаКомплектующие");
				КонецЕсли;
			КонецЕсли;

			ЗаполнитьРеквизитыПодвалаСчетФактура(ОбластьПодвала, ДанныеПечати, СведенияОбОрганизации);

			ВыводитьКодыТНВЭД = ВыводитьКодыТНВЭД(ДанныеПечати, ДействующиеПостановления.Постановление981);

			ОперацияОблагаетсяНДСУПокупателя = Ложь;
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеПечати,"НалогообложениеНДС") 
				И ДанныеПечати.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДСУПокупателя Тогда
				ОперацияОблагаетсяНДСУПокупателя = Истина;
			КонецЕсли;

			ОперацияОблагаетсяНДССМежценовойРазницы = Ложь;
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеПечати,"НалогообложениеНДС") 
				И ДанныеПечати.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДССМежценовойРазницы Тогда
				ОперацияОблагаетсяНДССМежценовойРазницы = Истина;
			КонецЕсли;

			СтрокаТовары = ВыборкаПоДокументам.Выбрать();
			КоличествоСтрок = СтрокаТовары.Количество();
			ТолькоСтавкаБезНДС = Истина;
			НомерСтроки = 0;
			ПрефиксНабора = "";
			ТекущаяНоменклатураНабора = Справочники.Номенклатура.ПустаяСсылка();
			ТекущаяХарактеристикаНабора = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
			Пока СтрокаТовары.Следующий() Цикл
				СтрокаБезРасхождений = ДанныеДляПечати.Свойство("Маркировка")
				И ДанныеДляПечати.Маркировка.Количество() > 0
				И ДанныеПечати.КорректировочныйСчетФактура
				И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТовары, "РазницаБезНДСУвеличение")
				И СтрокаТовары.РазницаБезНДСУвеличение = СтрокаТовары.РазницаБезНДСУменьшение
				И СтрокаТовары.РазницаНДСУвеличение = СтрокаТовары.РазницаНДСУменьшение
				И СтрокаТовары.РазницаСНДСУвеличение = СтрокаТовары.РазницаСНДСУменьшение;
				Если Не СтрокаБезРасхождений Тогда
					Если ПрослеживаемыеОС <> Неопределено Тогда
						ПрослеживаемыеТоварыСтрокаТовары = ПрослеживаемыеОС.НайтиСтроки(Новый Структура("НомерСтрокиСФ", СтрокаТовары.НомерСтроки));
					ИначеЕсли ПрослеживаемыеКомплектующие <> Неопределено Тогда
						ПрослеживаемыеТоварыСтрокаТовары = ПрослеживаемыеКомплектующие.НайтиСтроки(Новый Структура("НомерГТД", СтрокаТовары.НомерГТД));
					Иначе
						ПрослеживаемыеТоварыСтрокаТовары = Неопределено;
					КонецЕсли;

					Если ДанныеПечати.КорректировочныйСчетФактура Тогда
						ОбластьМакета = ОбластьМакетаСтандарт;
					ИначеЕсли НаборыСервер.ИспользоватьОбластьНабор(СтрокаТовары, ИспользоватьНаборы) Тогда
						ОбластьМакета = ОбластьМакетаНабор;
					ИначеЕсли НаборыСервер.ИспользоватьОбластьКомплектующие(СтрокаТовары, ИспользоватьНаборы) Тогда
						ОбластьМакета = ОбластьМакетаКомплектующие;
					Иначе
						ОбластьМакета = ОбластьМакетаСтандарт;
					КонецЕсли;

					ПараметрыПечати = Новый Структура();
					ПараметрыПечати.Вставить("Корректировочный",             ДанныеПечати.КорректировочныйСчетФактура);
					ПараметрыПечати.Вставить("СчетФактураНаАванс",           ОпцииПечатиСчетаФактуры.СчетФактураНаАванс);
					ПараметрыПечати.Вставить("ЕстьПрослеживаемыеТовары",     ДанныеПечати.ЕстьПрослеживаемыеТовары);
					ПараметрыПечати.Вставить("ЕстьПостановление1096",        ЕстьПостановление1096);

					Если НаборыСервер.ВыводитьТолькоЗаголовок(СтрокаТовары, ИспользоватьНаборы) Тогда
						КоличествоСтрок = КоличествоСтрок - 1;
						Если ИспользоватьПечатныеФормыСФ2_5 Тогда
							ЗаполнитьРеквизитыСтрокиТовара2_5(СтрокаТовары,
							ПрослеживаемыеТоварыСтрокаТовары,
							ОбластьМакета,
							Неопределено,
							ПараметрыПечати,
							ДанныеПечати.КорректировочныйСчетФактура,
							ВыводитьКодыТНВЭД,
							ВыводитьСерии);

							Если НаборыСервер.ИспользоватьОбластьНабор(СтрокаТовары, ИспользоватьНаборы) 
								И ДанныеПечати.КорректировочныйСчетФактура Тогда
								ПрефиксНабора = ОбластьМакета.Параметры.НаименованиеНоменклатуры;
								ТекущаяНоменклатураНабора = СтрокаТовары.НоменклатураНабора;
								ТекущаяХарактеристикаНабора = СтрокаТовары.ХарактеристикаНабора;
							КонецЕсли;
						Иначе
							ЗаполнитьРеквизитыСтрокиТовара(СтрокаТовары, 
							ОбластьМакета, 
							Неопределено, 
							ДанныеПечати.КорректировочныйСчетФактура, 
							ВыводитьКодыТНВЭД, 
							ВыводитьСерии,
							ОпцииПечатиСчетаФактуры.СчетФактураНаАванс);

							Если НаборыСервер.ИспользоватьОбластьНабор(СтрокаТовары, ИспользоватьНаборы) 
								И ДанныеПечати.КорректировочныйСчетФактура Тогда
								ПрефиксНабора = ОбластьМакета.Параметры.ПредставлениеНоменклатуры;
								ТекущаяНоменклатураНабора = СтрокаТовары.НоменклатураНабора;
								ТекущаяХарактеристикаНабора = СтрокаТовары.ХарактеристикаНабора;
							КонецЕсли;
						КонецЕсли;
					Иначе
						НомерСтроки = НомерСтроки + 1;
						Если ИспользоватьПечатныеФормыСФ2_5 И Не (ОпцииПечатиСчетаФактуры.СчетФактураНаАванс И ДанныеПечати.КорректировочныйСчетФактура) Тогда
							ЗаполнитьРеквизитыСтрокиТовара2_5(СтрокаТовары,
							ПрослеживаемыеТоварыСтрокаТовары,
							ОбластьМакета,
							СтрокаТовары.НомерСтроки,
							ПараметрыПечати,
							ДанныеПечати.КорректировочныйСчетФактура,
							ВыводитьКодыТНВЭД,
							ВыводитьСерии);
							ПроставитьПрочеркиВПустыеПоляСтроки(ОбластьМакета);

							Если НаборыСервер.ИспользоватьОбластьКомплектующие(СтрокаТовары, ИспользоватьНаборы) 
								И ПрефиксНабора <> ""
								И СтрокаТовары.НоменклатураНабора = ТекущаяНоменклатураНабора
								И СтрокаТовары.ХарактеристикаНабора = ТекущаяХарактеристикаНабора Тогда
								ОбластьМакета.Параметры.НаименованиеНоменклатуры = ПрефиксНабора
								+ Символы.ПС
								+ ОбластьМакета.Параметры.НаименованиеНоменклатуры;
							КонецЕсли;
						Иначе   
							#Удаление
							ЗаполнитьРеквизитыСтрокиТовара(СтрокаТовары, 
							ОбластьМакета, 
							СтрокаТовары.НомерСтроки, 
							ДанныеПечати.КорректировочныйСчетФактура, 
							ВыводитьКодыТНВЭД, 
							ВыводитьСерии,
							ОпцииПечатиСчетаФактуры.СчетФактураНаАванс); 
							#КонецУдаления  
							#Вставка 
							ЗаполнитьРеквизитыСтрокиТовара(СтрокаТовары, 
													   ОбластьМакета, 
													   НомерСтроки, 
													   ДанныеПечати.КорректировочныйСчетФактура, 
													   ВыводитьКодыТНВЭД, 
													   ВыводитьСерии,
													   ОпцииПечатиСчетаФактуры.СчетФактураНаАванс);
							#КонецВставки
							ПроставитьПрочеркиВПустыеПоляСтроки(ОбластьМакета);

							Если НаборыСервер.ИспользоватьОбластьКомплектующие(СтрокаТовары, ИспользоватьНаборы) 
								И ПрефиксНабора <> ""
								И СтрокаТовары.НоменклатураНабора = ТекущаяНоменклатураНабора
								И СтрокаТовары.ХарактеристикаНабора = ТекущаяХарактеристикаНабора Тогда
								ОбластьМакета.Параметры.ПредставлениеНоменклатуры = ПрефиксНабора
								+ Символы.ПС
								+ ОбластьМакета.Параметры.ПредставлениеНоменклатуры;
							КонецЕсли;
						КонецЕсли;

						Если ОперацияОблагаетсяНДССМежценовойРазницы Тогда
							Если ИспользоватьПечатныеФормыСФ2_5 Тогда 
								Если ПараметрыПечати.Корректировочный Тогда 
									ОбластьМакета.Параметры.СтоимостьБезНДСДоИзменения = СтрокаТовары.МежценоваяРазницаДо;
									ОбластьМакета.Параметры.СтоимостьБезНДСПослеИзменения = СтрокаТовары.МежценоваяРазница;
								Иначе
									ОбластьМакета.Параметры.Стоимость   = СтрокаТовары.МежценоваяРазница;
								КонецЕсли;
							Иначе 
								Если ПараметрыПечати.Корректировочный Тогда 
									ОбластьМакета.Параметры.СуммаБезНДСДо = СтрокаТовары.МежценоваяРазницаДо;
								КонецЕсли;
								ОбластьМакета.Параметры.СуммаБезНДС   = СтрокаТовары.МежценоваяРазница;
							КонецЕсли;
						КонецЕсли;

					КонецЕсли;

					СтруктураПараметров = Новый Структура;
					Если ОперацияОблагаетсяНДСУПокупателя Тогда
						Если ИспользоватьПечатныеФормыСФ2_5 Тогда
							СтруктураПараметров.Вставить("СтавкаНДС",               НСтр("ru = 'НДС исчисляется налоговым агентом';
							|en = 'VAT is calculated by tax agent'", Метаданные.Языки.Русский.КодЯзыка));
							СтруктураПараметров.Вставить("СтавкаНДСДоИзменения",    НСтр("ru = 'НДС исчисляется налоговым агентом';
							|en = 'VAT is calculated by tax agent'", Метаданные.Языки.Русский.КодЯзыка));
							СтруктураПараметров.Вставить("СтавкаНДСПослеИзменения", НСтр("ru = 'НДС исчисляется налоговым агентом';
							|en = 'VAT is calculated by tax agent'", Метаданные.Языки.Русский.КодЯзыка));
							СтруктураПараметров.Вставить("СуммаНДСПослеИзменения", "--");
							СтруктураПараметров.Вставить("СуммаНДСДоИзменения", "--");
							СтруктураПараметров.Вставить("СтоимостьСНДСПослеИзменения", "--");
							СтруктураПараметров.Вставить("СтоимостьСНДСДоИзменения", "--");
							СтруктураПараметров.Вставить("Всего", "--");
						Иначе
							СтруктураПараметров.Вставить("СтавкаНДС", НСтр("ru = 'НДС исчисляется налоговым агентом';
							|en = 'VAT is calculated by tax agent'", Метаданные.Языки.Русский.КодЯзыка));
							СтруктураПараметров.Вставить("СуммаНДС", "--");
							СтруктураПараметров.Вставить("СуммаНДСДо", "--");
							СтруктураПараметров.Вставить("СуммаСНДС", "--");
							СтруктураПараметров.Вставить("СуммаСНДСДо", "--");
						КонецЕсли;
						СтруктураПараметров.Вставить("РазницаНДСУменьшение", "--");
						СтруктураПараметров.Вставить("РазницаНДСУвеличение", "--");
						СтруктураПараметров.Вставить("РазницаСНДСУменьшение", "--");
						СтруктураПараметров.Вставить("РазницаСНДСУвеличение", "--");
						Если ОпцииПечатиСчетаФактуры.СчетФактураНаАванс Тогда
							Если ИспользоватьПечатныеФормыСФ2_5 Тогда
								СтруктураПараметров.Вставить("Стоимость", СтрокаТовары.СуммаСНДС);
							Иначе
								СтруктураПараметров.Вставить("СуммаБезНДС", СтрокаТовары.СуммаСНДС);
							КонецЕсли;
						КонецЕсли;
					ИначеЕсли СтрокаТовары.СтавкаНДС = Справочники.СтавкиНДС.БезНДС Тогда
						Если ИспользоватьПечатныеФормыСФ2_5 Тогда
							СтруктураПараметров.Вставить("СтавкаНДСДоИзменения", НСтр("ru = 'без НДС';
							|en = 'Excluding VAT'", Метаданные.Языки.Русский.КодЯзыка));
							СтруктураПараметров.Вставить("СтавкаНДСПослеИзменения", НСтр("ru = 'без НДС';
							|en = 'Excluding VAT'", Метаданные.Языки.Русский.КодЯзыка));
							СтруктураПараметров.Вставить("СуммаНДСПослеИзменения", НСтр("ru = 'без НДС';
							|en = 'Excluding VAT'", Метаданные.Языки.Русский.КодЯзыка));
							СтруктураПараметров.Вставить("СуммаНДСДоИзменения", НСтр("ru = 'без НДС';
							|en = 'Excluding VAT'", Метаданные.Языки.Русский.КодЯзыка));
						Иначе
							СтруктураПараметров.Вставить("СтавкаНДС", НСтр("ru = 'без НДС';
							|en = 'Excluding VAT'", Метаданные.Языки.Русский.КодЯзыка));
							СтруктураПараметров.Вставить("СуммаНДС", НСтр("ru = 'без НДС';
							|en = 'Excluding VAT'", Метаданные.Языки.Русский.КодЯзыка));
							СтруктураПараметров.Вставить("СуммаНДСДо", НСтр("ru = 'без НДС';
							|en = 'Excluding VAT'", Метаданные.Языки.Русский.КодЯзыка));
						КонецЕсли;
					ИначеЕсли СтрокаТовары.СтавкаНДС = УчетНДСЛокализация.СтавкаНДСПоПеречислению(Перечисления.СтавкиНДС.НДС0) Тогда
						Если ИспользоватьПечатныеФормыСФ2_5 Тогда
							СтруктураПараметров.Вставить("СуммаНДСПослеИзменения", 0);
							СтруктураПараметров.Вставить("СуммаНДСДоИзменения", 0);
						Иначе
							СтруктураПараметров.Вставить("СуммаНДС", 0);
							СтруктураПараметров.Вставить("СуммаНДСДо", 0);
						КонецЕсли;
						ТолькоСтавкаБезНДС = Ложь;
					Иначе
						ТолькоСтавкаБезНДС = Ложь;
					КонецЕсли;

					Если Не НаборыСервер.ВыводитьТолькоЗаголовок(СтрокаТовары, ИспользоватьНаборы) Тогда
						Если ДействующиеПостановления.Постановление914 
							ИЛИ ОпцииПечатиСчетаФактуры.СчетФактураНаАванс
							ИЛИ ОпцииПечатиСчетаФактуры.СчетФактураНалоговыйАгент Тогда
							СтруктураПараметров.Вставить("Акциз", "--");
						Иначе
							СтруктураПараметров.Вставить("Акциз", НСтр("ru = 'без акциза';
							|en = 'no excise'", Метаданные.Языки.Русский.КодЯзыка));
						КонецЕсли;
					КонецЕсли;

					МассивВыводимыхОбластей.Очистить();

					Если Не(НаборыСервер.ВыводитьТолькоЗаголовок(СтрокаТовары, ИспользоватьНаборы) 
						И ДанныеПечати.КорректировочныйСчетФактура) Тогда

						ОбластьМакета.Параметры.Заполнить(СтруктураПараметров);
						МассивВыводимыхОбластей.Добавить(ОбластьМакета);

						Если НомерСтроки = КоличествоСтрок Тогда
							МассивВыводимыхОбластей.Добавить(ОбластьИтого);
							МассивВыводимыхОбластей.Добавить(ОбластьПодвала);

							Если ВыводитьОбластьКомиссионера Тогда
								МассивВыводимыхОбластей.Добавить(ОбластьКомиссионера);
							КонецЕсли;

						КонецЕсли;

						Если НЕ ТабличныйДокумент.ПроверитьВывод(МассивВыводимыхОбластей) Тогда

							НомерСтраницы = НомерСтраницы + 1;
							ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();

							Если Не ДействующиеПостановления.Постановление914 Тогда

								ОбластьНумерацияЛистов = Макет.ПолучитьОбласть("НумерацияЛистов");
								Если ОпцииПечатиСчетаФактуры.НомерСформированВСчетеФактуре Тогда
									ОбластьНумерацияЛистов.Параметры.Номер = ДанныеПечати.Номер;
								Иначе
									ОбластьНумерацияЛистов.Параметры.Номер = НомерСчетаФактурыНаПечать(ДанныеПечати.Номер, ДанныеПечати.ИндексПодразделения);
								КонецЕсли;
								Если Не ИспользоватьПечатныеФормыСФ2_5 Или ДанныеПечати.КорректировочныйСчетФактура Тогда
									ОбластьНумерацияЛистов.Параметры.Дата = Формат(ДанныеПечати.Дата, "ДЛФ=ДД; ДП=--");
								Иначе
									ОбластьНумерацияЛистов.Параметры.Номер = "Счет-фактура № " + ОбластьНумерацияЛистов.Параметры.Номер + " от " +  Формат(ДанныеПечати.Дата, "ДЛФ=ДД; ДП=--");
								КонецЕсли;
								ОбластьНумерацияЛистов.Параметры.НомерЛиста = НомерСтраницы;

								ТабличныйДокумент.Вывести(ОбластьНумерацияЛистов);

							КонецЕсли;

							ТабличныйДокумент.Вывести(ЗаголовокТаблицы);

						КонецЕсли;

						ТабличныйДокумент.Вывести(ОбластьМакета);
					КонецЕсли;

					Если Не НаборыСервер.ИспользоватьОбластьКомплектующие(СтрокаТовары, ИспользоватьНаборы) Тогда
						Если ИспользоватьПечатныеФормыСФ2_5 Тогда
							РассчитатьИтоговыеСуммы2_5(ИтоговыеСуммы, ПараметрыПечати, СтрокаТовары, ПрослеживаемыеТоварыСтрокаТовары, ОперацияОблагаетсяНДССМежценовойРазницы);
						Иначе
							РассчитатьИтоговыеСуммы(ИтоговыеСуммы, СтрокаТовары, ОперацияОблагаетсяНДССМежценовойРазницы);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;

			// Выводим итоги по документу
			ДобавитьИтоговыеДанныеПодвала(ИтоговыеСуммы, НомерСтроки, ВалютаРегламентированногоУчета);

			Если ДействующиеПостановления.Постановление1137
				И (НЕ ОпцииПечатиСчетаФактуры.СчетФактураНаАванс)
				И (НЕ ДанныеПечати.КорректировочныйСчетФактура)
				И ТолькоСтавкаБезНДС Тогда
				ИтоговыеСуммы.ИтогоСуммаНДС = НСтр("ru = 'без НДС';
				|en = 'Excluding VAT'", Метаданные.Языки.Русский.КодЯзыка);
			КонецЕсли;

			Если ДанныеПечати.КорректировочныйСчетФактура
				И ТолькоСтавкаБезНДС Тогда
				Если ИспользоватьПечатныеФормыСФ2_5 Тогда
					ИтоговыеСуммы.Вставить("РазницаНДСУвеличение", НСтр("ru = 'без НДС';
					|en = 'Excluding VAT'", Метаданные.Языки.Русский.КодЯзыка));
					ИтоговыеСуммы.Вставить("РазницаНДСУменьшение", НСтр("ru = 'без НДС';
					|en = 'Excluding VAT'", Метаданные.Языки.Русский.КодЯзыка));
				Иначе
					ИтоговыеСуммы.Вставить("ИтогоРазницаНДСУвеличение", НСтр("ru = 'без НДС';
					|en = 'Excluding VAT'", Метаданные.Языки.Русский.КодЯзыка));
					ИтоговыеСуммы.Вставить("ИтогоРазницаНДСУменьшение", НСтр("ru = 'без НДС';
					|en = 'Excluding VAT'", Метаданные.Языки.Русский.КодЯзыка));
				КонецЕсли;
			КонецЕсли;

			Если ОперацияОблагаетсяНДСУПокупателя Тогда
				Если ОпцииПечатиСчетаФактуры.СчетФактураНаАванс Тогда
					Если ИспользоватьПечатныеФормыСФ2_5 Тогда
						ИтоговыеСуммы.Вставить("ИтогоСтоимость", ИтоговыеСуммы.ИтогоСтоимость);
					Иначе
						ИтоговыеСуммы.Вставить("ИтогоСуммаБезНДС", ИтоговыеСуммы.ИтогоСуммаСНДС);
						ИтоговыеСуммы.Вставить("ИтогоСуммаБезНДСНаСтранице", ИтоговыеСуммы.ИтогоСуммаСНДСНаСтранице);
					КонецЕсли;
				КонецЕсли;
				Если ИспользоватьПечатныеФормыСФ2_5 Тогда
					ИтоговыеСуммы.Вставить("ИтогоСуммаНДС", "--");
					ИтоговыеСуммы.Вставить("ИтогоСуммаНДСНаСтранице", "--");
					ИтоговыеСуммы.Вставить("ИтогоВсего", "--");
					ИтоговыеСуммы.Вставить("ИтогоВсегоНаСтранице", "--");
					Если ИтоговыеСуммы.РазницаСНДСУменьшение <> 0 Тогда
						ИтоговыеСуммы.Вставить("РазницаСНДСУменьшение", "--");
						ИтоговыеСуммы.Вставить("РазницаСНДСУменьшениеНаСтранице", "--");
						ИтоговыеСуммы.Вставить("РазницаНДСУменьшение", "--");
						ИтоговыеСуммы.Вставить("РазницаНДСУменьшениеНаСтранице", "--");
					КонецЕсли;
					Если ИтоговыеСуммы.РазницаСНДСУвеличение <> 0 Тогда
						ИтоговыеСуммы.Вставить("РазницаСНДСУвеличение", "--");
						ИтоговыеСуммы.Вставить("РазницаСНДСУвеличениеНаСтранице", "--");
						ИтоговыеСуммы.Вставить("РазницаНДСУвеличение", "--");
						ИтоговыеСуммы.Вставить("РазницаНДСУвеличениеНаСтранице", "--");
					КонецЕсли;
				Иначе
					ИтоговыеСуммы.Вставить("ИтогоСуммаНДС", "--");
					ИтоговыеСуммы.Вставить("ИтогоСуммаНДСНаСтранице", "--");
					ИтоговыеСуммы.Вставить("ИтогоСуммаСНДС", "--");
					ИтоговыеСуммы.Вставить("ИтогоСуммаСНДСНаСтранице", "--");
					Если ИтоговыеСуммы.ИтогоРазницаСНДСУменьшение <> 0 Тогда
						ИтоговыеСуммы.Вставить("ИтогоРазницаСНДСУменьшение", "--");
						ИтоговыеСуммы.Вставить("ИтогоРазницаСНДСУменьшениеНаСтранице", "--");
						ИтоговыеСуммы.Вставить("ИтогоРазницаНДСУменьшение", "--");
						ИтоговыеСуммы.Вставить("ИтогоРазницаНДСУменьшениеНаСтранице", "--");
					КонецЕсли;
					Если ИтоговыеСуммы.ИтогоРазницаСНДСУвеличение <> 0 Тогда
						ИтоговыеСуммы.Вставить("ИтогоРазницаСНДСУвеличение", "--");
						ИтоговыеСуммы.Вставить("ИтогоРазницаСНДСУвеличениеНаСтранице", "--");
						ИтоговыеСуммы.Вставить("ИтогоРазницаНДСУвеличение", "--");
						ИтоговыеСуммы.Вставить("ИтогоРазницаНДСУвеличениеНаСтранице", "--");
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;

			ОбластьИтого.Параметры.Заполнить(ИтоговыеСуммы);
			ПроставитьПрочеркиВПустыеПоляСтроки(ОбластьИтого);
			ТабличныйДокумент.Вывести(ОбластьИтого);

			Если ИспользоватьПечатныеФормыСФ2_5 Тогда
				УдалитьВсеОбластиФаксимиле(ОбластьПодвала);
			КонецЕсли;

			ТабличныйДокумент.Вывести(ОбластьПодвала);

			Если ВыводитьОбластьКомиссионера Тогда
				ТабличныйДокумент.Вывести(ОбластьКомиссионера);
			КонецЕсли;

			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры


