
&НаСервере
Процедура КАНАТ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//++ Гурьев 28.09.23 ЧТЗ_2_11_4
	
	//Добавление на форму элемента, отвечающего за вывод скидок в ПФ
	ПолеВыводитьСкидки = Элементы.Добавить("КАНАТ_ПолеВыводитьСкидки",
											Тип("ПолеФормы"),
											Элементы.ГруппаЦенообразованиеРеквизиты); 
	ПолеВыводитьСкидки.Заголовок = "Выводить скидки"; 
	ПолеВыводитьСкидки.ПутьКДанным = "Объект.КАНАТ_ВыводитьСкидки";
	ПолеВыводитьСкидки.Вид = ВидПоляФормы.ПолеФлажка;
	
	//-- Гурьев 28.09.23 ЧТЗ_2_11_4
КонецПроцедуры
