
&НаСервере
Процедура КАНАТ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка) 
	//БИТ_Байков ++ 17.08.23·#2_4 - конструктор договоров
	
	БИТ_ДополнитьРеквизитамиЭлементамиКонструктораДоговоров();      
	//БИТ_Байков -
	
	//++ Гурьев 19.09.23 ЧТЗ_2.15
	КомандаЗаполнитьНомер = ЭтаФорма.Команды.Добавить("КАНАТ_ЗаполнитьНомер");
	КомандаЗаполнитьНомер.Заголовок = "Создать №";
	КомандаЗаполнитьНомер.Действие = "КАНАТ_ЗаполнитьНомер";
	
	КнопкаЗаполнитьНомер = ЭтаФорма.Элементы.Добавить("КАНАТ_ЗаполнитьНомер", Тип("КнопкаФормы"),Элементы.ГруппаНомерДата);
	КнопкаЗаполнитьНомер.Заголовок = "Создать №";
	КнопкаЗаполнитьНомер.ИмяКоманды = "КАНАТ_ЗаполнитьНомер";
	//-- Гурьев 19.09.23 ЧТЗ_2.15
	
	//++ Гурьев 25.10.23 ЧТЗ_2.15
	Элементы.Наименование.ТолькоПросмотр = Истина;
	Элементы.НаименованиеДляПечати.ТолькоПросмотр = Истина;
	//-- Гурьев 25.10.23 ЧТЗ_2.15
КонецПроцедуры

Процедура БИТ_ДополнитьРеквизитамиЭлементамиКонструктораДоговоров()
	
	//БИТ_Байков ++ 18.08.23·#2_5 (Связь договор соглашение)
	ЭлементСоглашение = Элементы.Добавить("Канат_ПоСоглашению",Тип("ПолеФормы"), Элементы.ГруппаПартнерКонтрагент);
	ЭлементСоглашение.ПутьКДанным = "Объект.КАНАТ_ПоСоглашению";  
	ЭлементСоглашение.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементСоглашение.УстановитьДействие("НачалоВыбора","КАНАТ_ПоСоглашениюНачалоВыбора");
	//БИТ_Байков -
	
	
	//БИТ_Байков ++ 18.08.23·#2_4 - конструктор договоров
	//Добавление страницы и групп расположения
	ЭлСтраница = Элементы.Добавить("ЭлСтраница_Шаблон",Тип("ГруппаФормы"),Элементы.ГруппаСтраницы);    
	ЭлСтраница.Вид = ВидГруппыФормы.Страница;
	ЭлСтраница.Заголовок = "Текст договора";     
	
	ЭлГруппаГВ = Элементы.Добавить("ГруппаШаблонГоризонтальнаяВерх",Тип("ГруппаФормы"),ЭлСтраница);
	ЭлГруппаГВ.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ЭлГруппаГВ.Отображение = ОтображениеОбычнойГруппы.Нет;
	ЭлГруппаГВ.группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	ЭлГруппаГН = Элементы.Добавить("ГруппаШаблонГоризонтальнаяНиз",Тип("ГруппаФормы"),ЭлСтраница);
	ЭлГруппаГН.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ЭлГруппаГН.Отображение = ОтображениеОбычнойГруппы.Нет;
	ЭлГруппаГН.группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;  
	
	//Добавление команд
	КомандаОбновить = Команды.Добавить("ОбновитьШаблонИзБлоков"); //Имя команды
	КомандаОбновить.Заголовок = "Заполнить текст из ""Блоков""";
	КомандаОбновить.Действие  = "ОбновитьШаблонИзБлоков"; //Имя связанной процедуры
	КнопкаОбновить = Элементы.Добавить("КнопкаОбновитьШаблонИзБлоков", Тип("КнопкаФормы"), ЭлГруппаГВ);                    
	КнопкаОбновить.ИмяКоманды = "ОбновитьШаблонИзБлоков"; 
	КнопкаОбновить.Вид = ВидКнопкиФормы.ОбычнаяКнопка;  
	
	КомандаСохранить = Команды.Добавить("ПечатьДоговора");
	КомандаСохранить.Заголовок = "Печать договора";
	КомандаСохранить.Действие  = "ПечатьДоговора";     
	КнопкаСохранить = Элементы.Добавить("КнопкаПечатьДоговора", Тип("КнопкаФормы"), ЭлГруппаГВ);                    
	КнопкаСохранить.ИмяКоманды = "ПечатьДоговора"; 
	КнопкаСохранить.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	
	//Добавление ТабЧасти
	ЭлСписокБлоков = Элементы.Добавить("Список_Блоков",Тип("ТаблицаФормы"), ЭлГруппаГН);
	ЭлСписокБлоков.ПутьКДанным = "Объект.КАНАТ_БлокиДоговора";
	ЭлСписокБлоков.Заголовок = "Пункты договора";        
	ЭлКолонкаТЧ = Элементы.Добавить("БлокДоговора",Тип("ПолеФормы"),ЭлСписокБлоков);
	ЭлКолонкаТЧ.Заголовок = "Блок договора";
	ЭлКолонкаТЧ.Вид = ВидПоляФормы.ПолеВвода;
	ЭлКолонкаТЧ.ПутьКДанным = "Объект.КАНАТ_БлокиДоговора.БлокДоговора"; 
	
	
	
	//Добавление Табдока
	ОписаниеТипаТД = Новый ОписаниеТипов("ТабличныйДокумент");
	РеквизитФинальныйТабДок = Новый РеквизитФормы("КАНАТ_РезультатТабДок",ОписаниеТипаТД,,"Текст договора");
	РеквизитФинальныйТабДок.СохраняемыеДанные = Истина;
	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить(РеквизитФинальныйТабДок);
	ИзменитьРеквизиты(МассивРеквизитов);
	
	ЭлИтоговыйТабДок = Элементы.Добавить("Итоговый_ТабДок", Тип("ПолеФормы"),ЭлГруппаГН);
	ЭлИтоговыйТабДок.ПутьКДанным = "КАНАТ_РезультатТабДок"; 
	ЭлИтоговыйТабДок.Вид = ВидПоляФормы.ПолеТабличногоДокумента;
	ЭлИтоговыйТабДок.Редактирование = Истина;
	ЭлИтоговыйТабДок.ОтображатьСетку = Истина;
	ЭлИтоговыйТабДок.ОтображатьЗаголовки = Истина;
	ЭлИтоговыйТабДок.Доступность = Истина;  
	ЭтотОбъект.КАНАТ_РезультатТабДок.Макет = Истина;
	
	
КонецПроцедуры    

&НаКлиенте
Процедура  ПечатьДоговора (Команда);
	//БИТ_Байков ++ 17.08.23·#2_4 - конструктор договоров
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ДОГОВОР");
	СтрокаКоллекцииПФ = КоллекцияПечатныхФорм[0];
	СтрокаКоллекцииПФ.ТабличныйДокумент = ЭтотОбъект.КАНАТ_РезультатТабДок;
	СтрокаКоллекцииПФ.Экземпляров = 1;
	СтрокаКоллекцииПФ.СинонимМакета = Объект.Наименование;
	
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,Неопределено,ЭтаФорма);
	
	
конецПроцедуры


//БИТ_Байков ++ 17.08.23·#2_4 - конструктор договоров
&НаКлиенте
Процедура  ОбновитьШаблонИзБлоков (Команда);
	ОбновитьШаблонИзБлоковНаСервере()	
конецПроцедуры

//БИТ_Байков ++ 17.08.23·#2_4 - конструктор договоров
&наСервере
Процедура  ОбновитьШаблонИзБлоковНаСервере ();
	табличныйДокумент = Новый ТабличныйДокумент;
	НомерПоПорядку = -1;
	Для каждого Блок Из Объект.КАНАТ_БлокиДоговора Цикл
		Если Блок.БлокДоговора = Справочники.КАНАТ_БлокиДоговоров.ПустаяСсылка() Тогда
			Объект.КАНАТ_БлокиДоговора.Удалить(Блок);
			Продолжить;			
		КонецЕсли;
		НомерПоПорядку = НомерПоПорядку+1;
		БлокОбъект = Блок.БлокДоговора.ПолучитьОбъект();
		Если БлокОбъект.ЗаполнениеПодразделениями тогда 
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	Контрагенты.Ссылка КАК Контрагент,
			|	МАКСИМУМ(ЕСТЬNULL(БанковскиеСчетаКонтрагентов.Ссылка, ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаКонтрагентов.ПустаяСсылка))) КАК БСчет
			|ИЗ
			|	Справочник.Контрагенты КАК Контрагенты
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчетаКонтрагентов КАК БанковскиеСчетаКонтрагентов
			|		ПО (Контрагенты.Ссылка = БанковскиеСчетаКонтрагентов.Владелец)
			|ГДЕ
			|	Контрагенты.ГоловнойКонтрагент = &ГоловнойКонтрагент  и Контрагенты.Ссылка <> &ГоловнойКонтрагент 
			|
			|СГРУППИРОВАТЬ ПО
			|	Контрагенты.Ссылка"; 
			Запрос.УстановитьПараметр("ГоловнойКонтрагент",Объект.Контрагент);
			РезультатЗапроса = Запрос.Выполнить();
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ТабДокумент = ЗаполнениеТабДока (БлокОбъект, НомерПоПорядку, ВыборкаДетальныеЗаписи.Контрагент,ВыборкаДетальныеЗаписи.БСчет );	
				ТабличныйДокумент.Вывести(ТабДокумент);
			КонецЦикла;
                          
		Иначе 
			ТабДокумент = ЗаполнениеТабДока (БлокОбъект, НомерПоПорядку, Объект.Контрагент, Объект.БанковскийСчетКонтрагента);	
			ТабличныйДокумент.Вывести(ТабДокумент);
		КонецЕсли;
	КонецЦикла;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ЭтотОбъект.КАНАТ_РезультатТабДок = ТабличныйДокумент;
конецПроцедуры

//БИТ_Байков ++ 17.08.23·#2_4 - конструктор договоров
&наСервере
Функция  ЗаполнениеТабДока (БлокОбъект, НомерПоПорядку, ЗаполняемыйКонтрагент, БакнСчетКонтрагента);
	 ТабДокументПервичный = БлокОбъект.ХранилищеТабДокумента.Получить();  
		ТабДокумент = ТабДокументПервичный.ПолучитьОбласть(1, 1, ТабДокументПервичный.ВысотаТаблицы, ТабДокументПервичный.ШиринаТаблицы);
		СтруктураПолей = Новый Структура;
		ОбъектОбъект = РеквизитФормыВЗначение("Объект");
		СтруктураПолей.Вставить("НомПП",НомерПоПорядку);
		Для каждого МетаРек Из ОбъектОбъект.Метаданные().Реквизиты Цикл
			
			ЗначениеПараметра = ОбъектОбъект[МетаРек.Имя];
			Если ТипЗнч(ЗначениеПараметра)=Тип("Дата") Тогда
				ЗначениеПараметра= Формат(ЗначениеПараметра,	"ДЛФ=DD");
			КонецЕсли;
			СтруктураПолей.Вставить("Договор"+МетаРек.Имя, ЗначениеПараметра);					
		КонецЦикла;  
		
		Для каждого МетаРек Из ЗаполняемыйКонтрагент.Метаданные().Реквизиты Цикл
			ЗначениеПараметра = ЗаполняемыйКонтрагент[МетаРек.Имя];
			Если ТипЗнч(ЗначениеПараметра)=Тип("Дата") Тогда
				ЗначениеПараметра= Формат(ЗначениеПараметра,	"ДЛФ=DD");
			КонецЕсли;
			СтруктураПолей.Вставить("Контрагент"+МетаРек.Имя, ЗначениеПараметра);					
		КонецЦикла;
		ДобавитьДополнительнуюИнформациюВСтруктуруПолей(СтруктураПолей, ЗаполняемыйКонтрагент);
		ДобавитьКонтактнуюИнформациюВСтруктуруПолей(СтруктураПолей, ЗаполняемыйКонтрагент);
		
		Для каждого МетаРек Из ОбъектОбъект.КонтактноеЛицо.Метаданные().Реквизиты Цикл
			ЗначениеПараметра = ОбъектОбъект.КонтактноеЛицо[МетаРек.Имя];
			Если ТипЗнч(ЗначениеПараметра)=Тип("Дата") Тогда
				ЗначениеПараметра= Формат(ЗначениеПараметра,	"ДЛФ=DD");
			КонецЕсли;
			СтруктураПолей.Вставить("ДоговорКонтактноеЛицо"+МетаРек.Имя, ЗначениеПараметра);					
		КонецЦикла;
		ДобавитьИнформациюКЛВСтруктуруПолей(СтруктураПолей);
		
		Для каждого МетаРек Из ОбъектОбъект.КАНАТ_ПоСоглашению.Метаданные().Реквизиты Цикл
			ЗначениеПараметра = ОбъектОбъект.КАНАТ_ПоСоглашению[МетаРек.Имя];
			Если ТипЗнч(ЗначениеПараметра)=Тип("Дата") Тогда
				ЗначениеПараметра= Формат(ЗначениеПараметра,	"ДЛФ=DD");
			КонецЕсли;
			СтруктураПолей.Вставить("Соглашение"+МетаРек.Имя, ЗначениеПараметра);					
		КонецЦикла;
		
		Для каждого МетаРек Из ОбъектОбъект.БанковскийСчет.Метаданные().Реквизиты Цикл
			ЗначениеПараметра = ОбъектОбъект.БанковскийСчет[МетаРек.Имя];
			Если ТипЗнч(ЗначениеПараметра)=Тип("Дата") Тогда
				ЗначениеПараметра= Формат(ЗначениеПараметра,	"ДЛФ=DD");
			КонецЕсли;
			СтруктураПолей.Вставить("БСчет"+МетаРек.Имя, ЗначениеПараметра);					
		КонецЦикла;                    
		
		Для каждого МетаРек Из БакнСчетКонтрагента.Метаданные().Реквизиты Цикл
			ЗначениеПараметра = БакнСчетКонтрагента[МетаРек.Имя];
			Если ТипЗнч(ЗначениеПараметра)=Тип("Дата") Тогда
				ЗначениеПараметра= Формат(ЗначениеПараметра,	"ДЛФ=DD");
			КонецЕсли;
			СтруктураПолей.Вставить("КонтрагентБСчет"+МетаРек.Имя, ЗначениеПараметра);					
		КонецЦикла;
		
		//БИТ_Гурьев__18.12.24++
		Для каждого МетаРек Из ОбъектОбъект.Организация.Метаданные().Реквизиты Цикл
			ЗначениеПараметра = ОбъектОбъект.Организация[МетаРек.Имя];
			Если ТипЗнч(ЗначениеПараметра)=Тип("Дата") Тогда
				ЗначениеПараметра= Формат(ЗначениеПараметра,	"ДЛФ=DD");
			КонецЕсли;
			СтруктураПолей.Вставить("Организация"+МетаРек.Имя, ЗначениеПараметра);					
		КонецЦикла;

		//БИТ_Гурьев__18.12.24--
		
		ТабДокумент.Параметры.Заполнить(СтруктураПолей);
		ТабДокумент.Область(1, 1, ТабДокумент.ВысотаТаблицы, ТабДокумент.ШиринаТаблицы).СоздатьФорматСтрок();
		
		
		Если БлокОбъект.ИспользоватьСвойОбработчик Тогда  
			Попытка
				ПараметрыЗаполнения = ТабДокумент.Параметры;
				Выполнить(БлокОбъект.ОбработчикЗаполнения);	
				
			Исключение
				
			КонецПопытки;
			
		КонецЕсли;            
		
		Возврат ТабДокумент;

КонецФункции


//БИТ_Байков ++ 20.08.23·#2_4 - конструктор договоров
&НаСервере
Процедура ДобавитьИнформациюКЛВСтруктуруПолей(СтруктураПолей) 
	СтруктураПолей.Вставить("ДоговорКонтактноеЛицоРодительный", СклонениеПредставленийОбъектов.ПросклонятьФИО(Строка(Объект.КонтактноеЛицо), 2));
	СтруктураПолей.Вставить("ДоговорКонтактноеЛицоИнициалы", ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Строка(Объект.КонтактноеЛицо)));
	СтруктураПолей.Вставить("ДоговорКонтактноеЛицоДолжностьРодительный", СклонениеПредставленийОбъектов.ПросклонятьПредставление(Строка(Объект.КонтактноеЛицо.ДолжностьПоВизитке), 2));

КонецПроцедуры

//БИТ_Байков ++ 06.05.24·#2_4 - конструктор договоров
&НаСервере
Процедура ДобавитьДополнительнуюИнформациюВСтруктуруПолей(СтруктураПолей, КонтрагентСсылка) 
	НаименованиеПолноеСРасшифровкой = КонтрагентСсылка.НаименованиеПолное; 
	ДлинаСтроки = СтрДлина(НаименованиеПолноеСРасшифровкой);                                   
	Если СтрНачинаетсяС(НаименованиеПолноеСРасшифровкой,"ООО") тогда                           
		НаименованиеПолноеСРасшифровкой = Прав(НаименованиеПолноеСРасшифровкой, ДлинаСтроки-3);
		НаименованиеПолноеСРасшифровкой = "Общество с ограниченной ответственностью" +НаименованиеПолноеСРасшифровкой;
	ИначеЕсли СтрНачинаетсяС(НаименованиеПолноеСРасшифровкой,"ИП") тогда
		НаименованиеПолноеСРасшифровкой = Прав(НаименованиеПолноеСРасшифровкой, ДлинаСтроки-2);
		НаименованиеПолноеСРасшифровкой = "Индивидуальный предприниматель" +НаименованиеПолноеСРасшифровкой;
	ИначеЕсли СтрНачинаетсяС(НаименованиеПолноеСРасшифровкой,"АО") тогда
		НаименованиеПолноеСРасшифровкой = Прав(НаименованиеПолноеСРасшифровкой, ДлинаСтроки-2);                       
		НаименованиеПолноеСРасшифровкой = "Акционерное общество" +НаименованиеПолноеСРасшифровкой;
	КонецЕсли;
	
	
	
	СтруктураПолей.Вставить("НаименованиеПолноеСРасшифровкой", НаименованиеПолноеСРасшифровкой);
	
	//БИТ_Гурьев_мелкие замечания_22.05.24++
	ВариантыСклоненияНаименванияРодПадеж = ПолучитьСклоненияСтроки(НаименованиеПолноеСРасшифровкой,
																					   ,
																					   "ПД=Родительный");
	НаименованиеПолноеСРасшифровкойРодПадеж = ?(ВариантыСклоненияНаименванияРодПадеж.Количество() > 0,
												ВариантыСклоненияНаименванияРодПадеж[0],
												"");
	СтруктураПолей.Вставить("НаименованиеПолноеСРасшифровкойРодительныйПадеж", НаименованиеПолноеСРасшифровкойРодПадеж);
	//БИТ_Гурьев_мелкие замечания_22.05.24--
	
КонецПроцедуры
	

//БИТ_Байков ++ 20.08.23·#2_4 - конструктор договоров
&НаСервере
Процедура ДобавитьКонтактнуюИнформациюВСтруктуруПолей(СтруктураПолей, КонтрагентСсылка) 
	СтруктураПолей.Вставить("КонтрагентЮрАдрес", УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(
	КонтрагентСсылка, Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента,,Объект.Дата));
	
	СтруктураПолей.Вставить("КонтрагентEmail", УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(
	КонтрагентСсылка, Справочники.ВидыКонтактнойИнформации.EmailКонтрагента,,Объект.Дата));
	
	СтруктураПолей.Вставить("КонтрагентФактАдрес", УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(
	КонтрагентСсылка, Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента,,Объект.Дата));
	
	СтруктураПолей.Вставить("КонтрагентФакс", УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(
	КонтрагентСсылка, Справочники.ВидыКонтактнойИнформации.ФаксКонтрагенты,,Объект.Дата));
	
	СтруктураПолей.Вставить("КонтрагентТелефон", УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(
	КонтрагентСсылка, Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента,,Объект.Дата));
	
	СтруктураПолей.Вставить("КонтрагентПочтовыйАдрес", УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(
	КонтрагентСсылка, Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресКонтрагента,,Объект.Дата));
	
	СтруктураПолей.Вставить("КонтрагентМеждународныйАдрес", УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(
	КонтрагентСсылка, Справочники.ВидыКонтактнойИнформации.МеждународныйАдресКонтрагента,,Объект.Дата));
	
	СтруктураПолей.Вставить("КонтрагентДругаяИнформация", УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(
	КонтрагентСсылка, Справочники.ВидыКонтактнойИнформации.ДругаяИнформацияКонтрагенты,,Объект.Дата));   
	
	//////////////
	
	СтруктураПолей.Вставить("ОрганизацияЮрАдрес", УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(
	Объект.Организация, Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации,,Объект.Дата));
	
	СтруктураПолей.Вставить("ОрганизацияEmail", УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(
	Объект.Организация, Справочники.ВидыКонтактнойИнформации.EmailОрганизации,,Объект.Дата));
	
	СтруктураПолей.Вставить("ОрганизацияФактАдрес", УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(
	Объект.Организация, Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации,,Объект.Дата));
	
	СтруктураПолей.Вставить("ОрганизацияФакс", УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(
	Объект.Организация, Справочники.ВидыКонтактнойИнформации.ФаксОрганизации,,Объект.Дата));
	
	СтруктураПолей.Вставить("ОрганизацияТелефон", УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(
	Объект.Организация, Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации,,Объект.Дата));
	
	СтруктураПолей.Вставить("ОрганизацияПочтовыйАдрес", УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(
	Объект.Организация, Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресОрганизации,,Объект.Дата));
	
	СтруктураПолей.Вставить("ОрганизацияМеждународныйАдрес", УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(
	Объект.Организация, Справочники.ВидыКонтактнойИнформации.МеждународныйАдресОрганизации,,Объект.Дата));
	
	СтруктураПолей.Вставить("ОрганизацияДругаяИнформация", УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(
	Объект.Организация, Справочники.ВидыКонтактнойИнформации.ДругаяИнформацияОрганизации,,Объект.Дата));
	
	
	
	
КонецПроцедуры


&НаКлиенте
Процедура КАНАТ_ПриОткрытииПосле(Отказ)
	//БИТ_Байков ++ 17.08.23·#2_4 - конструктор договоров
	ПолучитьИзХранилища();
КонецПроцедуры

//БИТ_Байков ++ 17.08.23·#2_4 - конструктор договоров
&НаСервере
Процедура ПолучитьИзХранилища()    
	
	Если ЗначениеЗаполнено(Объект.ссылка) Тогда
		Объектдокумент = Объект.Ссылка.ПолучитьОбъект();
		ЭтотОбъект.КАНАТ_РезультатТабДок  = ОбъектДокумент.КАНАТ_ХранилищеИтоговыйТекст.Получить();
	КонецЕсли; 
	ЭтотОбъект.КАНАТ_РезультатТабДок.Макет = Истина;
	
КонецПроцедуры


&НаСервере
Процедура КАНАТ_ПередЗаписьюНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//БИТ_Байков ++ 17.08.23·#2_4 - конструктор договоров
	ТекущийОбъект.КАНАТ_ХранилищеИтоговыйТекст = Новый ХранилищеЗначения(ЭтотОбъект.КАНАТ_РезультатТабДок);
	
КонецПроцедуры


&НаКлиенте
Процедура КАНАТ_ПоСоглашениюНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//БИТ_Байков ++ 21.08.23·#2_5 Связь договоров и соглашений
	СтандартнаяОбработка = Ложь;
	
	Если Не ЗначениеЗаполнено(Объект.Партнер) Тогда
		Возврат;
	Иначе
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("ДатаДокумента", Объект.Дата);
		ПараметрыФормы.Вставить("Партнер", Объект.Партнер);
		ПараметрыФормы.Вставить("ТолькоТиповые",ЛОЖЬ);
		ПараметрыФормы.Вставить("ТолькоИспользуемыеВРаботеТП",ЛОЖЬ);
		ПараметрыФормы.Вставить("ТекущаяСтрока",Объект.КАНАТ_ПоСоглашению);
		ПараметрыФормы.Вставить("ХозяйственнаяОперация",Объект.ХозяйственнаяОперация);
		ПараметрыФормы.Вставить("ИспользуютсяДоговорыКонтрагентов",ИСТИНА);
		
		//ПараметрыФормы.Вставить("ИспользуютсяДоговорыСКонтрагентами",ИСТИНА);
		//ДополнительныйОтбор = Новый Структура;
		//
		//Для Каждого ПараметрВыбора Из Элемент.ПараметрыВыбора Цикл
		//	ДополнительныйОтбор.Вставить(СтрЗаменить(ПараметрВыбора.Имя, "Отбор.", ""), ПараметрВыбора.Значение);
		//КонецЦикла;
		
		//ПараметрыФормы.Вставить("Отбор", ДополнительныйОтбор);
		
		ОткрытьФорму("Справочник.СоглашенияСКлиентами.ФормаВыбора",
		ПараметрыФормы,
		Элемент);
	КонецЕсли;
	
	//БИТ_Байков - 	
КонецПроцедуры      

//++ Гурьев 19.09.23 ЧТЗ_2.15
&НаКлиенте
Процедура КАНАТ_ЗаполнитьНомер(Команда)
	
	Если Объект.Контрагент.Пустая() Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Поле контрагент не заполнено.";
		Сообщение.Поле = "Объект.Контрагент";
		Сообщение.Сообщить();
		
	Иначе
		
		КАНАТ_ЗаполнитьНомерСервер();
		КАНАТ_ОбновитьНаименованияИзНомера();
		
	КонецЕсли;
	
КонецПроцедуры
//-- Гурьев 19.09.23 ЧТЗ_2.15

//++ Гурьев 19.09.23 ЧТЗ_2.15
&НаСервере
Процедура КАНАТ_ЗаполнитьНомерСервер()
	
	Объект.Номер = Справочники.ДоговорыКонтрагентов.КАНАТ_ПолучитьНомерПоШаблону(Объект.Ссылка, Объект.Контрагент);
	
КонецПроцедуры
//-- Гурьев 19.09.23 ЧТЗ_2.15


&НаСервере
Процедура КАНАТ_НомерПриИзмененииПослеНаСервере()
	//++ Гурьев 25.10.23 ЧТЗ_2.15
	КАНАТ_ОбновитьНаименованияИзНомера();
	//-- Гурьев 25.10.23 ЧТЗ_2.15
КонецПроцедуры


&НаКлиенте
Процедура КАНАТ_НомерПриИзмененииПосле(Элемент)
	КАНАТ_НомерПриИзмененииПослеНаСервере();
КонецПроцедуры

&НаСервере
Процедура КАНАТ_ОбновитьНаименованияИзНомера()
	
	//++ Гурьев 25.10.23 ЧТЗ_2.15
	Объект.Наименование = СтрШаблон("Договор № %1 от %2", Объект.Номер, Формат(Объект.Дата,"ДФ=dd.MM.yyyy"));
	Объект.НаименованиеДляПечати = СтрШаблон("Договор № %1 от %2", Объект.Номер, Формат(Объект.Дата,"ДФ=dd.MM.yyyy"));
	//-- Гурьев 25.10.23 ЧТЗ_2.15

	
КонецПроцедуры
