Функция ДобавитьКомандуСоздатьСпецификациюКДоговору(КомандыСозданияНаОсновании) Экспорт
	//++ Гурьев 10.11.23 Для ввода на основании
	Если ПравоДоступа("Добавление", Метаданные.Документы.КАНАТ_СпецификацияКДоговору) Тогда
		
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.КАНАТ_СпецификацияКДоговору.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = ОбщегоНазначенияУТ.ПредставлениеОбъекта(Метаданные.Документы.КАНАТ_СпецификацияКДоговору);
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		КомандаСоздатьНаОсновании.ФункциональныеОпции = "ИспользоватьПроизводство";
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;
	
	Возврат Неопределено;
	//-- Гурьев 10.11.23

КонецФункции

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Обработка.КАНАТ_ПечатьСпецификацииЗаказКлиента";
	КомандаПечати.Идентификатор = "ПечатьСпецификации";
	КомандаПечати.Представление = "Печать спецификации";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	
КонецПроцедуры