
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		
		ДокументОснование = ДанныеЗаполнения;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗаказКлиента.Номер КАК Номер,
			|	ЗаказКлиента.Контрагент КАК Контрагент,
			|	ЗаказКлиента.КАНАТ_ПлатитЗаДоставку КАК КАНАТ_ПлатитЗаДоставку,
			|	ЗаказКлиента.КАНАТ_ЯвляетсяСпецификацией КАК КАНАТ_ЯвляетсяСпецификацией,
			|	ЗаказКлиента.КАНАТ_СпецификацияНомер КАК КАНАТ_СпецификацияНомер,
			|	ЗаказКлиента.КАНАТ_ДатаСпецификации КАК КАНАТ_ДатаСпецификации,
			|	ЗаказКлиента.КАНАТ_НомерИДатаДоверенности КАК КАНАТ_НомерИДатаДоверенности,
			|	ЗаказКлиента.КАНАТ_ФИОСопроводителя КАК КАНАТ_ФИОСопроводителя,
			|	ЗаказКлиента.КАНАТ_Водитель КАК КАНАТ_Водитель,
			|	ЗаказКлиента.КАНАТ_ГосНомер КАК КАНАТ_ГосНомер,
			|	ЗаказКлиента.КАНАТ_АвтомобильМарка КАК КАНАТ_АвтомобильМарка,
			|	ЗаказКлиента.АдресДоставки КАК АдресДоставки,
			|	ЗаказКлиента.СпособДоставки КАК СпособДоставки,
			|	ЗаказКлиента.Соглашение КАК Соглашение,
			|	ЗаказКлиента.Договор КАК Договор
			|ИЗ
			|	Документ.ЗаказКлиента КАК ЗаказКлиента
			|ГДЕ
			|	ЗаказКлиента.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
			|	ЗаказКлиентаТовары.Количество КАК Количество,
			|	ЗаказКлиентаТовары.Сумма КАК СуммаБезНДС,
			|	ЗаказКлиентаТовары.СтавкаНДС КАК СтавкаНДС,
			|	ЗаказКлиентаТовары.СуммаНДС КАК СуммаНДС,
			|	ЗаказКлиентаТовары.СуммаСНДС КАК СуммаСНДС,
			|	ЗаказКлиентаТовары.КАНАТ_КомментарийКЗаказу КАК КАНАТ_КомментарийКЗаказу,
			|	ЗаказКлиентаТовары.Цена КАК Цена
			|ИЗ
			|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
			|ГДЕ
			|	ЗаказКлиентаТовары.Ссылка = &Ссылка
			//БИТ_Гурьев__06.05.24++
			|	И ЗаказКлиентаТовары.Отменено = Ложь
			//БИТ_Гурьев__06.05.24--
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	КАНАТ_СпецификацияКДоговору.ПорядковыйНомер КАК ПорядковыйНомер
			|ИЗ
			|	Документ.КАНАТ_СпецификацияКДоговору КАК КАНАТ_СпецификацияКДоговору
			|ГДЕ
			|	КАНАТ_СпецификацияКДоговору.Договор = &Договор
			|
			|УПОРЯДОЧИТЬ ПО
			|	ПорядковыйНомер УБЫВ";
		
		Запрос.УстановитьПараметр("Ссылка",  ДокументОснование);
		Запрос.УстановитьПараметр("Договор", ДокументОснование.Договор);
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		ДанныеСпецификации = РезультатЗапроса[0].Выгрузить();
		
		Если ДанныеСпецификации.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеСпецификации[0]);
		КонецЕсли;
		
		ВыборкаТовары = РезультатЗапроса[1].Выбрать();
		
		Пока ВыборкаТовары.Следующий() Цикл
			
			Строка = Товары.Добавить();
			
			ЗаполнитьЗначенияСвойств(Строка, ВыборкаТовары);
			
		КонецЦикла;
		
		КоличествоСпецификаций = РезультатЗапроса[2].Выгрузить();
		Если КоличествоСпецификаций.Количество() > 0 Тогда
			
			ПорядковыйНомер = КоличествоСпецификаций[0].ПорядковыйНомер + 1;
			
		Иначе
			
			ПорядковыйНомер = 1;
			
		КонецЕсли;
		
		Номер = СтрШаблон("%1-%2", Номер, Формат(ПорядковыйНомер,"ЧЦ=2; ЧВН="));
		
		КАНАТ_ДоставкаСпецификацияКДоговору = СтрШаблон("Способ отгрузки: %1 за счет %2%3Грузополучатель: %4",
														СпособДоставки,
														КАНАТ_ПлатитЗаДоставку,
														Символы.ПС,
														АдресДоставки);
		КАНАТ_ПримечаниеКСпецификацииДоговора = "Условия оплаты: по договору.
												|*Количество с учетом особенностей канатно-веревочной подукции приведено ориентировочное
												|
												|**Цены на продукцию указаны без НДС и без учета стоимости транспортных затрат, по состоянию на дату спецификации и могут изменяться в зависимости от изменения цен на сырье, электроэнергию, энергоносители и т.д. Цены на каждую поставку корректируются согласно пункта 3.3. настоящего договора.";
		
		//БИТ_Шамсиев++ 09.10.2024 2. При создании Спецификации к договору должна быть проверка 
		//на наличие договора (если договор не создан, то документ спецификации создать нельзя и пользователю выдается ошибка)
		Если не ЗначениеЗаполнено(Договор) тогда  
			ВызватьИсключение "Не указан договор!"; 
		КонецЕсли;	
		//БИТ_Шамсиев-- 09.10.2024 2. При создании Спецификации к договору должна быть проверка 
		//на наличие договора (если договор не создан, то документ спецификации создать нельзя и пользователю выдается ошибка)
	КонецЕсли;
	
КонецПроцедуры
 Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Договор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка() ИЛИ Договор.Статус <> Перечисления.СтатусыДоговоровКонтрагентов.Действует ТОгда
		ОбщегоНазначения.СообщитьПользователю("Не выбран действующий договор",,"Договор",,Отказ);
	КонецЕсли;
	
КонецПроцедуры
