//++ Гурьев_ЧТЗ_2.3
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	ЭтаФорма.Заголовок = СтрШаблон("Спецификация №%1 к договору %2 от %3",
								   Объект.ПорядковыйНомер, 
								   ?(ЗначениеЗаполнено(Объект.Договор.Номер),Объект.Договор.Номер,""), 
								   Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьТовары(Команда)
	ПерезаполнитьТоварыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьТоварыНаСервере()
	
	Объект.Товары.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
		|	ЗаказКлиентаТовары.Количество КАК Количество,
		|	ЗаказКлиентаТовары.Сумма КАК СуммаБезНДС,
		|	ЗаказКлиентаТовары.СтавкаНДС КАК СтавкаНДС,
		|	ЗаказКлиентаТовары.СуммаНДС КАК СуммаНДС,
		|	ЗаказКлиентаТовары.СуммаСНДС КАК СуммаСНДС,
		|	ЗаказКлиентаТовары.КАНАТ_КомментарийКЗаказу КАК КАНАТ_КомментарийКЗаказу,
		|	ЗаказКлиентаТовары.Цена КАК Цена
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|ГДЕ
		|	ЗаказКлиентаТовары.Ссылка = &Ссылка
		//БИТ_Гурьев__06.05.24++
		|	И ЗаказКлиентаТовары.Отменено = Ложь";
		//БИТ_Гурьев__06.05.24--
	
	Запрос.УстановитьПараметр("Ссылка", Объект.ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Строка = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере()
	ЭтаФорма.Заголовок = СтрШаблон("Спецификация №%1 к договору %2 от %3",
								   Объект.ПорядковыйНомер, 
								   ?(ЗначениеЗаполнено(Объект.Договор.Номер),Объект.Договор.Номер,""), 
								   Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПередЗаписьюНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ЭтаФорма.Заголовок = СтрШаблон("Спецификация №%1 к договору %2 от %3",
								   Объект.ПорядковыйНомер, 
								   ?(ЗначениеЗаполнено(Объект.Договор.Номер),Объект.Договор.Номер,""), 
								   Объект.Дата);
КонецПроцедуры

&НаСервере
Процедура ПорядковыйНомерПриИзмененииНаСервере()
	
	ЭтаФорма.Заголовок = СтрШаблон("Спецификация №%1 к договору %2 от %3",
								   Объект.ПорядковыйНомер, 
								   ?(ЗначениеЗаполнено(Объект.Договор.Номер),Объект.Договор.Номер,""), 
								   Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ПорядковыйНомерПриИзменении(Элемент)
	ПорядковыйНомерПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	ЭтаФорма.Заголовок = СтрШаблон("Спецификация №%1 к договору %2 от %3",
								   Объект.ПорядковыйНомер, 
								   ?(ЗначениеЗаполнено(Объект.Договор.Номер),Объект.Договор.Номер,""), 
								   Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ДатаПриИзмененииНаСервере();
КонецПроцедуры
