
//&Вместо("РазделитьПотребностиНаПартии")
//Функция КАНАТ_РазделитьПотребностиНаПартии(Потребности, ПараметрыРазузлования)
//	
//	Результат = Новый Массив;
//	
//	Входы = Новый ТаблицаЗначений;
//	Входы.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла));
//	Входы.Колонки.Добавить("Этап", Новый ОписаниеТипов("СправочникСсылка.ЭтапыПроизводства"));
//	Входы.Колонки.Добавить("СтрокаРС", Новый ОписаниеТипов("СтрокаТаблицыЗначений"));
//	Входы.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
//	Входы.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
//	Входы.Колонки.Добавить("КодЭтапа", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла));
//	Входы.Колонки.Добавить("ДанныеСпецификации", Новый ОписаниеТипов("Структура"));
//	
//	Выходы = Новый ТаблицаЗначений;
//	Выходы.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла));
//	Выходы.Колонки.Добавить("Этап", Новый ОписаниеТипов("СправочникСсылка.ЭтапыПроизводства"));
//	Выходы.Колонки.Добавить("СтрокаРС", Новый ОписаниеТипов("СтрокаТаблицыЗначений"));
//	Выходы.Колонки.Добавить("СтрокаРСИмяВладельца", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки));
//	Выходы.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
//	Выходы.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
//	Выходы.Колонки.Добавить("ДанныеСпецификации", Новый ОписаниеТипов("Структура"));
//	Выходы.Колонки.Добавить("Потребность", Новый ОписаниеТипов("СтрокаТаблицыЗначений"));
//	
//	СтПоискаПФНаЭтапе = Новый Структура("СпособПолученияМатериала, СпецификацияРемонта",
//		Перечисления.СпособыПолученияМатериаловВСпецификации.ПроизводитсяНаЭтапе,
//		Справочники.РесурсныеСпецификации.ПустаяСсылка());
//	СтПоискаНХЭтап = Новый Структура("Номенклатура, Характеристика, Этап");
//	//++ НЕ УТКА
//	СтПоискаАналоги = Новый Структура("СтрокаИндекс, Разрешение");
//	//-- НЕ УТКА
//	
//	Потребности.Сортировать("Порядок, Начало, Окончание, Уровень, Номенклатура, Характеристика, Спецификация, Назначение, Получатель, Отправитель");
//	
//	КодЭтапа = 10000000;
//	Для ИндексПотребность = 0 По Потребности.Количество()-1 Цикл
//		
//		Потребность = Потребности[ИндексПотребность];
//		Если Потребность.Свернута Тогда
//			Продолжить;
//		КонецЕсли;
//		
//		ВсегоПартий = 1;
//		Если ПараметрыРазузлования.РазделятьНаОптимальныеПартии
//				И Потребность.ПартияВыпуска.Расшифровка <> Неопределено Тогда
//			ВсегоПартий = Потребность.ПартияВыпуска.Расшифровка.Количество();
//		КонецЕсли;
//		
//		Для СчПартий = 1 По ВсегоПартий Цикл
//			
//			// Заполнение партии
//			Если ВсегоПартий = 1 Тогда
//				ДанныеСпецификации = Потребность.ДанныеСпецификации;
//				ПартияВыпуска = Потребность.ПартияВыпуска;
//			Иначе
//				ДанныеСпецификации = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(Потребность.ДанныеСпецификации);
//				
//				ПартияВыпуска = Потребность.ПартияВыпуска.Расшифровка[СчПартий-1];
//				ДанныеПоНоменклатуре = Справочники.РесурсныеСпецификации.ДанныеПоНоменклатуреРасширенный();
//				ЗаполнитьЗначенияСвойств(ДанныеПоНоменклатуре, Потребность);
//				Справочники.РесурсныеСпецификации.РассчитатьКоличествоНаПартиюВыпуска(ПартияВыпуска, ДанныеСпецификации, ДанныеПоНоменклатуре);
//				
//				Для каждого Этап Из ДанныеСпецификации.Этапы Цикл
//					Этап.КодЭтапа = КодЭтапа;
//					КодЭтапа = КодЭтапа + 1;
//				КонецЦикла;
//			КонецЕсли;
//			
//			ДобавитьПоляВДанныеСпецификации(ДанныеСпецификации, ПараметрыРазузлования);
//			
//			ЗаполнитьЗначенияСвойств(
//				ДанныеСпецификации,
//				Потребность,
//				"ДатаЗапуска, ДатаВыпуска, Начало, Окончание, РазмещениеВыпуска"
//				+ ?(ПустаяСтрока(ПараметрыРазузлования.ПоляГруппировки), "", "," + ПараметрыРазузлования.ПоляГруппировки)
//				+ ?(ПустаяСтрока(ПараметрыРазузлования.ДополнительнаяИнформация), "", "," + ПараметрыРазузлования.ДополнительнаяИнформация));
//			
//			ДанныеСпецификации.ПартияВыпуска = ПартияВыпуска;
//			
//			Если ДанныеСпецификации.ВыходныеИзделия.Количество() <> 0 Тогда
//				ДанныеСпецификации.ВыходныеИзделия.ЗагрузитьКолонку(
//					ДанныеСпецификации.ВыходныеИзделия.ВыгрузитьКолонку("Склад"), "Получатель");
//			КонецЕсли;
//			Если ДанныеСпецификации.ВозвратныеОтходы.Количество() <> 0 Тогда
//				ДанныеСпецификации.ВозвратныеОтходы.ЗагрузитьКолонку(
//					ДанныеСпецификации.ВозвратныеОтходы.ВыгрузитьКолонку("Склад"), "Получатель");
//			КонецЕсли;
//			
//			// Заполнение реквизитов по входящим данным
//			Для Индекс = 0 По Потребность.СвернутыеВходящиеПотребности.Количество() Цикл
//				ВхПотребность = ?(Индекс = 0,
//					?(Потребность.ЭтоВходящаяПотребность, Потребность, Неопределено),
//					Потребность.СвернутыеВходящиеПотребности[Индекс - 1]);
//				Если ВхПотребность = Неопределено ИЛИ ВхПотребность.Количество = 0 Тогда
//					Продолжить;
//				КонецЕсли;
//				
//				//++ НЕ УТКА
//				Если ВхПотребность.ЭтоРазборка Тогда
//					
//					Для каждого Строка Из ДанныеСпецификации.ВходящиеИзделия Цикл
//						
//						Если Строка.Распределено = Строка.Количество
//							ИЛИ Строка.Номенклатура <> ВхПотребность.Номенклатура
//							ИЛИ Строка.Характеристика <> ВхПотребность.Характеристика
//								И ЗначениеЗаполнено(Строка.Характеристика)
//								И НЕ Строка.ЛюбаяХарактеристика Тогда
//							Продолжить;
//						КонецЕсли;
//						
//						Если ВхПотребность.Количество >= Строка.Количество Тогда
//							СтрокаЗаполнить = Строка;
//						Иначе
//							НоваяСтрока = ДанныеСпецификации.ВходящиеИзделия.Добавить();
//							ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
//							НоваяСтрока.Количество = ВхПотребность.Количество;
//							НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество
//								* НоваяСтрока.ДанныеУпаковки.Знаменатель / НоваяСтрока.ДанныеУпаковки.Числитель;
//							СтрокаЗаполнить = НоваяСтрока;
//								
//							Строка.Количество = Строка.Количество - ВхПотребность.Количество;
//							Строка.КоличествоУпаковок = Строка.Количество
//								* Строка.ДанныеУпаковки.Знаменатель / Строка.ДанныеУпаковки.Числитель;
//						КонецЕсли;
//						
//						Если ЗначениеЗаполнено(ВхПотребность.Отправитель) Тогда
//							СтрокаЗаполнить.Склад = ВхПотребность.Отправитель;
//						КонецЕсли;
//						СтрокаЗаполнить.Характеристика = ВхПотребность.Характеристика;
//						Если ЗначениеЗаполнено(ВхПотребность.ЭтапИсточник) Тогда
//							СтрокаЗаполнить.ЭтапОтправитель = ВхПотребность.ЭтапИсточник;
//							СтрокаЗаполнить.Обособленно = Истина;
//							СтрокаЗаполнить.Производится = Истина;
//						КонецЕсли;
//						СтрокаЗаполнить.Распределено = СтрокаЗаполнить.Количество;
//						
//						ВхПотребность.Количество = ВхПотребность.Количество - СтрокаЗаполнить.Количество;
//						Если ВхПотребность.Количество = 0 Тогда
//							Прервать;
//						КонецЕсли;
//					КонецЦикла;
//					
//				Иначе // Сборка и ремонт

//				//-- НЕ УТКА
//					
//					Для Сч = 1 По 2 Цикл
//						Для каждого Строка Из ДанныеСпецификации[?(Сч = 1, "ВыходныеИзделия", "ВозвратныеОтходы")] Цикл
//							Если Строка.Распределено = Строка.Количество
//								ИЛИ Строка.Номенклатура <> ВхПотребность.Номенклатура
//								ИЛИ Строка.Характеристика <> ВхПотребность.Характеристика
//									И ЗначениеЗаполнено(Строка.Характеристика)
//									И НЕ Строка.ЛюбаяХарактеристика Тогда
//								Продолжить;
//							КонецЕсли;
//							
//							Распределено = Мин(Строка.Количество-Строка.Распределено, ВхПотребность.Количество);
//							
//							Если (Строка.Распределено = 0
//									И ВхПотребность.Количество >= Строка.Количество)
//								ИЛИ (СтрокиИдентичны(Строка, ВхПотребность,
//										"Характеристика,Получатель,Назначение,СписатьНаРасходы,СтатьяРасходов,АналитикаРасходов,АналитикаАктивовПассивов")
//									И Строка.ЭтапПотребитель = ВхПотребность.ЭтапИсточник) Тогда
//								
//								// Разделять строку не нужно
//								СтрокаЗаполнить = Строка;
//								
//							ИначеЕсли Строка.Округлить
//								И НЕ Строка.ЭтоЦеховаяКладовая
//								И Окр(Строка.Количество - Распределено) <> (Строка.Количество - Распределено) Тогда
//								
//								// При разделении строки будут нарушены правила округления
//								Если Строка.Распределено = 0 Тогда
//									Строка.Округлить = Ложь;
//									СтрокаЗаполнить = Строка;
//								Иначе
//									ВладелецСтроки = Строка.Владелец(); // ТаблицаЗначений
//									НоваяСтрока = ВладелецСтроки.Добавить();
//									ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
//									НоваяСтрока.Количество = Строка.Количество - Строка.Распределено;
//									НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество
//										* НоваяСтрока.ДанныеУпаковки.Знаменатель / НоваяСтрока.ДанныеУпаковки.Числитель;
//									НоваяСтрока.Распределено = 0;
//									НоваяСтрока.Округлить = Ложь;
//									СтрокаЗаполнить = НоваяСтрока;
//									
//									Строка.Количество = Строка.Распределено;
//									Строка.КоличествоУпаковок = Строка.Количество
//										* Строка.ДанныеУпаковки.Знаменатель / Строка.ДанныеУпаковки.Числитель;
//									Если Сч = 1 Тогда
//										ПроизводствоКлиентСервер.ПересчитатьДолюСтоимостиПриРазбиенииСтроки(
//											НоваяСтрока, Строка, ДанныеСпецификации.СпособРаспределенияЗатратНаВыходныеИзделия);
//									КонецЕсли;
//								КонецЕсли;
//								
//							Иначе
//								
//								// Разделение строки
//								ВладелецСтроки = Строка.Владелец(); // ТаблицаЗначений
//								НоваяСтрока = ВладелецСтроки.Добавить();
//								ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
//								НоваяСтрока.Количество = Распределено;
//								НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество
//									* НоваяСтрока.ДанныеУпаковки.Знаменатель / НоваяСтрока.ДанныеУпаковки.Числитель;
//								НоваяСтрока.Распределено = 0;
//								СтрокаЗаполнить = НоваяСтрока;
//								
//								Строка.Количество = Строка.Количество - Распределено;
//								Строка.КоличествоУпаковок = Строка.Количество
//									* Строка.ДанныеУпаковки.Знаменатель / Строка.ДанныеУпаковки.Числитель;
//								Если Сч = 1 Тогда
//									ПроизводствоКлиентСервер.ПересчитатьДолюСтоимостиПриРазбиенииСтроки(
//										НоваяСтрока, Строка, ДанныеСпецификации.СпособРаспределенияЗатратНаВыходныеИзделия);
//								КонецЕсли;
//								
//							КонецЕсли;
//							
//							ЗаполнитьЗначенияСвойств(СтрокаЗаполнить, ВхПотребность,
//								"Характеристика,Получатель,Назначение,СписатьНаРасходы,СтатьяРасходов,АналитикаРасходов,АналитикаАктивовПассивов");
//							СтрокаЗаполнить.ЭтапПотребитель = ВхПотребность.ЭтапИсточник;
//							СтрокаЗаполнить.Распределено = СтрокаЗаполнить.Распределено + Распределено;
//							
//							ВхПотребность.Количество = ВхПотребность.Количество - Распределено;
//							Если ВхПотребность.Количество = 0 Тогда
//								Прервать;
//							КонецЕсли;
//							
//						КонецЦикла;
//						Если ВхПотребность.Количество = 0 Тогда
//							Прервать;
//						КонецЕсли;
//					КонецЦикла;
//				
//				//++ НЕ УТКА	
//				КонецЕсли;
//				//-- НЕ УТКА
//				
//			КонецЦикла;
//			
//			// Зачет данных обеспечения
//			Свертка = Новый Соответствие;
//			МатериалыУдалить = Новый Массив;
//			Для каждого Обеспечение Из Потребность.Обеспечение Цикл
//				Строка = ДанныеСпецификации.МатериалыИУслуги[Обеспечение.СтрокаИндекс];
//				Если Обеспечение.Количество = 0 ИЛИ Строка.Количество = 0 ИЛИ НЕ Строка.Производится Тогда
//					Продолжить;
//				КонецЕсли;
//				
//				КоличествоЗачет = Мин(Строка.Количество, Обеспечение.Количество);
//				
//			//++ НЕ УТКА
//				Если Обеспечение.ЗаменаНаАналог Тогда
//					
//					// Обеспечение через замену на аналоги
//					ЗаполнитьЗначенияСвойств(СтПоискаАналоги, Обеспечение);
//					Для каждого Аналог Из Потребность.Аналоги.НайтиСтроки(СтПоискаАналоги) Цикл
//						НоваяСтрока = ДанныеСпецификации.МатериалыИУслуги.Добавить();
//						ЗаполнитьЗначенияСвойств(НоваяСтрока, Аналог, "Номенклатура,Характеристика,Склад");
//						ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка, "Этап,ПодразделениеЭтапа");
//						Если Обеспечение.Количество = КоличествоЗачет Тогда
//							НоваяСтрока.Количество = Аналог.Количество;
//						Иначе
//							НоваяСтрока.Количество = ОКР(Аналог.Количество * КоличествоЗачет / Обеспечение.Количество, 3);
//							Аналог.Количество = Аналог.Количество - НоваяСтрока.Количество;
//						КонецЕсли;
//						НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество;
//						НоваяСтрока.Обособленно = Обеспечение.Обособленно;
//						НоваяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.СоСклада;
//						НоваяСтрока.Производится = Ложь;
//					КонецЦикла;
//					
//					Строка.Количество = Строка.Количество - КоличествоЗачет;
//					Если Строка.Количество = 0 Тогда
//						Строка.Производится = Ложь;
//						Строка.ПроизводитсяВПроцессе = Ложь;
//						МатериалыУдалить.Добавить(Строка);
//					Иначе
//						// При замене на аналоги исходная строка переводится в базовую ед. изм.
//						Строка.КоличествоУпаковок = Строка.Количество;
//						Строка.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
//					КонецЕсли;
//					
//				Иначе
//			//-- НЕ УТКА
//					
//					// Обеспечение из остатков на складе
//					СтрокаЗаполнить = Неопределено;
//					Если Строка.Количество = КоличествоЗачет Тогда
//						СтрокаЗаполнить = Строка;
//					Иначе
//						НоваяСтрока = ДанныеСпецификации.МатериалыИУслуги.Добавить();
//						ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
//						НоваяСтрока.Количество = КоличествоЗачет;
//						НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество
//							* Строка.ДанныеУпаковки.Знаменатель / Строка.ДанныеУпаковки.Числитель;
//						
//						СтрокаЗаполнить = НоваяСтрока;
//						
//						Строка.Количество = Строка.Количество - КоличествоЗачет;
//						Строка.КоличествоУпаковок = Строка.Количество
//							* Строка.ДанныеУпаковки.Знаменатель / Строка.ДанныеУпаковки.Числитель;
//					КонецЕсли;
//					
//					СтрокаЗаполнить.Производится = Ложь;
//					СтрокаЗаполнить.ПроизводитсяВПроцессе = Ложь;
//					СтрокаЗаполнить.ИсточникПолученияПолуфабриката = Справочники.РесурсныеСпецификации.ПустаяСсылка();
//					//++ Устарело_Производство21
//					СтрокаЗаполнить.СпособПолученияПолуфабриката = Перечисления.СпособыПолученияМатериаловВСпецификации.ПустаяСсылка();
//					//-- Устарело_Производство21
//					СтрокаЗаполнить.Спецификация = Справочники.РесурсныеСпецификации.ПустаяСсылка();
//					СтрокаЗаполнить.СтатьяКалькуляции = Справочники.СтатьиКалькуляции.ПустаяСсылка();
//					СтрокаЗаполнить.Обособленно = Обеспечение.Обособленно;
//					СтрокаЗаполнить.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.СоСклада;
//					
//			//++ НЕ УТКА	
//				КонецЕсли;
//			//-- НЕ УТКА
//				
//				Обеспечение.Количество = Обеспечение.Количество - КоличествоЗачет;
//			КонецЦикла;
//			
//			// Добавление выходов
//			Для каждого Связь Из Потребность.Выходы Цикл
//				Связь.Связь = Неопределено; // Разрыв циклических ссылок
//				
//				Если ВсегоПартий = 1 Тогда
//					СтрокаРС = Связь.СтрокаРС;
//				Иначе
//					ТаблицаРС = Связь.СтрокаРС.Владелец(); // ТаблицаЗначений
//					СтрокаРС = ДанныеСпецификации[Связь.СтрокаРСИмяВладельца][ТаблицаРС.Индекс(Связь.СтрокаРС)];
//				КонецЕсли;
//				
//				Выход = Выходы.Добавить();
//				Выход.Идентификатор = Связь.СвязьИдентификатор;
//				Выход.Этап = Связь.СвязьЭтап;
//				Выход.СтрокаРС = СтрокаРС;
//				Выход.СтрокаРСИмяВладельца = Связь.СтрокаРСИмяВладельца;
//				Выход.Номенклатура = Связь.СтрокаРС.Номенклатура;
//				Выход.Характеристика = Связь.СтрокаРС.Характеристика;
//				Выход.ДанныеСпецификации = ДанныеСпецификации;
//				Выход.Потребность = Потребность;
//			КонецЦикла;
//			
//			// Добавление входов
//			Для каждого Связь Из Потребность.Входы Цикл
//				Связь.Связь = Неопределено; // Разрыв циклических ссылок
//				
//				Если ВсегоПартий = 1 Тогда
//					СтрокаРС = Связь.СтрокаРС;
//				Иначе
//					ТаблицаРС = Связь.СтрокаРС.Владелец(); // ТаблицаЗначений
//					СтрокаРС = ДанныеСпецификации[Связь.СтрокаРСИмяВладельца][ТаблицаРС.Индекс(Связь.СтрокаРС)];
//				КонецЕсли;
//				Если Связь.Родитель                  // Связи с родительскими потребностями добавляются через входящие изделия
//					ИЛИ НЕ СтрокаРС.Производится Тогда // Потребность закрыта обеспечением
//					Продолжить; 
//				КонецЕсли;
//				
//				Вход = Входы.Добавить();
//				Вход.Идентификатор = Потребность.Идентификатор;
//				Вход.Этап = СтрокаРС.Этап;
//				Вход.СтрокаРС = СтрокаРС;
//				Вход.Номенклатура = Связь.СтрокаРС.Номенклатура;
//				Вход.Характеристика = Связь.СтрокаРС.Характеристика;
//				Вход.КодЭтапа = ДанныеСпецификации.Этапы.Найти(Вход.СтрокаРС.Этап, "Этап").КодЭтапа;
//				Вход.ДанныеСпецификации = ДанныеСпецификации;
//			КонецЦикла;
//			//++ НЕ УТКА
//			Для каждого Строка Из ДанныеСпецификации.ВходящиеИзделия Цикл
//				Если Строка.Распределено = Строка.Количество Тогда
//					Продолжить;
//				КонецЕсли;
//				Вход = Входы.Добавить();
//				Вход.Идентификатор = Потребность.Идентификатор;
//				Вход.Этап = Строка.Этап;
//				Вход.СтрокаРС = Строка;
//				Вход.Номенклатура = Строка.Номенклатура;
//				Вход.Характеристика = Строка.Характеристика;
//				Вход.КодЭтапа = ДанныеСпецификации.Этапы.Найти(Строка.Этап, "Этап").КодЭтапа;
//				Вход.ДанныеСпецификации = ДанныеСпецификации;
//			КонецЦикла;
//			//-- НЕ УТКА
//			
//			// Добавление связей по ПФ, производимым на этапе
//			Для каждого Строка Из ДанныеСпецификации.МатериалыИУслуги.НайтиСтроки(СтПоискаПФНаЭтапе) Цикл
//				Вход = Входы.Добавить();
//				Вход.Идентификатор = Потребность.Идентификатор;
//				Вход.Этап = Строка.Этап;
//				Вход.СтрокаРС = Строка;
//				Вход.Номенклатура = Строка.Номенклатура;
//				Вход.Характеристика = Строка.Характеристика;
//				Вход.КодЭтапа = ДанныеСпецификации.Этапы.Найти(Строка.Этап, "Этап").КодЭтапа;
//				Вход.ДанныеСпецификации = ДанныеСпецификации;
//				
//				СтПоискаНХЭтап.Номенклатура = Строка.Номенклатура;
//				СтПоискаНХЭтап.Характеристика = Строка.Характеристика;
//				СтПоискаНХЭтап.Этап = Строка.ИсточникПолученияПолуфабриката;
//				
//				Для каждого СтрокаВыход Из ДанныеСпецификации.ВозвратныеОтходы.НайтиСтроки(СтПоискаНХЭтап) Цикл
//					Выход = Выходы.Добавить();
//					Выход.Идентификатор = Потребность.Идентификатор;
//					Выход.Этап = Строка.Этап;
//					Выход.СтрокаРС = СтрокаВыход;
//					Выход.СтрокаРСИмяВладельца = "ВозвратныеОтходы";
//					Выход.Номенклатура = СтрокаВыход.Номенклатура;
//					Выход.Характеристика = СтрокаВыход.Характеристика;
//					Выход.ДанныеСпецификации = ДанныеСпецификации;
//					Выход.Потребность = Потребность;
//				КонецЦикла;
//			КонецЦикла;
//			
//			Для каждого Строка Из МатериалыУдалить Цикл
//				ДанныеСпецификации.МатериалыИУслуги.Удалить(Строка);
//			КонецЦикла;
//			
//			//++ Гурьев 13.09.23 Перенос комментария к заказу в этапы
//			ДанныеСпецификации.Вставить("КАНАТ_КомментарийКЗаказу", Потребность.КАНАТ_КомментарийКЗаказу);
//			ДанныеСпецификации.Вставить("КАНАТ_Сертификат", Потребность.КАНАТ_Сертификат);
//			//-- Гурьев 13.09.23
//			
//			Результат.Добавить(ДанныеСпецификации);
//		КонецЦикла;
//	КонецЦикла;
//	
//	// Построение связей
//	Входы.Сортировать("Идентификатор, Этап, Номенклатура, Характеристика", Новый СравнениеЗначений());
//	Выходы.Сортировать("Идентификатор, Этап, Номенклатура, Характеристика", Новый СравнениеЗначений());
//	ИндВыход = 0;
//	ИндВыходМакс = Выходы.Количество()-1;
//	
//	Для ИндВход = 0 По Входы.Количество()-1 Цикл
//		Вход = Входы[ИндВход];
//		Остаток = Вход.СтрокаРС.Количество;
//		ИндВыход = ?(ИндВыход <= ИндВыходМакс, ИндВыход, 0);
//		Пока ИндВыход <= ИндВыходМакс Цикл
//			Выход = Выходы[ИндВыход];
//			
//			Если Выход.СтрокаРС.Распределено = Выход.СтрокаРС.Количество
//				ИЛИ Выход.СтрокаРС.Количество = 0
//				ИЛИ Выход.Идентификатор <> Вход.Идентификатор
//				ИЛИ Выход.Этап <> Вход.Этап
//				ИЛИ Выход.Номенклатура <> Вход.Номенклатура
//				ИЛИ Выход.Характеристика <> Вход.Характеристика
//					И ЗначениеЗаполнено(Выход.Характеристика) Тогда
//				ИндВыход = ИндВыход + 1;
//				Продолжить;
//			КонецЕсли;
//			
//			Если Не Выход.Потребность.ПланироватьНеРанее.Пустая() Тогда // Привязка к этапу ПланироватьНеРанее
//				Выход.ДанныеСпецификации.ПланироватьНеРанееКодЭтапа =
//					Вход.ДанныеСпецификации.Этапы.Найти(Выход.Потребность.ПланироватьНеРанее, "Этап").КодЭтапа;
//			КонецЕсли;
//			
//			Если Выход.СтрокаРС.Распределено <> 0 
//				ИЛИ Выход.СтрокаРС.Количество > Остаток Тогда
//				СтрокаВыход = Выход.СтрокаРС.Владелец().Вставить(0);
//				ЗаполнитьЗначенияСвойств(СтрокаВыход, Выход.СтрокаРС);
//				СтрокаВыход.Количество = Мин((Выход.СтрокаРС.Количество-Выход.СтрокаРС.Распределено), Остаток);
//				СтрокаВыход.КоличествоУпаковок = СтрокаВыход.Количество * СтрокаВыход.ДанныеУпаковки.Знаменатель / СтрокаВыход.ДанныеУпаковки.Числитель;
//				
//				Выход.СтрокаРС.Количество = Выход.СтрокаРС.Количество - СтрокаВыход.Количество;
//				Выход.СтрокаРС.КоличествоУпаковок = Выход.СтрокаРС.Количество * Выход.СтрокаРС.ДанныеУпаковки.Знаменатель / Выход.СтрокаРС.ДанныеУпаковки.Числитель;
//				
//				Если Выход.СтрокаРСИмяВладельца = "ВыходныеИзделия" Тогда
//					ПроизводствоКлиентСервер.ПересчитатьДолюСтоимостиПриРазбиенииСтроки(
//						СтрокаВыход, Выход.СтрокаРС, ДанныеСпецификации.СпособРаспределенияЗатратНаВыходныеИзделия);
//				КонецЕсли;
//				
//				// Контроль соблюдения правил округления
//				Если Выход.СтрокаРС.Округлить
//					И Окр(Выход.СтрокаРС.Количество) <> Выход.СтрокаРС.Количество Тогда
//					
//					Если Выход.СтрокаРС.Распределено = 0 Тогда
//						Выход.СтрокаРС.Получатель = Вход.СтрокаРС.Склад;
//						Выход.СтрокаРС.Округлить = Ложь;
//					ИначеЕсли Выход.СтрокаРС.Количество > Выход.СтрокаРС.Распределено Тогда
//						НоваяСтрока = Выход.СтрокаРС.Владелец().Вставить(0);
//						ЗаполнитьЗначенияСвойств(НоваяСтрока, Выход.СтрокаРС);
//						НоваяСтрока.Количество = Выход.СтрокаРС.Количество - Выход.СтрокаРС.Распределено;
//						НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество * НоваяСтрока.ДанныеУпаковки.Знаменатель / НоваяСтрока.ДанныеУпаковки.Числитель;
//						НоваяСтрока.Распределено = 0;
//						НоваяСтрока.Получатель = Вход.СтрокаРС.Склад;
//						НоваяСтрока.Округлить = Ложь;
//						
//						Выход.СтрокаРС.Количество = Выход.СтрокаРС.Распределено;
//						Выход.СтрокаРС.КоличествоУпаковок = Выход.СтрокаРС.Количество * Выход.СтрокаРС.ДанныеУпаковки.Знаменатель / Выход.СтрокаРС.ДанныеУпаковки.Числитель;
//						
//						Если Выход.СтрокаРСИмяВладельца = "ВыходныеИзделия" Тогда
//							ПроизводствоКлиентСервер.ПересчитатьДолюСтоимостиПриРазбиенииСтроки(
//								НоваяСтрока, Выход.СтрокаРС, ДанныеСпецификации.СпособРаспределенияЗатратНаВыходныеИзделия);
//						КонецЕсли;
//					КонецЕсли;	
//				КонецЕсли;
//			Иначе
//				СтрокаВыход = Выход.СтрокаРС;
//				ИндВыход = ИндВыход + 1;
//			КонецЕсли;
//			
//			СтрокаВыход.Получатель = ?(Вход.СтрокаРС.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Работа,
//				Вход.СтрокаРС.ПодразделениеЭтапа,
//				Вход.СтрокаРС.Склад);
//			СтрокаВыход.КодЭтапаПолучателя = Вход.КодЭтапа;
//			СтрокаВыход.Распределено = СтрокаВыход.Количество;
//			
//			Если Выход.СтрокаРС.ЛюбаяХарактеристика
//				И Не ЗначениеЗаполнено(Выход.Характеристика) Тогда
//				СтрокаВыход.Характеристика = Вход.СтрокаРС.Характеристика;
//			КонецЕсли;
//			
//			Остаток = Остаток - СтрокаВыход.Количество;
//			Если Остаток = 0 Тогда
//				Прервать;
//			КонецЕсли;
//		КонецЦикла;
//	КонецЦикла;
//	
//	Возврат Результат;
//	
//КонецФункции

&ИзменениеИКонтроль("РазделитьПотребностиНаПартии")
Функция КАНАТ_РазделитьПотребностиНаПартии(Потребности, ПараметрыРазузлования)

	Результат = Новый Массив;

	Входы = Новый ТаблицаЗначений;
	Входы.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла));
	Входы.Колонки.Добавить("Этап", Новый ОписаниеТипов("СправочникСсылка.ЭтапыПроизводства"));
	Входы.Колонки.Добавить("СтрокаРС", Новый ОписаниеТипов("СтрокаТаблицыЗначений"));
	Входы.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Входы.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	Входы.Колонки.Добавить("КодЭтапа", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла));
	Входы.Колонки.Добавить("ДанныеСпецификации", Новый ОписаниеТипов("Структура"));

	Выходы = Новый ТаблицаЗначений;
	Выходы.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла));
	Выходы.Колонки.Добавить("Этап", Новый ОписаниеТипов("СправочникСсылка.ЭтапыПроизводства"));
	Выходы.Колонки.Добавить("СтрокаРС", Новый ОписаниеТипов("СтрокаТаблицыЗначений"));
	Выходы.Колонки.Добавить("СтрокаРСИмяВладельца", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки));
	Выходы.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Выходы.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	Выходы.Колонки.Добавить("ДанныеСпецификации", Новый ОписаниеТипов("Структура"));
	Выходы.Колонки.Добавить("Потребность", Новый ОписаниеТипов("СтрокаТаблицыЗначений"));

	СтПоискаПФНаЭтапе = Новый Структура("СпособПолученияМатериала, СпецификацияРемонта",
	Перечисления.СпособыПолученияМатериаловВСпецификации.ПроизводитсяНаЭтапе,
	Справочники.РесурсныеСпецификации.ПустаяСсылка());
	СтПоискаНХЭтап = Новый Структура("Номенклатура, Характеристика, Этап");
	//++ НЕ УТКА
	СтПоискаАналоги = Новый Структура("СтрокаИндекс, Разрешение");
	//-- НЕ УТКА

	Потребности.Сортировать("Порядок, Начало, Окончание, Уровень, Номенклатура, Характеристика, Спецификация, Назначение, Получатель, Отправитель");

	КодЭтапа = 10000000;
	ИдентификаторВыпускаНаЭтапе = 10000000;
	Для ИндексПотребность = 0 По Потребности.Количество()-1 Цикл

		Потребность = Потребности[ИндексПотребность];
		Если Потребность.Свернута Тогда
			Продолжить;
		КонецЕсли;

		ВсегоПартий = 1;
		Если ПараметрыРазузлования.РазделятьНаОптимальныеПартии
			И Потребность.ПартияВыпуска.Расшифровка <> Неопределено Тогда
			ВсегоПартий = Потребность.ПартияВыпуска.Расшифровка.Количество();
		КонецЕсли;

		Для СчПартий = 1 По ВсегоПартий Цикл

			// Заполнение партии
			Если ВсегоПартий = 1 Тогда
				ДанныеСпецификации = Потребность.ДанныеСпецификации;
				ПартияВыпуска = Потребность.ПартияВыпуска;
			Иначе
				ДанныеСпецификации = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(Потребность.ДанныеСпецификации);

				ПартияВыпуска = Потребность.ПартияВыпуска.Расшифровка[СчПартий-1];
				ДанныеПоНоменклатуре = Справочники.РесурсныеСпецификации.ДанныеПоНоменклатуреРасширенный();
				ЗаполнитьЗначенияСвойств(ДанныеПоНоменклатуре, Потребность);
				Справочники.РесурсныеСпецификации.РассчитатьКоличествоНаПартиюВыпуска(ПартияВыпуска, ДанныеСпецификации, ДанныеПоНоменклатуре);

				Для каждого Этап Из ДанныеСпецификации.Этапы Цикл
					Этап.КодЭтапа = КодЭтапа;
					КодЭтапа = КодЭтапа + 1;
				КонецЦикла;
			КонецЕсли;

			ДобавитьПоляВДанныеСпецификации(ДанныеСпецификации, ПараметрыРазузлования);

			ЗаполнитьЗначенияСвойств(
			ДанныеСпецификации,
			Потребность,
			"ДатаЗапуска, ДатаВыпуска, Начало, Окончание, РазмещениеВыпуска"
			+ ?(ПустаяСтрока(ПараметрыРазузлования.ПоляГруппировки), "", "," + ПараметрыРазузлования.ПоляГруппировки)
			+ ?(ПустаяСтрока(ПараметрыРазузлования.ДополнительнаяИнформация), "", "," + ПараметрыРазузлования.ДополнительнаяИнформация));

			ДанныеСпецификации.ПартияВыпуска = ПартияВыпуска;

			Если ДанныеСпецификации.ВыходныеИзделия.Количество() <> 0 Тогда
				ДанныеСпецификации.ВыходныеИзделия.ЗагрузитьКолонку(
				ДанныеСпецификации.ВыходныеИзделия.ВыгрузитьКолонку("Склад"), "Получатель");
			КонецЕсли;
			Если ДанныеСпецификации.ВозвратныеОтходы.Количество() <> 0 Тогда
				ДанныеСпецификации.ВозвратныеОтходы.ЗагрузитьКолонку(
				ДанныеСпецификации.ВозвратныеОтходы.ВыгрузитьКолонку("Склад"), "Получатель");
			КонецЕсли;

			// Заполнение реквизитов по входящим данным
			Для Индекс = 0 По Потребность.СвернутыеВходящиеПотребности.Количество() Цикл
				ВхПотребность = ?(Индекс = 0,
				?(Потребность.ЭтоВходящаяПотребность, Потребность, Неопределено),
				Потребность.СвернутыеВходящиеПотребности[Индекс - 1]);
				Если ВхПотребность = Неопределено ИЛИ ВхПотребность.Количество = 0 Тогда
					Продолжить;
				КонецЕсли;

				//++ НЕ УТКА
				Если ВхПотребность.ЭтоРазборка Тогда

					Для каждого Строка Из ДанныеСпецификации.ВходящиеИзделия Цикл

						Если Строка.Распределено = Строка.Количество
							ИЛИ Строка.Номенклатура <> ВхПотребность.Номенклатура
							ИЛИ Строка.Характеристика <> ВхПотребность.Характеристика
							И ЗначениеЗаполнено(Строка.Характеристика)
							И НЕ Строка.ЛюбаяХарактеристика Тогда
							Продолжить;
						КонецЕсли;

						Если ВхПотребность.Количество >= Строка.Количество Тогда
							СтрокаЗаполнить = Строка;
						Иначе
							НоваяСтрока = ДанныеСпецификации.ВходящиеИзделия.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
							НоваяСтрока.Количество = ВхПотребность.Количество;
							НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество
							* НоваяСтрока.ДанныеУпаковки.Знаменатель / НоваяСтрока.ДанныеУпаковки.Числитель;
							СтрокаЗаполнить = НоваяСтрока;

							Строка.Количество = Строка.Количество - ВхПотребность.Количество;
							Строка.КоличествоУпаковок = Строка.Количество
							* Строка.ДанныеУпаковки.Знаменатель / Строка.ДанныеУпаковки.Числитель;
						КонецЕсли;

						Если ЗначениеЗаполнено(ВхПотребность.Отправитель) Тогда
							СтрокаЗаполнить.Склад = ВхПотребность.Отправитель;
						КонецЕсли;
						СтрокаЗаполнить.Характеристика = ВхПотребность.Характеристика;
						Если ЗначениеЗаполнено(ВхПотребность.ЭтапИсточник) Тогда
							СтрокаЗаполнить.ЭтапОтправитель = ВхПотребность.ЭтапИсточник;
							СтрокаЗаполнить.Обособленно = Истина;
							СтрокаЗаполнить.Производится = Истина;
						КонецЕсли;
						СтрокаЗаполнить.Распределено = СтрокаЗаполнить.Количество;

						ВхПотребность.Количество = ВхПотребность.Количество - СтрокаЗаполнить.Количество;
						Если ВхПотребность.Количество = 0 Тогда
							Прервать;
						КонецЕсли;
					КонецЦикла;

				Иначе // Сборка и ремонт

					//-- НЕ УТКА

					Для Сч = 1 По 2 Цикл
						Для каждого Строка Из ДанныеСпецификации[?(Сч = 1, "ВыходныеИзделия", "ВозвратныеОтходы")] Цикл
							Если Строка.Распределено = Строка.Количество
								ИЛИ Строка.Номенклатура <> ВхПотребность.Номенклатура
								ИЛИ Строка.Характеристика <> ВхПотребность.Характеристика
								И ЗначениеЗаполнено(Строка.Характеристика)
								И НЕ Строка.ЛюбаяХарактеристика Тогда
								Продолжить;
							КонецЕсли;

							Распределено = Мин(Строка.Количество-Строка.Распределено, ВхПотребность.Количество);

							Если (Строка.Распределено = 0
								И ВхПотребность.Количество >= Строка.Количество)
								ИЛИ (СтрокиИдентичны(Строка, ВхПотребность,
								"Характеристика,Получатель,Назначение,СписатьНаРасходы,СтатьяРасходов,АналитикаРасходов,АналитикаАктивовПассивов")
								И Строка.ЭтапПотребитель = ВхПотребность.ЭтапИсточник) Тогда

								// Разделять строку не нужно
								СтрокаЗаполнить = Строка;

							ИначеЕсли Строка.Округлить
								И НЕ Строка.ЭтоЦеховаяКладовая
								И Окр(Строка.Количество - Распределено) <> (Строка.Количество - Распределено) Тогда

								// При разделении строки будут нарушены правила округления
								Если Строка.Распределено = 0 Тогда
									Строка.Округлить = Ложь;
									СтрокаЗаполнить = Строка;
								Иначе
									ВладелецСтроки = Строка.Владелец(); // ТаблицаЗначений
									НоваяСтрока = ВладелецСтроки.Добавить();
									ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
									НоваяСтрока.Количество = Строка.Количество - Строка.Распределено;
									НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество
									* НоваяСтрока.ДанныеУпаковки.Знаменатель / НоваяСтрока.ДанныеУпаковки.Числитель;
									НоваяСтрока.Распределено = 0;
									НоваяСтрока.Округлить = Ложь;
									СтрокаЗаполнить = НоваяСтрока;

									Строка.Количество = Строка.Распределено;
									Строка.КоличествоУпаковок = Строка.Количество
									* Строка.ДанныеУпаковки.Знаменатель / Строка.ДанныеУпаковки.Числитель;
									Если Сч = 1 Тогда
										ПроизводствоКлиентСервер.ПересчитатьДолюСтоимостиПриРазбиенииСтроки(
										НоваяСтрока, Строка, ДанныеСпецификации.СпособРаспределенияЗатратНаВыходныеИзделия);
									КонецЕсли;
								КонецЕсли;

							Иначе

								// Разделение строки
								ВладелецСтроки = Строка.Владелец(); // ТаблицаЗначений
								НоваяСтрока = ВладелецСтроки.Добавить();
								ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
								НоваяСтрока.Количество = Распределено;
								НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество
								* НоваяСтрока.ДанныеУпаковки.Знаменатель / НоваяСтрока.ДанныеУпаковки.Числитель;
								НоваяСтрока.Распределено = 0;
								СтрокаЗаполнить = НоваяСтрока;

								Строка.Количество = Строка.Количество - Распределено;
								Строка.КоличествоУпаковок = Строка.Количество
								* Строка.ДанныеУпаковки.Знаменатель / Строка.ДанныеУпаковки.Числитель;
								Если Сч = 1 Тогда
									ПроизводствоКлиентСервер.ПересчитатьДолюСтоимостиПриРазбиенииСтроки(
									НоваяСтрока, Строка, ДанныеСпецификации.СпособРаспределенияЗатратНаВыходныеИзделия);
								КонецЕсли;

							КонецЕсли;

							ЗаполнитьЗначенияСвойств(СтрокаЗаполнить, ВхПотребность,
							"Характеристика,Получатель,Назначение,СписатьНаРасходы,СтатьяРасходов,АналитикаРасходов,АналитикаАктивовПассивов");
							СтрокаЗаполнить.ЭтапПотребитель = ВхПотребность.ЭтапИсточник;
							СтрокаЗаполнить.Распределено = СтрокаЗаполнить.Распределено + Распределено;

							ВхПотребность.Количество = ВхПотребность.Количество - Распределено;
							Если ВхПотребность.Количество = 0 Тогда
								Прервать;
							КонецЕсли;

						КонецЦикла;
						Если ВхПотребность.Количество = 0 Тогда
							Прервать;
						КонецЕсли;
					КонецЦикла;

					//++ НЕ УТКА	
				КонецЕсли;
				//-- НЕ УТКА

			КонецЦикла;

			// Зачет данных обеспечения
			Свертка = Новый Соответствие;
			МатериалыУдалить = Новый Массив;
			Для каждого Обеспечение Из Потребность.Обеспечение Цикл
				Строка = ДанныеСпецификации.МатериалыИУслуги[Обеспечение.СтрокаИндекс];
				Если Обеспечение.Количество = 0 ИЛИ Строка.Количество = 0 ИЛИ НЕ Строка.Производится Тогда
					Продолжить;
				КонецЕсли;

				КоличествоЗачет = Мин(Строка.Количество, Обеспечение.Количество);

				//++ НЕ УТКА
				Если Обеспечение.ЗаменаНаАналог Тогда

					// Обеспечение через замену на аналоги
					ЗаполнитьЗначенияСвойств(СтПоискаАналоги, Обеспечение);
					Для каждого Аналог Из Потребность.Аналоги.НайтиСтроки(СтПоискаАналоги) Цикл
						НоваяСтрока = ДанныеСпецификации.МатериалыИУслуги.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Аналог, "Номенклатура,Характеристика,Склад");
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка, "Этап,ПодразделениеЭтапа");
						Если Обеспечение.Количество = КоличествоЗачет Тогда
							НоваяСтрока.Количество = Аналог.Количество;
						Иначе
							НоваяСтрока.Количество = ОКР(Аналог.Количество * КоличествоЗачет / Обеспечение.Количество, 3);
							Аналог.Количество = Аналог.Количество - НоваяСтрока.Количество;
						КонецЕсли;
						НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество;
						НоваяСтрока.Обособленно = Обеспечение.Обособленно;
						НоваяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.СоСклада;
						НоваяСтрока.Производится = Ложь;
					КонецЦикла;

					Строка.Количество = Строка.Количество - КоличествоЗачет;
					Если Строка.Количество = 0 Тогда
						Строка.Производится = Ложь;
						Строка.ПроизводитсяВПроцессе = Ложь;
						МатериалыУдалить.Добавить(Строка);
					Иначе
						// При замене на аналоги исходная строка переводится в базовую ед. изм.
						Строка.КоличествоУпаковок = Строка.Количество;
						Строка.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
					КонецЕсли;

				Иначе
					//-- НЕ УТКА

					// Обеспечение из остатков на складе
					СтрокаЗаполнить = Неопределено;
					Если Строка.Количество = КоличествоЗачет Тогда
						СтрокаЗаполнить = Строка;
					Иначе
						НоваяСтрока = ДанныеСпецификации.МатериалыИУслуги.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
						НоваяСтрока.Количество = КоличествоЗачет;
						НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество
						* Строка.ДанныеУпаковки.Знаменатель / Строка.ДанныеУпаковки.Числитель;

						СтрокаЗаполнить = НоваяСтрока;

						Строка.Количество = Строка.Количество - КоличествоЗачет;
						Строка.КоличествоУпаковок = Строка.Количество
						* Строка.ДанныеУпаковки.Знаменатель / Строка.ДанныеУпаковки.Числитель;
					КонецЕсли;

					СтрокаЗаполнить.Производится = Ложь;
					СтрокаЗаполнить.ПроизводитсяВПроцессе = Ложь;
					СтрокаЗаполнить.ИсточникПолученияПолуфабриката = Справочники.РесурсныеСпецификации.ПустаяСсылка();
					//++ Устарело_Производство21
					СтрокаЗаполнить.СпособПолученияПолуфабриката = Перечисления.СпособыПолученияМатериаловВСпецификации.ПустаяСсылка();
					//-- Устарело_Производство21
					СтрокаЗаполнить.Спецификация = Справочники.РесурсныеСпецификации.ПустаяСсылка();
					СтрокаЗаполнить.Обособленно = Обеспечение.Обособленно;
					СтрокаЗаполнить.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.СоСклада;

					//++ НЕ УТКА	
				КонецЕсли;
				//-- НЕ УТКА

				Обеспечение.Количество = Обеспечение.Количество - КоличествоЗачет;
			КонецЦикла;

			// Добавление выходов
			Для каждого Связь Из Потребность.Выходы Цикл
				Связь.Связь = Неопределено; // Разрыв циклических ссылок

				Если ВсегоПартий = 1 Тогда
					СтрокаРС = Связь.СтрокаРС;
				Иначе
					ТаблицаРС = Связь.СтрокаРС.Владелец(); // ТаблицаЗначений
					СтрокаРС = ДанныеСпецификации[Связь.СтрокаРСИмяВладельца][ТаблицаРС.Индекс(Связь.СтрокаРС)];
				КонецЕсли;

				Выход = Выходы.Добавить();
				Выход.Идентификатор = Связь.СвязьИдентификатор;
				Выход.Этап = Связь.СвязьЭтап;
				Выход.СтрокаРС = СтрокаРС;
				Выход.СтрокаРСИмяВладельца = Связь.СтрокаРСИмяВладельца;
				Выход.Номенклатура = Связь.СтрокаРС.Номенклатура;
				Выход.Характеристика = Связь.СтрокаРС.Характеристика;
				Выход.ДанныеСпецификации = ДанныеСпецификации;
				Выход.Потребность = Потребность;
			КонецЦикла;

			// Добавление входов
			Для каждого Связь Из Потребность.Входы Цикл
				Связь.Связь = Неопределено; // Разрыв циклических ссылок

				Если ВсегоПартий = 1 Тогда
					СтрокаРС = Связь.СтрокаРС;
				Иначе
					ТаблицаРС = Связь.СтрокаРС.Владелец(); // ТаблицаЗначений
					СтрокаРС = ДанныеСпецификации[Связь.СтрокаРСИмяВладельца][ТаблицаРС.Индекс(Связь.СтрокаРС)];
				КонецЕсли;
				Если Связь.Родитель                  // Связи с родительскими потребностями добавляются через входящие изделия
					ИЛИ НЕ СтрокаРС.Производится Тогда // Потребность закрыта обеспечением
					Продолжить; 
				КонецЕсли;

				Вход = Входы.Добавить();
				Вход.Идентификатор = Потребность.Идентификатор;
				Вход.Этап = СтрокаРС.Этап;
				Вход.СтрокаРС = СтрокаРС;
				Вход.Номенклатура = Связь.СтрокаРС.Номенклатура;
				Вход.Характеристика = Связь.СтрокаРС.Характеристика;
				Вход.КодЭтапа = ДанныеСпецификации.Этапы.Найти(Вход.СтрокаРС.Этап, "Этап").КодЭтапа;
				Вход.ДанныеСпецификации = ДанныеСпецификации;
			КонецЦикла;
			//++ НЕ УТКА
			Для каждого Строка Из ДанныеСпецификации.ВходящиеИзделия Цикл
				Если Строка.Распределено = Строка.Количество Тогда
					Продолжить;
				КонецЕсли;
				Вход = Входы.Добавить();
				Вход.Идентификатор = Потребность.Идентификатор;
				Вход.Этап = Строка.Этап;
				Вход.СтрокаРС = Строка;
				Вход.Номенклатура = Строка.Номенклатура;
				Вход.Характеристика = Строка.Характеристика;
				Вход.КодЭтапа = ДанныеСпецификации.Этапы.Найти(Строка.Этап, "Этап").КодЭтапа;
				Вход.ДанныеСпецификации = ДанныеСпецификации;
			КонецЦикла;
			//-- НЕ УТКА

			// Добавление связей по ПФ, производимым на этапе
			Для каждого Строка Из ДанныеСпецификации.МатериалыИУслуги.НайтиСтроки(СтПоискаПФНаЭтапе) Цикл
				Вход = Входы.Добавить();
				Вход.Идентификатор = ИдентификаторВыпускаНаЭтапе;
				Вход.Этап = Строка.Этап;
				Вход.СтрокаРС = Строка;
				Вход.Номенклатура = Строка.Номенклатура;
				Вход.Характеристика = Строка.Характеристика;
				Вход.КодЭтапа = ДанныеСпецификации.Этапы.Найти(Строка.Этап, "Этап").КодЭтапа;
				Вход.ДанныеСпецификации = ДанныеСпецификации;

				СтПоискаНХЭтап.Номенклатура = Строка.Номенклатура;
				СтПоискаНХЭтап.Характеристика = Строка.Характеристика;
				СтПоискаНХЭтап.Этап = Строка.ИсточникПолученияПолуфабриката;

				Для каждого СтрокаВыход Из ДанныеСпецификации.ВозвратныеОтходы.НайтиСтроки(СтПоискаНХЭтап) Цикл
					Выход = Выходы.Добавить();
					Выход.Идентификатор = ИдентификаторВыпускаНаЭтапе;
					Выход.Этап = Строка.Этап;
					Выход.СтрокаРС = СтрокаВыход;
					Выход.СтрокаРСИмяВладельца = "ВозвратныеОтходы";
					Выход.Номенклатура = СтрокаВыход.Номенклатура;
					Выход.Характеристика = СтрокаВыход.Характеристика;
					Выход.ДанныеСпецификации = ДанныеСпецификации;
					Выход.Потребность = Потребность;
				КонецЦикла;

				ИдентификаторВыпускаНаЭтапе = ИдентификаторВыпускаНаЭтапе + 1;
			КонецЦикла;

			Для каждого Строка Из МатериалыУдалить Цикл
				ДанныеСпецификации.МатериалыИУслуги.Удалить(Строка);
			КонецЦикла; 
			#Вставка
			//++ Гурьев 13.09.23 Перенос комментария к заказу в этапы
			ДанныеСпецификации.Вставить("КАНАТ_КомментарийКЗаказу", Потребность.КАНАТ_КомментарийКЗаказу);
			ДанныеСпецификации.Вставить("КАНАТ_Сертификат", Потребность.КАНАТ_Сертификат);
			//-- Гурьев 13.09.23

			#КонецВставки

			Результат.Добавить(ДанныеСпецификации);
		КонецЦикла;
	КонецЦикла;

	// Построение связей
	Входы.Сортировать("Идентификатор, Этап, Номенклатура, Характеристика", Новый СравнениеЗначений());
	Выходы.Сортировать("Идентификатор, Этап, Номенклатура, Характеристика", Новый СравнениеЗначений());
	ИндВыход = 0;
	ИндВыходМакс = Выходы.Количество()-1;

	Для ИндВход = 0 По Входы.Количество()-1 Цикл
		Вход = Входы[ИндВход];
		Остаток = Вход.СтрокаРС.Количество;
		ИндВыход = ?(ИндВыход <= ИндВыходМакс, ИндВыход, 0);
		Пока ИндВыход <= ИндВыходМакс Цикл
			Выход = Выходы[ИндВыход];

			Если Выход.СтрокаРС.Распределено = Выход.СтрокаРС.Количество
				ИЛИ Выход.СтрокаРС.Количество = 0
				ИЛИ Выход.Идентификатор <> Вход.Идентификатор
				ИЛИ Выход.Этап <> Вход.Этап
				ИЛИ Выход.Номенклатура <> Вход.Номенклатура
				ИЛИ Выход.Характеристика <> Вход.Характеристика
				И ЗначениеЗаполнено(Выход.Характеристика) Тогда
				ИндВыход = ИндВыход + 1;
				Продолжить;
			КонецЕсли;

			Если Не Выход.Потребность.ПланироватьНеРанее.Пустая() Тогда // Привязка к этапу ПланироватьНеРанее
				Выход.ДанныеСпецификации.ПланироватьНеРанееКодЭтапа =
				Вход.ДанныеСпецификации.Этапы.Найти(Выход.Потребность.ПланироватьНеРанее, "Этап").КодЭтапа;
			КонецЕсли;

			Если Выход.СтрокаРС.Распределено <> 0 
				ИЛИ Выход.СтрокаРС.Количество > Остаток Тогда
				СтрокаВыход = Выход.СтрокаРС.Владелец().Вставить(0);
				ЗаполнитьЗначенияСвойств(СтрокаВыход, Выход.СтрокаРС);
				СтрокаВыход.Количество = Мин((Выход.СтрокаРС.Количество-Выход.СтрокаРС.Распределено), Остаток);
				СтрокаВыход.КоличествоУпаковок = СтрокаВыход.Количество * СтрокаВыход.ДанныеУпаковки.Знаменатель / СтрокаВыход.ДанныеУпаковки.Числитель;

				Выход.СтрокаРС.Количество = Выход.СтрокаРС.Количество - СтрокаВыход.Количество;
				Выход.СтрокаРС.КоличествоУпаковок = Выход.СтрокаРС.Количество * Выход.СтрокаРС.ДанныеУпаковки.Знаменатель / Выход.СтрокаРС.ДанныеУпаковки.Числитель;

				Если Выход.СтрокаРСИмяВладельца = "ВыходныеИзделия" Тогда
					ПроизводствоКлиентСервер.ПересчитатьДолюСтоимостиПриРазбиенииСтроки(
					СтрокаВыход, Выход.СтрокаРС, ДанныеСпецификации.СпособРаспределенияЗатратНаВыходныеИзделия);
				КонецЕсли;

				// Контроль соблюдения правил округления
				Если Выход.СтрокаРС.Округлить
					И Окр(Выход.СтрокаРС.Количество) <> Выход.СтрокаРС.Количество Тогда

					Если Выход.СтрокаРС.Распределено = 0 Тогда
						Выход.СтрокаРС.Получатель = Вход.СтрокаРС.Склад;
						Выход.СтрокаРС.Округлить = Ложь;
					ИначеЕсли Выход.СтрокаРС.Количество > Выход.СтрокаРС.Распределено Тогда
						НоваяСтрока = Выход.СтрокаРС.Владелец().Вставить(0);
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Выход.СтрокаРС);
						НоваяСтрока.Количество = Выход.СтрокаРС.Количество - Выход.СтрокаРС.Распределено;
						НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество * НоваяСтрока.ДанныеУпаковки.Знаменатель / НоваяСтрока.ДанныеУпаковки.Числитель;
						НоваяСтрока.Распределено = 0;
						НоваяСтрока.Получатель = Вход.СтрокаРС.Склад;
						НоваяСтрока.Округлить = Ложь;

						Выход.СтрокаРС.Количество = Выход.СтрокаРС.Распределено;
						Выход.СтрокаРС.КоличествоУпаковок = Выход.СтрокаРС.Количество * Выход.СтрокаРС.ДанныеУпаковки.Знаменатель / Выход.СтрокаРС.ДанныеУпаковки.Числитель;

						Если Выход.СтрокаРСИмяВладельца = "ВыходныеИзделия" Тогда
							ПроизводствоКлиентСервер.ПересчитатьДолюСтоимостиПриРазбиенииСтроки(
							НоваяСтрока, Выход.СтрокаРС, ДанныеСпецификации.СпособРаспределенияЗатратНаВыходныеИзделия);
						КонецЕсли;
					КонецЕсли;	
				КонецЕсли;
			Иначе
				СтрокаВыход = Выход.СтрокаРС;
				ИндВыход = ИндВыход + 1;
			КонецЕсли;

			СтрокаВыход.Получатель = ?(Вход.СтрокаРС.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Работа,
			Вход.СтрокаРС.ПодразделениеЭтапа,
			Вход.СтрокаРС.Склад);
			СтрокаВыход.КодЭтапаПолучателя = Вход.КодЭтапа;
			СтрокаВыход.Распределено = СтрокаВыход.Количество;

			Если Выход.СтрокаРС.ЛюбаяХарактеристика
				И Не ЗначениеЗаполнено(Выход.Характеристика) Тогда
				СтрокаВыход.Характеристика = Вход.СтрокаРС.Характеристика;
			КонецЕсли;

			Остаток = Остаток - СтрокаВыход.Количество;
			Если Остаток = 0 Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

	Возврат Результат;

КонецФункции
