
&НаСервере
Процедура КАНАТ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//++ Гурьев 27.09.23 ЧТЗ_К1_v3.2
	//++ Бит Трейгер П.М, 22.11.2024 Замечание. Вывод соощения при копировании НТД Номенклатуры
	//добавляемыеРеквизиты = Новый Массив;
	//НовыйРеквизит = Новый РеквизитФормы("КАНАТ_ОБъектБылИзменен",Новый ОписаниеТипов("Булево")); 
	//ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);	
	//ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	Объект.КАНАТ_ОБъектБылИзменен = ложь;
	Сообщить("йцу");
	//-- Бит Трейгер П.М, 22.11.2024 Замечание. Вывод соощения при копировании НТД Номенклатуры
	//Группа НТД
	ГруппаНТД = Элементы.Добавить(
		"КАНАТ_ГруппаНТД",
		Тип("ГруппаФормы"),
		Элементы.ГруппаРеквизиты);
	ГруппаНТД.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаНТД.Заголовок = "НТД";
	ГруппаНТД.Поведение = ПоведениеОбычнойГруппы.Свертываемая;
	ГруппаНТД.ОтображатьОтступСлева = Истина;
	ГруппаНТД.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.Картинка;
	ГруппаНТД.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаНТД.Скрыть();
	
	
	//Вид для контроля качества
	НТДНоменклатуры = Элементы.Добавить("КАНАТКач_ВидДляКонтроляКачества", Тип("ПолеФормы"), Элементы.КАНАТ_ГруппаНТД); 
	НТДНоменклатуры.Заголовок = "Вид для контроля качества"; 
	НТДНоменклатуры.ПутьКДанным = "Объект.КАНАТКач_ВидДляКонтроляКачества";
	НТДНоменклатуры.Вид = ВидПоляФормы.ПолеВвода;

	
	//НТД номенклатуры
	НТДНоменклатуры = Элементы.Добавить("КАНАТ_НТДНоменклатуры", Тип("ПолеФормы"), Элементы.КАНАТ_ГруппаНТД); 
	НТДНоменклатуры.Заголовок = "НТД Номенклатуры"; 
	НТДНоменклатуры.ПутьКДанным = "Объект.КАНАТ_НТДНоменклатуры";
	НТДНоменклатуры.Вид = ВидПоляФормы.ПолеВвода;
	
	//Таблица НТД
	ТаблицаНТД = Элементы.Добавить("КАНАТ_ТаблицаНТД", Тип("ТаблицаФормы"), ГруппаНТД);
	ТаблицаНТД.ПутьКДанным = "Объект.КАНАТ_ПоказателиНТД"; 
	
	НоваяКолонка = Элементы.Добавить("КАНАТ_ТаблицаНТДПоказатель", Тип("ПолеФормы"), ТаблицаНТД);
	НоваяКолонка.Заголовок = "Показатель"; 
	НоваяКолонка.ПутьКДанным = "Объект.КАНАТ_ПоказателиНТД.Показатель";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	
	НоваяКолонка = Элементы.Добавить("КАНАТ_ТаблицаНТДРазмерность", Тип("ПолеФормы"), ТаблицаНТД);
	НоваяКолонка.Заголовок = "Размерность"; 
	НоваяКолонка.ПутьКДанным = "Объект.КАНАТ_ПоказателиНТД.Размерность";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	
	НоваяКолонка = Элементы.Добавить("КАНАТ_ТаблицаНТДЗначение", Тип("ПолеФормы"), ТаблицаНТД);
	НоваяКолонка.Заголовок = "Значение"; 
	НоваяКолонка.ПутьКДанным = "Объект.КАНАТ_ПоказателиНТД.Значение";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	
	НоваяКолонка = Элементы.Добавить("КАНАТ_ТаблицаНТДОтклонение", Тип("ПолеФормы"), ТаблицаНТД);
	НоваяКолонка.Заголовок = "Отклонение"; 
	НоваяКолонка.ПутьКДанным = "Объект.КАНАТ_ПоказателиНТД.Отклонение";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	
	//Кнопка для заполнения показателей НТД из другой номенклатуры
	КомандаСкопироватьНТД = ЭтаФорма.Команды.Добавить("КомандаЗаполнитьПоказателиНТД");
	КомандаСкопироватьНТД.Действие = "КАНАТ_ВыбратьНоменклатуруПоказателиНТД";
	КомандаСкопироватьНТД.Заголовок = "Заполнить";
	КомандаСкопироватьНТД.Подсказка = "Заполнить показатели НТД копированием из другой номенклатуры";
	
	КнопкаСкопироватьНТД = Элементы.Добавить("КнопкаЗаполнитьПоказателиНТД", Тип("КнопкаФормы"), ГруппаНТД);
	КнопкаСкопироватьНТД.ИмяКоманды = "КомандаЗаполнитьПоказателиНТД";
	//-- Гурьев 27.09.23 ЧТЗ_К1_v3.2
	
	//++БИТ_Гурьев_Задача_54_05.02.24
	КомандаЗаписатьИЗакрыть = ЭтаФорма.Команды.Добавить("КАНАТ_ЗаписатьИЗакрыть");
	КомандаЗаписатьИЗакрыть.Действие = "КАНАТ_ЗаписатьИЗакрыть";
	КомандаЗаписатьИЗакрыть.Заголовок = "Записать и закрыть";
	
	КомандаЗаписать = ЭтаФорма.Команды.Добавить("КАНАТ_Записать");
	КомандаЗаписать.Действие = "КАНАТ_Записать";
	КомандаЗаписать.Заголовок = "Записать";
	
	Элементы.ФормаЗаписатьИЗакрыть.ИмяКоманды = "КАНАТ_ЗаписатьИЗакрыть";
	Элементы.ФормаЗаписать.ИмяКоманды         = "КАНАТ_Записать";
	//--БИТ_Гурьев_Задача_54_05.02.24
КонецПроцедуры

//++ Гурьев 28.09.23 ЧТЗ_К1_v3.2
&НаКлиенте
Процедура КАНАТ_ВыбратьНоменклатуруПоказателиНТД(Команда)
	
	//ПараметрыФормы = Новый Структура;
	//ПараметрыФормы.Вставить("РежимВыбора", Истина);
	//ПараметрыФормы.Вставить("ЗаполнениеПоказателейНТД", Истина);
	//++Бит Трейгер П.М, 14.11.2024  Ошибка кнопки "Заполнить" в номенклатуре НТД
	ОписаниеОповещения = Новый ОписаниеОповещения("КАНАТ_ПриЗаполненииНТДКлиентская", ЭтотОбъект);
	//--Бит Трейгер П.М, 14.11.2024  Ошибка кнопки "Заполнить" в номенклатуре НТД
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора",,ЭтаФорма,,,,ОписаниеОповещения);
	
КонецПроцедуры
//-- Гурьев 28.09.23 ЧТЗ_К1_v3.2

//++ Гурьев 28.09.23 ЧТЗ_К1_v3.2
&НаСервере
Процедура КАНАТ_ПриЗаполненииНТД(Ссылка, ДопПараметры) экспорт// Экспорт
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Объект.КАНАТ_ПоказателиНТД.Загрузить(Ссылка.КАНАТ_ПоказателиНТД.Выгрузить());
		//++ Бит Трейгер П.М, 22.11.2024 Замечание. Вывод соощения при копировании НТД Номенклатуры
		Объект.КАНАТ_ОБъектБылИзменен = Истина;
		//-- Бит Трейгер П.М, 22.11.2024 Замечание. Вывод соощения при копировании НТД Номенклатуры
	КонецЕсли;
	
КонецПроцедуры
//-- Гурьев 28.09.23 ЧТЗ_К1_v3.2

//++Бит Трейгер П.М, 14.11.2024  Ошибка кнопки "Заполнить" в номенклатуре НТД
&НаКлиенте
процедура КАНАТ_ПриЗаполненииНТДКлиентская(Ссылка, ДопПараметры) Экспорт
КАНАТ_ПриЗаполненииНТД(Ссылка, ДопПараметры);	
КонецПроцедуры
//--Бит Трейгер П.М, 14.11.2024  Ошибка кнопки "Заполнить" в номенклатуре НТД


//&НаКлиенте
//Процедура КАНАТ_ПередЗаписьюПосле(Отказ, ПараметрыЗаписи)
//	//++БИТ_Гурьев_Задача_54_05.02.24
//	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
//		Если КАНАТ_СовпадениеАртикула() Тогда
//			Ответ = Вопрос("В системе уже существует такой артикул. Все равно записать?", РежимДиалогаВопрос.ДаНет);
//			Если Ответ = КодВозвратаДиалога.Да Тогда
//				
//				Отказ = Истина;
//				
//			КонецЕсли;
//		КонецЕсли;
//	КонецЕсли;
//	//--БИТ_Гурьев_Задача_54_05.02.24
//КонецПроцедуры

//++БИТ_Гурьев_Задача_54_05.02.24
&НаСервере
Функция КАНАТ_СовпадениеАртикула()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Артикул = &Артикул
		|	И Номенклатура.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Артикул", Объект.Артикул);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой() И ЗначениеЗаполнено(Объект.Артикул);
	
КонецФункции
//--БИТ_Гурьев_Задача_54_05.02.24

//++БИТ_Гурьев_Задача_54_05.02.24
&НаКлиенте
Процедура КАНАТ_ЗаписатьИЗакрыть(Команда)
	Если ЗначениеЗаполнено(Объект.Ссылка) И КАНАТ_СовпадениеАртикула() Тогда
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Закрыть", Истина);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("КАНАТ_ЗаписатьПослеОтвета",ЭтотОбъект, ДополнительныеПараметры);
		
		ПоказатьВопрос(ОписаниеОповещения, 
					   "В системе уже существует такой артикул. Все равно записать?", 
						РежимДиалогаВопрос.ДаНет,
						,
						КодВозвратаДиалога.Да);
	Иначе
		
		ОбщегоНазначенияУТКлиент.ЗаписатьИЗакрыть(ЭтотОбъект);
		
	КонецЕсли;
КонецПроцедуры
//--БИТ_Гурьев_Задача_54_05.02.24

//++БИТ_Гурьев_Задача_54_05.02.24
&НаКлиенте
Процедура КАНАТ_Записать(Команда)
	Если ЗначениеЗаполнено(Объект.Ссылка) И КАНАТ_СовпадениеАртикула() Тогда
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Закрыть", Ложь);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("КАНАТ_ЗаписатьПослеОтвета",ЭтотОбъект, ДополнительныеПараметры);
		
		ПоказатьВопрос(ОписаниеОповещения, 
					   "В системе уже существует такой артикул. Все равно записать?", 
						РежимДиалогаВопрос.ДаНет,
						,
						КодВозвратаДиалога.Да);
	Иначе
		
		ОбщегоНазначенияУТКлиент.Записать(ЭтотОбъект);
		
	КонецЕсли;
КонецПроцедуры
//--БИТ_Гурьев_Задача_54_05.02.24

//++БИТ_Гурьев_Задача_54_05.02.24
&НаКлиенте 
Процедура КАНАТ_ЗаписатьПослеОтвета(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Если ДополнительныеПараметры.Закрыть Тогда
			ОбщегоНазначенияУТКлиент.ЗаписатьИЗакрыть(ЭтотОбъект);
		Иначе
			ОбщегоНазначенияУТКлиент.Записать(ЭтотОбъект);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
&ИзменениеИКонтроль("ПослеЗаписи")
Процедура КАНАТ_ПослеЗаписи(ПараметрыЗаписи)

	Оповестить("Запись_Номенклатура", ПараметрыЗаписи, Объект.Ссылка);

	Если ЗначениеЗаполнено(Штрихкод) Тогда

		ТекстВопроса =НСтр("ru = 'Зарегистрировать штрихкод?';
		|en = 'Register barcode?'");

		Оповещение = Новый ОписаниеОповещения("ЗарегистрироватьШтрихкодЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, НСтр("ru = 'Регистрация штрихкода';
		|en = 'Barcode registration'"));
	КонецЕсли;

	СобытияФормКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи);

	МодификацияКонфигурацииКлиентПереопределяемый.ПослеЗаписи(ЭтаФорма, ПараметрыЗаписи);

	ПослеЗаписиЛокализация(ПараметрыЗаписи);

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	#Вставка 
	Если Объект.КАНАТ_ТекстДублиАртикулов <> "" Тогда//Значит при записи были обнаружены дубли артикулов
		Оповещение = Новый ОписаниеОповещения("КонецПроверкиДублейАртикулов",ЭтотОбъект);
		
		ПоказатьВопрос(Оповещение,
			Объект.КАНАТ_ТекстДублиАртикулов,
			РежимДиалогаВопрос.ДаНет,
			0, // таймаут в секундах
			КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
			"Значение данного артикула не уникально" // (необ.) заголовок
			); 
	КонецЕсли;
	#КонецВставки
	
КонецПроцедуры
//--БИТ_Гурьев_Задача_54_05.02.24 

// <+БИТ> Руденков_Е.И. 26.02.2024 
// #000000054, ЧТЗ_3_8 Артикул=код
&НаКлиенте
Процедура КонецПроверкиДублейАртикулов(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда//Записать дубль артикула
		Объект.КАНАТ_ТекстДублиАртикулов	= "";
		ЭтотОбъект.Записать();
	Иначе//Записать очистив артикул
		Объект.КАНАТ_ТекстДублиАртикулов	= "";
		Объект.Артикул						= "";
		Объект.КАНАТ_НеГенерироватьАртикул	= Истина;
		ЭтотОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры // <-БИТ> Руденков_Е.И. 26.02.2024

//++ Бит Трейгер П.М, 22.11.2024 Замечание. Вывод соощения при копировании НТД Номенклатуры
//&НаКлиенте
//Процедура КАНАТ_ПередЗакрытиемПосле(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
// //   Если  Объект.КАНАТ_ОБъектБылИзменен Тогда
// //   Оповещение = Новый ОписаниеОповещения("ПослеВыбора",
// //     ЭтотОбъект);	
// //
// //   ПоказатьВопрос(Оповещение,
// //       "Данные были изменены. Сохранить изменения?",
// //       РежимДиалогаВопрос.ДаНетОтмена,
// //       600, // таймаут в секундах
// //       КодВозвратаДиалога.Отмена, // (необ.) кнопка по умолчанию
// //   );
// //   конецЕсли;
//   Если  Объект.КАНАТ_ОБъектБылИзменен Тогда
//	Отказ = истина;
//   ПередЗакрытиемАсинх();
//  конецЕсли;
//КонецПроцедуры

&НаКлиенте
Асинх Процедура ПередЗакрытиемАсинх()

 оповещение = ВопросАсинх("Данные были изменены. Сохранить изменения?", РежимДиалогаВопрос.ДаНетОтмена,60 ,КодВозвратаДиалога.Отмена);
 Результат = Ждать оповещение;
    Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.КАНАТ_ОБъектБылИзменен = ложь;
        Записать();
	    ЭтаФорма.Закрыть();	
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
	Объект.КАНАТ_ОБъектБылИзменен = ложь;	
	ЭтаФорма.Закрыть();	
	ИначеЕсли Результат = КодВозвратаДиалога.Отмена Тогда	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КАНАТ_ПередЗакрытиемПеред(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
Если Объект.КАНАТ_ОБъектБылИзменен Тогда
Отказ = истина;
ПередЗакрытиемАсинх();
конецЕсли;
КонецПроцедуры


 
//&НаКлиенте
//Процедура ПослеВыбора(Результат, Параметры) Экспорт
// 
//	Если Результат = КодВозвратаДиалога.Да Тогда
//		 Объект.КАНАТ_ОБъектБылИзменен = ложь;
//        Записать();
//	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
//		ЭтаФорма.Закрыть();
//	ИначеЕсли Результат = КодВозвратаДиалога.Отмена Тогда
//		Возврат;
//    КонецЕсли;	
// 
//КонецПроцедуры
 //-- Бит Трейгер П.М, 22.11.2024 Замечание. Вывод соощения при копировании НТД Номенклатуры