
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Период.ДатаНачала = НачалоДня(ТекущаяДата());
	Период.ДатаОкончания = КонецДня(ТекущаяДата()); 
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	ТабДок = ПечатьНаСервере();
	
	Идентификатор = "ОтчетНитиSisolСДатами";
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(Идентификатор);
	
	КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабДок;
	КоллекцияПечатныхФорм[0].Экземпляров = 1;
	КоллекцияПечатныхФорм[0].СинонимМакета = "Отчет по нитям ПП с экструзионной линии ф. Sisal с датами";
	
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,Неопределено,ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция ПечатьНаСервере()
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.КАНАТКач_ОтчетНитиSisolСДатами.ПФ_MXL_ОтчетНитиSisol");
	
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	ОбластьШапка.Параметры.Дата = Период;
	ОбластьШапка.Параметры.Цех = Цех;
	ТабДок.Вывести(ОбластьШапка);
	
	ОбластьТаблицаШапка = Макет.ПолучитьОбласть("ОбластьТаблицаШапка");
	ТабДок.Вывести(ОбластьТаблицаШапка);
	
	ВыборкаДата = Обработки.КАНАТКач_ОтчетНитиSisolСДатами.ДанныеДляОтчета(Период, Цех);
	Пока ВыборкаДата.Следующий() Цикл
		
		ДатаВыведена = Ложь;
		ВыборкаДокумент = ВыборкаДата.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаДокумент.Следующий() Цикл
	
			ОбластьТаблицаСтрока = Макет.ПолучитьОбласть("ОбластьТаблицаСтрока");
			ОбластьТаблицаСтрока.Параметры.Заполнить(ВыборкаДокумент);
			
			Если Не ДатаВыведена Тогда
				
				ДатаВыведена = Истина;
				
			Иначе
				
				ОбластьТаблицаСтрока.Параметры.Дата = Неопределено;
				
			КонецЕсли;
			
			ВыборкаДетальныеЗаписи = ВыборкаДокумент.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПараметрОтчетов) Тогда
					
					ОбластьТаблицаСтрока.Параметры[ПолучитьИмяПеречисления(ВыборкаДетальныеЗаписи.ПараметрОтчетов)] = ВыборкаДетальныеЗаписи.Факт;
					
				КонецЕсли;
				
			КонецЦикла;
			
			ТабДок.Вывести(ОбластьТаблицаСтрока);
			
		КонецЦикла;
		
	КонецЦикла;
	
	ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодвал");
	ТабДок.Вывести(ОбластьПодвал);
	
	Возврат ТабДок;
	
КонецФункции

&НаСервере
Функция ПолучитьИмяПеречисления(Знач ПеречислениеСсылка)
	ИмяМетаданных = ПеречислениеСсылка.Метаданные().Имя;
	НазваниеМенеджера = "ПеречислениеМенеджер." + ИмяМетаданных;
	Менеджер = Новый (НазваниеМенеджера); 
	Имя = ПеречислениеСсылка.Метаданные().ЗначенияПеречисления[Менеджер.Индекс(ПеречислениеСсылка)].Имя;
	Возврат Имя;  
КонецФункции
