
&ИзменениеИКонтроль("ПередЗаписьюНаСервереГосударственногоКонтракта")
Процедура КАНАТ_ПередЗаписьюНаСервереГосударственногоКонтракта(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи)
    #Удаление
	Если ТекущийОбъект.ТипНаправленияДеятельности = Перечисления.ТипыНаправленийДеятельности.КонтрактГОЗ Тогда
		Если НЕ ЗначениеЗаполнено(ТекущийОбъект.НомерГОЗ) Тогда
			ТекстСообщения = НСтр("ru = 'Не заполнен Номер ГОЗ';
			|en = 'SDO number is not filled'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
	КонецЕсли;	
    #КонецУдаления
	ПроверкаНоменклатурыНаДубли = Новый Соответствие();
	// Проверим корректность заполнения номенклатуры
	Для Каждого СтрокаНоменклатура Из ТекущийОбъект.НоменклатураОбъектовЗакупки Цикл

		Отбор = Новый Структура("Идентификатор", СтрокаНоменклатура.Идентификатор);
		СтрокиГосконтракта = ТекущийОбъект.ОбъектыЗакупки.НайтиСтроки(
		Отбор);

		Если СтрокиГосконтракта.Количество() > 0 Тогда
			ЭтоТоварЕИС = (СтрокиГосконтракта[0].Тип = Перечисления.ТипыОбъектовЗакупкиЕИС.Товар);
		Иначе
			Продолжить;
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(СтрокаНоменклатура.Номенклатура) Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
			"Колонка", "Заполнение", НСтр("ru = 'Номенклатура';
			|en = 'Item'"),
			СтрокиГосконтракта[0].НомерСтроки, НСтр("ru = 'Объекты закупки';
			|en = 'Purchasing objects'"));

			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
			"ОбъектыЗакупки", СтрокиГосконтракта[0].НомерСтроки, "Тип");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , Поле, , Отказ);
			Продолжить;
		КонецЕсли;

		ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
		СтрокаНоменклатура.Номенклатура, "ВидНоменклатуры");
		Если НЕ ЗначениеЗаполнено(ВидНоменклатуры) Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
			"Колонка", "Корректность", НСтр("ru = 'Номенклатура';
			|en = 'Item'"),
			СтрокиГосконтракта[0].НомерСтроки, НСтр("ru = 'Объекты закупки';
			|en = 'Purchasing objects'"),
			НСтр("ru = 'Не указан вид номенклатуры товара.';
			|en = 'The item kind is not specified.'"));

			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
			"ОбъектыЗакупки", СтрокиГосконтракта[0].НомерСтроки, "Тип");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , Поле, , Отказ);
			Продолжить;
		КонецЕсли;

		ТипыНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
		ВидНоменклатуры, "ТипНоменклатуры");
		ЭтоТоварНоменклатура = ТипыНоменклатуры = Перечисления.ТипыНоменклатуры.Товар;

		Если ЭтоТоварЕИС <> ЭтоТоварНоменклатура Тогда

			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
			"Колонка", "Корректность", НСтр("ru = 'Номенклатура';
			|en = 'Item'"),
			СтрокиГосконтракта[0].НомерСтроки, НСтр("ru = 'Объекты закупки';
			|en = 'Purchasing objects'"),
			НСтр("ru = 'Тип номенклатуры не соответствует типу объекта закупки';
			|en = 'The item type does not match the purchasing object type'"));

			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
			"ОбъектыЗакупки", СтрокиГосконтракта[0].НомерСтроки, "Тип");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , Поле, , Отказ);

		КонецЕсли;

		Если НЕ ЭтоТоварЕИС Тогда
			Продолжить;
		КонецЕсли;

		ИдентификаторСтроки = ПроверкаНоменклатурыНаДубли.Получить(СтрокаНоменклатура.Номенклатура);

		Если ИдентификаторСтроки = Неопределено Тогда

			ПроверкаНоменклатурыНаДубли.Вставить(СтрокаНоменклатура.Номенклатура, СтрокаНоменклатура.Идентификатор);

		КонецЕсли;
	КонецЦикла;

	// Проверим, что все данные для актирования заполнены
	НоменклатураЗаполнена      = Истина;

	Для Каждого СтрокаГосконтракта Из ТекущийОбъект.ОбъектыЗакупки Цикл

		ЭтоТоварЕИС = (СтрокаГосконтракта.Тип = Перечисления.ТипыОбъектовЗакупкиЕИС.Товар);

		Если ЭтоТоварЕИС Тогда
			Отбор = Новый Структура("Идентификатор", СтрокаГосконтракта.Идентификатор);
			СтрокиНоменклатуры = ТекущийОбъект.НоменклатураОбъектовЗакупки.НайтиСтроки(Отбор);
			Если СтрокиНоменклатуры.Количество() = 0 Тогда
				НоменклатураЗаполнена = Ложь;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	ТекущийОбъект.ГотовДляОтраженияВУчете = НоменклатураЗаполнена;

КонецПроцедуры
