
&НаСервере
Процедура КАНАТ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//++ Гурьев 01.09.23 Гурьев Вывод реквизита "Комментарий к заказу"
	КомментарийКЗаказу = Элементы.Добавить("КАНАТ_КомментарийКЗаказу", Тип("ПолеФормы"), Элементы.ГруппаОсновное); 
	КомментарийКЗаказу.Заголовок = "Комментарий к заказу"; 
	КомментарийКЗаказу.ПутьКДанным = "Объект.КАНАТ_КомментарийКЗаказу";
	КомментарийКЗаказу.Вид = ВидПоляФормы.ПолеВвода; 
	
	Элементы.Переместить(КомментарийКЗаказу, Элементы.ГруппаОсновное, Элементы.Подразделение);
	
	КомментарийКЗаказу = Элементы.Добавить("КАНАТ_Сертификат", Тип("ПолеФормы"), Элементы.ГруппаОсновное); 
	КомментарийКЗаказу.Заголовок = "Сертификат"; 
	КомментарийКЗаказу.ПутьКДанным = "Объект.КАНАТ_Сертификат";
	КомментарийКЗаказу.Вид = ВидПоляФормы.ПолеВвода; 
	
	Элементы.Переместить(КомментарийКЗаказу, Элементы.ГруппаОсновное, Элементы.Подразделение);
	//-- Гурьев 01.09.23
КонецПроцедуры
