//++ Гурьев 18.09.23
Функция КАНАТ_ПолучитьНомерПоШаблону(Ссылка, Контрагент) Экспорт
	
	ДанныеКонтрагента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Контрагент, "ИНН, Партнер");
	Код = ?(Не ДанныеКонтрагента.Партнер.Пустая(),
			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеКонтрагента.Партнер, "Код"),
			" ");
			
	Код = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Код, Истина, Истина);
	Шаблон = СтрШаблон("%1-%2-%3-%4", 
					   Лев(ДанныеКонтрагента.ИНН, 2),
					   Код,
					   Формат(ТекущаяДата(), "ДФ=yyyy"),
					   "%");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(ДоговорыКонтрагентов.Номер) КАК КоличествоНомер
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ГОД(ДоговорыКонтрагентов.Дата) = ГОД(&Дата)
		|	И ДоговорыКонтрагентов.Контрагент = &Контрагент
		|	И ДоговорыКонтрагентов.Ссылка <> &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ 
		|	ДоговорыКонтрагентов.Номер КАК Номер
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Номер ПОДОБНО &Шаблон
		|	И ДоговорыКонтрагентов.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Дата",       ТекущаяДата());
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Шаблон",     Шаблон);
	Запрос.УстановитьПараметр("Ссылка",     Ссылка);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	КоличествоДоговоров = РезультатЗапроса[0].Выгрузить()[0].КоличествоНомер;
	Если РезультатЗапроса[1].Пустой() Тогда
		
		Номер = СтрШаблон("%1-%2-%3-%4", 
					   Лев(ДанныеКонтрагента.ИНН, 2),
					   Код,
					   Формат(ТекущаяДата(), "ДФ=yyyy"),
					   КоличествоДоговоров + 1);
		
		Возврат СтрЗаменить(Номер, " ", "");
		
	Иначе
		
		Выборка = РезультатЗапроса[1].Выбрать();
		
		
		МаксПорядковыйНомер = -1;
		Пока Выборка.Следующий() Цикл
			
			СтрокаНомера = Выборка.Номер;
			ПорядковыйНомерСтр = Прав(СтрокаНомера,
									  СтрДлина(СтрокаНомера) - (СтрДлина(Шаблон)-1));
			
			Попытка
				
				ПорядковыйНомер = Число(ПорядковыйНомерСтр);
				Если ПорядковыйНомер > МаксПорядковыйНомер Тогда
					МаксПорядковыйНомер = ПорядковыйНомер;
				КонецЕсли;
				
			Исключение
				
				Продолжить;
				
			КонецПопытки;
		КонецЦикла;
		
		ИтоговыйПорядковыйНомер = ?(КоличествоДоговоров > МаксПорядковыйНомер,
									КоличествоДоговоров + 1,
									МаксПорядковыйНомер + 1);
		
		Номер = СтрШаблон("%1-%2-%3-%4", 
					   Лев(ДанныеКонтрагента.ИНН, 2),
					   Код,
					   Формат(ТекущаяДата(), "ДФ=yyyy"),
					   ИтоговыйПорядковыйНомер);
					   
		Возврат СтрЗаменить(Номер, " ", "");
		
	КонецЕсли;
	
КонецФункции
//-- Гурьев 18.09.23