
&После("ОбработкаЗаполнения")
Процедура КАНАТ_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//++ Гурьев 08.09.23
	УстановитьПривилегированныйРежим(Истина);
	БанковскийСчет = Константы.КАНАТ_ОсновнойСчетОрганизации.Получить();
	УстановитьПривилегированныйРежим(Ложь);
	//-- Гурьев 08.09.23
КонецПроцедуры

&После("ПередЗаписью")
Процедура КАНАТ_ПередЗаписью(Отказ)
	//++ Гурьев 18.09.23 ЧТЗ_2.15
	Если ПустаяСтрока(Номер) И Не Контрагент.Пустая() Тогда
		
		Номер = Справочники.ДоговорыКонтрагентов.КАНАТ_ПолучитьНомерПоШаблону(Ссылка, Контрагент);
		
	КонецЕсли;
	//-- Гурьев 18.09.23 ЧТЗ_2.15
	
	//++ Гурьев 25.10.23 ЧТЗ_2.15
	Наименование = СтрШаблон("Договор № %1 от %2",Номер, Формат(Дата,"ДФ=dd.MM.yyyy"));
	НаименованиеДляПечати = СтрШаблон("Договор № %1 от %2", Номер, Формат(Дата,"ДФ=dd.MM.yyyy"));
	//-- Гурьев 25.10.23 ЧТЗ_2.15

КонецПроцедуры

&После("ПриКопировании")
Процедура КАНАТ_ПриКопировании(ОбъектКопирования)
	//++ Гурьев 25.10.23 ЧТЗ_2.15
	Номер = ОбъектКопирования.Номер + " копия";
	//-- Гурьев 25.10.23 ЧТЗ_2.15
КонецПроцедуры
