
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИзменитьДоступностьЭлементов();
	
КонецПроцедуры


&НаСервере
Процедура ИзменитьДоступностьЭлементов()
	
	Если ИспользоватьГосконтракт Тогда
		Элементы.Госконтракт.Доступность = Истина;
	Иначе
		Госконтракт = Перечисления.ТипыНаправленийДеятельности.ПустаяСсылка();
		Элементы.Госконтракт.Доступность = Ложь;
	КонецЕсли;
	
	Если ИспользоватьПлательщик Тогда
		Элементы.Плательщик.Доступность = Истина;
	Иначе
		Плательщик = Справочники.Контрагенты.ПустаяСсылка();
		Элементы.Плательщик.Доступность = Ложь;
	КонецЕсли;
	
	Если ИспользоватьПериод Тогда
		Элементы.Период.Доступность = Истина;
	Иначе
		Период.ДатаНачала= Дата("00010101");
		Период.ДатаОкончания = ТекущаяДата();
		Элементы.Период.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПериодПриИзменении(Элемент)
	ИзменитьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПлательщикПриИзменении(Элемент)
	ИзменитьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьГосконтрактПриИзменении(Элемент)
	ИзменитьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	ТабличныйДокумент = СформироватьТабличныйДокумент();
	
	Идентификатор = "ОтчетГособоронзаказПериод";
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(Идентификатор);
	
	КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокумент;
	КоллекцияПечатныхФорм[0].Экземпляров = 1;
	КоллекцияПечатныхФорм[0].СинонимМакета = "Отчет о реализации по гособоронзаказам за период";
	
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,Неопределено,ЭтаФорма);
	
КонецПроцедуры 

&НаСервере
Функция СформироватьТабличныйДокумент()
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.КАНАТ_ОтчетГосконтрактПрокуратура.КАНАТ_ПФ_МакетГосконтрактПрокуратура");
	
	//Шапка
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	
	Организация = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
	ИНН = Организация.ИНН;
	
	ДанныеШапки = Новый Структура;
	//ДанныеШапки.Вставить("Организация", Организация);
	ДанныеШапки.Вставить("ГодНачало", Формат(Период.ДатаНачала, "ДФ=yyyy"));
	ДанныеШапки.Вставить("ГодОкончание", Формат(Период.ДатаОкончания, "ДФ=yyyy"));
	ДанныеШапки.Вставить("ИНН", ИНН);
	
	ОбластьШапка.Параметры.Заполнить(ДанныеШапки);
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	//Таблица
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ОбластьШапкаТаблицы");
	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(ЗаказКлиентаТовары.ДатаОтгрузки) КАК ДатаОтгрузки,
		|	ЗаказКлиентаТовары.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТДатыОтгрузки
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказКлиентаТовары.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СчетНаОплатуКлиенту.ДокументОснование КАК ДокументОснование,
		|	МАКСИМУМ(СчетНаОплатуКлиенту.Дата) КАК Дата
		|ПОМЕСТИТЬ ВТПоследниеСчетаНаОплату
		|ИЗ
		|	Документ.СчетНаОплатуКлиенту КАК СчетНаОплатуКлиенту
		|
		|СГРУППИРОВАТЬ ПО
		|	СчетНаОплатуКлиенту.ДокументОснование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		//БИТ_Гурьев__17.12.24++
		|	Контрагенты.Наименование КАК Организация,
		|	Контрагенты.ИНН КАК ИНН,
		|	СчетФактураВыданный.Представление КАК СчетФактура,
		|	ГосударственныеКонтракты.НомерИГК КАК НомерИГК,
		|	ГосударственныеКонтракты.Номер КАК ГосконтрактНомер,
		|	ГосударственныеКонтракты.ДатаЗаключения КАК ГосконтрактДата,
		|	ДоговорыКонтрагентов.Сумма КАК СуммаДоговора,
		|	СчетНаОплатуКлиенту.Представление КАК СчетНаОплату,
		|	РеализацияТоваровУслуг.Представление КАК РеализацияТоваровУслуг,
		|	ВЫБОР
		|		КОГДА ЗаказКлиентаТаблица.НеОтгружатьЧастями
		|			ТОГДА ЗаказКлиентаТаблица.ДатаОтгрузки
		|		ИНАЧЕ ВТДатыОтгрузки.ДатаОтгрузки
		|	КОНЕЦ КАК СрокИсполнения,
		|	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Сумма КАК ОплатаСумма,
		|	ГосударственныеКонтракты.Наименование КАК ПредметДоговора,
		|	ДоговорыКонтрагентов.Номер КАК ДоговорНомер,
		|	СчетНаОплатуКлиенту.Номер КАК СчетНаОплатуНомер,
		|	СчетНаОплатуКлиенту.Дата КАК СчетНаОплатуДата,
		|	СчетНаОплатуКлиенту.СуммаДокумента КАК СчетНаОплатуСуммаДокумента,
		|	СчетФактураВыданный.Номер КАК СчетФактураВыданныйНомер,
		|	СчетФактураВыданный.Дата КАК СчетФактураВыданныйДата,
		|	РеализацияТоваровУслуг.Номер КАК РеализацияТоваровУслугНомер,
		|	РеализацияТоваровУслуг.Дата КАК РеализацияТоваровУслугДата,
		|	ПоступлениеБезналичныхДенежныхСредств.Дата КАК ОплатаДата,
		|	РеализацияТоваровУслуг.СуммаДокумента КАК СуммаПоУПД
		//БИТ_Гурьев__17.12.24--
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиентаТаблица
		|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуКлиенту КАК СчетНаОплатуКлиенту
		|					ЛЕВОЕ СОЕДИНЕНИЕ ВТПоследниеСчетаНаОплату КАК ВТПоследниеСчетаНаОплату
		|					ПО СчетНаОплатуКлиенту.ДокументОснование = ВТПоследниеСчетаНаОплату.ДокументОснование
		|				ПО ЗаказКлиентаТаблица.Ссылка = СчетНаОплатуКлиенту.ДокументОснование
		|				ЛЕВОЕ СОЕДИНЕНИЕ ВТДатыОтгрузки КАК ВТДатыОтгрузки
		|				ПО ЗаказКлиентаТаблица.Ссылка = ВТДатыОтгрузки.Ссылка
		|			ПО РеализацияТоваровУслуг.ЗаказКлиента = ЗаказКлиентаТаблица.Ссылка
		|		ПО СчетФактураВыданный.ДокументОснование = РеализацияТоваровУслуг.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГосударственныеКонтракты КАК ГосударственныеКонтракты
		|			ПО ДоговорыКонтрагентов.ГосударственныйКонтракт = ГосударственныеКонтракты.Ссылка
					//БИТ_Гурьев__17.12.24++
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
		|			ПО Контрагенты.Ссылка = ДоговорыКонтрагентов.Контрагент
					//БИТ_Гурьев__17.12.24--
		|		ПО СчетФактураВыданный.Договор = ДоговорыКонтрагентов.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеБезналичныхДенежныхСредств КАК ПоступлениеБезналичныхДенежныхСредств
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа
		|			ПО (ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка = ПоступлениеБезналичныхДенежныхСредств.Ссылка)
		|		ПО СчетФактураВыданный.Договор = ПоступлениеБезналичныхДенежныхСредств.Договор
		|			И (ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.НомерСтроки = 1)
		|ГДЕ
		|	ДоговорыКонтрагентов.ДоговорСУчастникомГОЗ = ИСТИНА
		|	И (СчетФактураВыданный.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|			ИЛИ НЕ &ИспользоватьПериод)
		|	И (СчетФактураВыданный.Контрагент = &Плательщик
		|			ИЛИ НЕ &ИспользоватьПлательщик)
		|	И (ГосударственныеКонтракты.Ссылка = &Госконтракт
		|			ИЛИ НЕ &ИспользоватьГосконтракт)
		|	И ВТПоследниеСчетаНаОплату.Дата = СчетНаОплатуКлиенту.Дата
		|	И СчетФактураВыданный.Проведен = ИСТИНА
		|	И СчетФактураВыданный.ПометкаУдаления = ЛОЖЬ
		|	И ДоговорыКонтрагентов.ПометкаУдаления = ЛОЖЬ
		|	И ГосударственныеКонтракты.ПометкаУдаления = ЛОЖЬ
		|ИТОГИ ПО
		|	СчетФактура";
	
	Запрос.УстановитьПараметр("Госконтракт", Госконтракт);
	Запрос.УстановитьПараметр("ИспользоватьГосконтракт", ИспользоватьГосконтракт);
	Запрос.УстановитьПараметр("ИспользоватьПериод", ИспользоватьПериод);
	Запрос.УстановитьПараметр("ИспользоватьПлательщик", ИспользоватьПлательщик);
	Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	Запрос.УстановитьПараметр("Плательщик", Плательщик);
	
	ВыборкаСчетФактура = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Счетчик = 0;
	
	Пока ВыборкаСчетФактура.Следующий() Цикл
		
		Счетчик = Счетчик + 1;
		
		ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("ОбластьСтрокаТаблицы");
		ЗаполнитьОбщиеПоля = Истина;
		
		ДанныеТаблицы = Новый Структура;
		
		Выборка = ВыборкаСчетФактура.Выбрать();
		
		Оплата = "";
		
		Пока Выборка.Следующий() Цикл
			
			Если ЗаполнитьОбщиеПоля Тогда
			
				ДанныеТаблицы.Вставить("ПП", Счетчик);
				ДанныеТаблицы.Вставить("ДанныеГосконтракта", СтрШаблон("%1 от %2 ИГК: %3",
																	   Выборка.ДоговорНомер,
																	   Формат(Выборка.ГосконтрактДата, "ДФ=dd.MM.yy"),
																	   Выборка.НомерИГК));
				ДанныеТаблицы.Вставить("Организация", Выборка.Организация);
				ДанныеТаблицы.Вставить("ИНН", Выборка.ИНН);
				ДанныеТаблицы.Вставить("СуммаДоговораНДС", Формат(Выборка.СуммаДоговора, "ЧДЦ=2"));
				ДанныеТаблицы.Вставить("ПредметДоговора", Выборка.ПредметДоговора);
				ДанныеТаблицы.Вставить("Счета", СтрШаблон("%1 от %2",
														  ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.СчетФактураВыданныйНомер),
														  Формат(Выборка.СчетФактураВыданныйДата,  "ДФ=dd.MM.yy")));
				ДанныеТаблицы.Вставить("Накладная", СтрШаблон("%1 от %2", 
															  ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.РеализацияТоваровУслугНомер),
															  Формат(Выборка.РеализацияТоваровУслугДата,  "ДФ=dd.MM.yy")));
				ДанныеТаблицы.Вставить("Срок", Формат(Выборка.СрокИсполнения, "ДФ=dd.MM.yy"));
				//БИТ_Гурьев__18.12.24++
				ДанныеТаблицы.Вставить("СчетНаОплату", СтрШаблон("%1 от %2", 
																 ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.СчетНаОплатуНомер),
																 Формат(Выборка.СчетНаОплатуДата, "ДФ=dd.MM.yy")));
				ДанныеТаблицы.Вставить("СуммаСчетаНаОплату", Формат(Выборка.СчетНаОплатуСуммаДокумента, "ЧДЦ=2"));
				ДанныеТаблицы.Вставить("СуммаПоУПД", Формат(Выборка.СуммаПоУПД, "ЧДЦ=2"));
				//БИТ_Гурьев__18.12.24--
			
			КонецЕсли;
			
			ЗаполнитьОбщиеПоля = Ложь;
			
			Если Не ПустаяСтрока(Оплата) Тогда
				
				Оплата = Оплата + Символы.ПС;
				
			КонецЕсли;
			
			Оплата = Оплата + СтрШаблон("%1 руб., %2", Формат(Выборка.ОплатаСумма, "ЧДЦ=2"), Формат(Выборка.ОплатаДата, "ДФ=dd.MM.yy"));
			
		КонецЦикла;
		
		ДанныеТаблицы.Вставить("Оплата", Оплата);
		
		ОбластьСтрокаТаблицы.Параметры.Заполнить(ДанныеТаблицы);
		ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);
		
	КонецЦикла;
	
	
	Возврат ТабличныйДокумент;
	
КонецФункции
