
&НаСервере
Процедура КАНАТ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//·++·Гурьев·08.08.23·#2_11_4 Добавление реквизита КАНАТ_ВыводитьВПрайсЛист на форму
	//ГруппаВыводитьВПрайсЛист = Элементы.Добавить(
	//	"КАНАТ_ГруппаВыводитьВПрайсЛист",
	//	Тип("ГруппаФормы"),
	//	Элементы.Основное);
	//	
	//ГруппаВыводитьВПрайсЛист.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	//ГруппаВыводитьВПрайсЛист.Отображение = ОтображениеОбычнойГруппы.Нет;
	//ГруппаВыводитьВПрайсЛист["ОтображатьЗаголовок"] = Ложь; 
	//
	//ПолеВвода = Элементы.Добавить(
	//	"КАНАТ_ВыводитьВПрайсЛист",
	//	Тип("ПолеФормы"), 
	//	ГруппаВыводитьВПрайсЛист);	
	//ПолеВвода.Заголовок = "Выводить в прайс-лист";
	//ПолеВвода.Вид = ВидПоляФормы.ПолеФлажка;
	//ПолеВвода.ПутьКДанным = "Объект.КАНАТ_ВыводитьВПрайсЛист";
	//·--·Гурьев·08.08.23

КонецПроцедуры
