
&НаКлиенте
Процедура СписокПриСменеТекущегоРодителя(Элемент)
	
	Если Элемент.ТекущийРодитель = Неопределено Тогда
		
		Для Счетчик = 1 По 10 Цикл
			
			Элементы["Параметр" + Строка(Счетчик)].Видимость = Истина;
			Элементы["Параметр" + Строка(Счетчик)].Заголовок = "Параметр" + Строка(Счетчик);
			
		КонецЦикла;
		
		Элементы.ПоказыватьСкидки.Видимость = Истина;
		Элементы.ИспользоватьПриПечати.Видимость = Ложь;
		Элементы.ПорядокСортировки.Видимость = Ложь;
		Элементы.Товар.Видимость = Ложь;
		
	Иначе
		
		СтруктураРезультат = ПолучитьПараметрыЭлемента(Элемент.ТекущийРодитель);
			
		Для Счетчик = 1 По 10 Цикл
			
			ИмяПараметра = "Параметр" + Строка(Счетчик);
			
			Если ПустаяСтрока(СтруктураРезультат[ИмяПараметра]) Тогда
				
				Элементы[ИмяПараметра].Видимость = Ложь;
				
			Иначе
				
				Элементы[ИмяПараметра].Видимость = Истина;
				Элементы[ИмяПараметра].Заголовок = СтруктураРезультат[ИмяПараметра];
				
			КонецЕсли;
			
		КонецЦикла;
		
		Элементы.ПоказыватьСкидки.Видимость = Ложь;
		Элементы.ИспользоватьПриПечати.Видимость = Истина;
		Элементы.ПорядокСортировки.Видимость = Истина;
		Элементы.Товар.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПараметрыЭлемента(Ссылка)
	
    Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	КАНАТ_НастройкиПечатиПрайсЛиста.Параметр1 КАК Параметр1,
			|	КАНАТ_НастройкиПечатиПрайсЛиста.Параметр2 КАК Параметр2,
			|	КАНАТ_НастройкиПечатиПрайсЛиста.Параметр3 КАК Параметр3,
			|	КАНАТ_НастройкиПечатиПрайсЛиста.Параметр4 КАК Параметр4,
			|	КАНАТ_НастройкиПечатиПрайсЛиста.Параметр5 КАК Параметр5,
			|	КАНАТ_НастройкиПечатиПрайсЛиста.Параметр6 КАК Параметр6,
			|	КАНАТ_НастройкиПечатиПрайсЛиста.Параметр7 КАК Параметр7,
			|	КАНАТ_НастройкиПечатиПрайсЛиста.Параметр8 КАК Параметр8,
			|	КАНАТ_НастройкиПечатиПрайсЛиста.Параметр9 КАК Параметр9,
			|	КАНАТ_НастройкиПечатиПрайсЛиста.Параметр10 КАК Параметр10
			|ИЗ
			|	Справочник.КАНАТ_НастройкиПечатиПрайсЛиста КАК КАНАТ_НастройкиПечатиПрайсЛиста
			|ГДЕ
			|	КАНАТ_НастройкиПечатиПрайсЛиста.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		СтруктураРезультат = Новый Структура;
		
		ТЗ = Запрос.Выполнить().Выгрузить();
		
		Для Счетчик = 1 По 10 Цикл
			
			ИмяПараметра = "Параметр" + Строка(Счетчик);
			СтрокаПараметры = ТЗ.Получить(0);
			
			СтруктураРезультат.Вставить(ИмяПараметра, СтрокаПараметры[ИмяПараметра]);
			
		КонецЦикла;

		
		Возврат СтруктураРезультат;
	
КонецФункции

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Если Элементы.Список.Отображение <> ОтображениеТаблицы.ИерархическийСписок Тогда
		
		Для Счетчик = 1 По 10 Цикл
			
			Элементы["Параметр" + Строка(Счетчик)].Видимость = Истина;
			Элементы["Параметр" + Строка(Счетчик)].Заголовок = "Параметр" + Строка(Счетчик);
			
		КонецЦикла;
		
		Элементы.ПоказыватьСкидки.Видимость = Истина;
		Элементы.ИспользоватьПриПечати.Видимость = Истина;
		Элементы.ПорядокСортировки.Видимость = Истина;
		Элементы.Товар.Видимость = Истина;
		
	КонецЕсли;
		
КонецПроцедуры
