Функция ПараметрыСтолбцов()
	
	Результат = Новый Массив();
	Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.ЛинейнаяПлотность);
	Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.Диаметр);
	Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.ВиткиНа1м);
	Результат.Добавить(Перечисления.КАНАТКач_ПараметрыОтчетов.РазрывнаяНагрузка);
	
	Возврат Результат;
	
КонецФункции

Функция ДанныеДляОтчета(Период, Цех) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КАНАТ_РезультатИспытаний.Продукция.Код КАК ПродукцияКод,
	               |	КАНАТ_РезультатИспытаний.Продукция.Наименование КАК ПродукцияНаименование,
	               |	КАНАТ_РезультатИспытаний.Цех КАК Цех,
	               |	КАНАТ_РезультатИспытаний.Оборудование КАК Оборудование,
	               |	КАНАТ_РезультатИспытаний.Влажность КАК Влажность,
	               |	КАНАТ_РезультатИспытаний.Результат КАК Результат,
	               |	ВложенныйЗапрос.Факт КАК Факт,
	               |	ВложенныйЗапрос.ПараметрОтчетов КАК ПараметрОтчетов,
	               |	КАНАТ_РезультатИспытаний.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.КАНАТ_РезультатИспытаний КАК КАНАТ_РезультатИспытаний
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			КАНАТ_РезультатИспытанийРезультатИспытаний.Ссылка КАК Ссылка,
	               |			КАНАТ_РезультатИспытанийРезультатИспытаний.Факт КАК Факт,
	               |			КАНАТКач_СоответствиеПоказателейНТДКолонкамОтчетов.ПараметрОтчетов КАК ПараметрОтчетов
	               |		ИЗ
	               |			Документ.КАНАТ_РезультатИспытаний.РезультатИспытаний КАК КАНАТ_РезультатИспытанийРезультатИспытаний
	               |				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КАНАТКач_СоответствиеПоказателейНТДКолонкамОтчетов КАК КАНАТКач_СоответствиеПоказателейНТДКолонкамОтчетов
	               |				ПО КАНАТ_РезультатИспытанийРезультатИспытаний.Показатель = КАНАТКач_СоответствиеПоказателейНТДКолонкамОтчетов.Показатель
	               |		ГДЕ
	               |			КАНАТКач_СоответствиеПоказателейНТДКолонкамОтчетов.ПараметрОтчетов В(&МассивПараметров)) КАК ВложенныйЗапрос
	               |		ПО КАНАТ_РезультатИспытаний.Ссылка = ВложенныйЗапрос.Ссылка
	               |ГДЕ
	               |	КАНАТ_РезультатИспытаний.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |	И КАНАТ_РезультатИспытаний.Продукция.КАНАТКач_ВидДляКонтроляКачества.ВидДляОтчета = &ВидДляОтчета
	               |	И КАНАТ_РезультатИспытаний.Цех = &Цех
				   |	И КАНАТ_РезультатИспытаний.Проведен = Истина
	               |ИТОГИ
	               |	МАКСИМУМ(ПродукцияКод),
	               |	МАКСИМУМ(ПродукцияНаименование),
	               |	МАКСИМУМ(Цех),
	               |	МАКСИМУМ(Оборудование),
	               |	МАКСИМУМ(Влажность),
	               |	МАКСИМУМ(Результат)
	               |ПО
	               |	Ссылка";
	
	Запрос.УстановитьПараметр("МассивПараметров", ПараметрыСтолбцов());
	Запрос.УстановитьПараметр("ДатаНачала", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ВидДляОтчета", Перечисления.КАНАТКач_ВидКачестваДляОтчета.Полуфабрикаты);
	Запрос.УстановитьПараметр("Цех", Цех);

	
	Возврат Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);;
	
КонецФункции