Функция ДобавитьКомандуСоздатьРезультатИспытаний(КомандыСозданияНаОсновании) Экспорт
	Если ПравоДоступа("Добавление", Метаданные.Документы.КАНАТ_РезультатИспытаний) Тогда
		
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.КАНАТ_РезультатИспытаний.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = ОбщегоНазначенияУТ.ПредставлениеОбъекта(Метаданные.Документы.КАНАТ_РезультатИспытаний);
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		КомандаСоздатьНаОсновании.ФункциональныеОпции = "ИспользоватьПроизводство";
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции


//++ Гурьев 10.10.23 ЧТЗ_К3
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Обработка.КАНАТКач_ПечатьРезультатИспытания";
	КомандаПечати.Идентификатор = "ПротоколРезультатовИспытаний";
	КомандаПечати.Представление = "Протокол результатов испытаний";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Обработка.КАНАТКач_ПечатьРезультатИспытания";
	КомандаПечати.Идентификатор = "ПротоколРезультатовИспытанийДляМорскогоРегистра";
	КомандаПечати.Представление = "Протокол результатов испытаний для морского регистра";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Обработка.КАНАТКач_ПечатьРезультатИспытания";
	КомандаПечати.Идентификатор = "АктОтбораОбразцов";
	КомандаПечати.Представление = "Акт отбора образцов";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	
	//++Бит Трейгер П.М. 19.12.2024 Блок Качества. Переделка. Закоментил
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.МенеджерПечати = "Обработка.КАНАТКач_ПечатьРезультатИспытания";
	//КомандаПечати.Идентификатор = "СертификатКачества";
	//КомандаПечати.Представление = "Сертификат качества";
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	//
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.МенеджерПечати = "Обработка.КАНАТКач_ПечатьРезультатИспытания";
	//КомандаПечати.Идентификатор = "СертификатКачестваМЧС";
	//КомандаПечати.Представление = "Сертификат качества Страховочно-Спасательного со знаком МЧС";
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	//
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.МенеджерПечати = "Обработка.КАНАТКач_ПечатьРезультатИспытания";
	//КомандаПечати.Идентификатор = "СертификатКачестваБезМЧС";
	//КомандаПечати.Представление = "Сертификат качества Страховочно-Спасательного без знака МЧС";
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	//
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.МенеджерПечати = "Обработка.КАНАТКач_ПечатьРезультатИспытания";
	//КомандаПечати.Идентификатор = "СертификатКачестваРМРС";
	//КомандаПечати.Представление = "Сертификат качества для Российского Морского Регистра Судоходства";
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	//
	////КомандаПечати = КомандыПечати.Добавить();
	////КомандаПечати.МенеджерПечати = "Обработка.КАНАТКач_ПечатьРезультатИспытания";
	////КомандаПечати.Идентификатор = "СертификатКачестваРРР";
	////КомандаПечати.Представление = "Сертификат качества для Речного Регистра (РРР)";
	////КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	//
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.МенеджерПечати = "Обработка.КАНАТКач_ПечатьРезультатИспытания";
	//КомандаПечати.Идентификатор = "СертификатКачестваРКО";
	//КомандаПечати.Представление = "Сертификат качества для Российского Классификационного Общества (РКО)";
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	
	//--Бит Трейгер П.М. 19.12.2024 Блок Качества. Переделка.
КонецПроцедуры
//-- Гурьев 10.10.23 ЧТЗ_К3

