
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПроизводствоБезЗаказа") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	ПроизводствоБезЗаказа.Подразделение КАК Цех,
		|	НоменклатураПродукция.Ссылка КАК Продукция,
		|	НоменклатураПродукция.КАНАТ_НТДНоменклатуры КАК НТДПродукции,
		|	ВЫБОР
		|	КОГДА ТИПЗНАЧЕНИЯ(Назначения.Заказ) = ТИП(Документ.ЗаказКлиента) ТОГДА Назначения.Заказ
		|	ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
		|	КОНЕЦ КАК ЗаказКлиента,
		|	НоменклатураСырье.Ссылка КАК Сырье,
		|	НоменклатураСырье.КАНАТ_НТДНоменклатуры КАК НТДСырья,
		|	ПроизводствоБезЗаказаМатериалыИРаботы.Характеристика КАК ХарактеристикаСырья,
		|	ПроизводствоБезЗаказаМатериалыИРаботы.Склад
		|	
		|ИЗ
		|	Документ.ПроизводствоБезЗаказа КАК ПроизводствоБезЗаказа
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа.ВыходныеИзделия КАК ПроизводствоБезЗаказаВыходныеИзделия
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураПродукция
		|			ПО ПроизводствоБезЗаказаВыходныеИзделия.Номенклатура = НоменклатураПродукция.Ссылка
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
		|			ПО ПроизводствоБезЗаказаВыходныеИзделия.Назначение = Назначения.Ссылка
		|		ПО (ПроизводствоБезЗаказа.Ссылка = ПроизводствоБезЗаказаВыходныеИзделия.Ссылка 
		|			И ПроизводствоБезЗаказаВыходныеИзделия.НомерСтроки = 1)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа.МатериалыИРаботы КАК ПроизводствоБезЗаказаМатериалыИРаботы
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСырье
		|			ПО ПроизводствоБезЗаказаМатериалыИРаботы.Номенклатура = НоменклатураСырье.Ссылка
		|		ПО ПроизводствоБезЗаказа.Ссылка = ПроизводствоБезЗаказаМатериалыИРаботы.Ссылка 
		|ГДЕ
		|	ПроизводствоБезЗаказа.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
		
		Заполнено = Ложь;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если НЕ Заполнено Тогда
				
				Заполнено = Истина;
				ЗаказНаПроизводство = ДанныеЗаполнения;
				Цех = Выборка.Цех;
				ДокументОснование = ДанныеЗаполнения;
				Продукция = Выборка.Продукция;
				НТДПродукции = Выборка.НТДПродукции;
				ЗаказКлиента = Выборка.ЗаказКлиента;
				Склад = Выборка.Склад;
				
				
			КонецЕсли;
			
			НоваяСтрока = Сырье.Добавить();
			НоваяСтрока.Сырье = Выборка.Сырье;
			НоваяСтрока.НТДСырья = Выборка.НТДСырья;
			НоваяСтрока.ХарактеристикаСырья = Выборка.ХарактеристикаСырья;
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЭтапПроизводства2_2") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	ЭтапПроизводства2_2.Подразделение КАК Цех,
		|	НоменклатураПродукция.Ссылка КАК Продукция,
		|	НоменклатураПродукция.КАНАТ_НТДНоменклатуры КАК НТДПродукции,
		|	ВЫБОР
		|	КОГДА ТИПЗНАЧЕНИЯ(ЭтапПроизводства2_2.Распоряжение.ДокументОснование) = ТИП(Документ.ЗаказКлиента) ТОГДА ЭтапПроизводства2_2.Распоряжение.ДокументОснование
		|	ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
		|	КОНЕЦ КАК ЗаказКлиента,
		|	НоменклатураСырье.Ссылка КАК Сырье,
		|	НоменклатураСырье.КАНАТ_НТДНоменклатуры КАК НТДСырья,
		|	ЭтапПроизводства2_2РасходМатериаловИРабот.Характеристика КАК ХарактеристикаСырья,
		|	ЭтапПроизводства2_2.Распоряжение КАК ЗаказНаПроизводство,
		|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Склад КАК Склад
		|	
		|ИЗ
		|	Документ.ЭтапПроизводства2_2 КАК ЭтапПроизводства2_2
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ЭтапПроизводства2_2ВыходныеИзделия
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураПродукция
		|			ПО ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура = НоменклатураПродукция.Ссылка
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
		|			ПО ЭтапПроизводства2_2ВыходныеИзделия.Назначение = Назначения.Ссылка
		|		ПО (ЭтапПроизводства2_2.Ссылка = ЭтапПроизводства2_2ВыходныеИзделия.Ссылка 
		|			И ЭтапПроизводства2_2ВыходныеИзделия.НомерСтроки = 1)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2.РасходМатериаловИРабот КАК ЭтапПроизводства2_2РасходМатериаловИРабот
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСырье
		|			ПО ЭтапПроизводства2_2РасходМатериаловИРабот.Номенклатура = НоменклатураСырье.Ссылка
		|		ПО ЭтапПроизводства2_2.Ссылка = ЭтапПроизводства2_2РасходМатериаловИРабот.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2.ОбеспечениеМатериаламиИРаботами КАК ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами
		|		ПО (ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка = ЭтапПроизводства2_2.Ссылка
		|			И  ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.НомерСтроки = 1)
		|ГДЕ
		|	ЭтапПроизводства2_2.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
		
		Заполнено = Ложь;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если НЕ Заполнено Тогда
				
				Заполнено = Истина;
				ЗаказНаПроизводство = Выборка.ЗаказНаПроизводство;
				ДокументОснование = ДанныеЗаполнения;
				Цех = Выборка.Цех;
				Продукция = Документы.ЭтапПроизводства2_2.ДанныеПартииПроизводства(ДанныеЗаполнения.Распоряжение,
																				   ДанныеЗаполнения.НазначениеПродукция, 
																				   ДанныеЗаполнения.ПартияПроизводства).ОсновноеИзделиеНоменклатура;
				НТДПродукции = Продукция.КАНАТ_НТДНоменклатуры;
				ЗаказКлиента = Выборка.ЗаказКлиента;
				Склад = Выборка.Склад;
				
				
			КонецЕсли;
			
			НоваяСтрока = Сырье.Добавить();
			НоваяСтрока.Сырье = Выборка.Сырье;
			НоваяСтрока.НТДСырья = Выборка.НТДСырья;
			НоваяСтрока.ХарактеристикаСырья = Выборка.ХарактеристикаСырья;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Продукция) Тогда
		
		ЗаполнитьРезультатИспытаний();
		ВидГотовойПродукцииИспытания = Продукция.КАНАТКач_ВидДляКонтроляКачества;
		
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьРезультатИспытаний()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НоменклатураКАНАТ_ПоказателиНТД.Показатель КАК Показатель,
		|	НоменклатураКАНАТ_ПоказателиНТД.Размерность КАК ЕдИзм,
		|	НоменклатураКАНАТ_ПоказателиНТД.Значение КАК Норма,
		|	НоменклатураКАНАТ_ПоказателиНТД.Отклонение КАК ДопустимоеОтклонение,
		|	Истина КАК ВыводитьВПФ
		|ИЗ
		|	Справочник.Номенклатура.КАНАТ_ПоказателиНТД КАК НоменклатураКАНАТ_ПоказателиНТД
		|ГДЕ
		|	НоменклатураКАНАТ_ПоказателиНТД.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Продукция);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	РезультатИспытаний.Загрузить(РезультатЗапроса);
	
КонецПроцедуры
