
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокРаспоряженийНаОтгрузку.Параметры.УстановитьЗначениеПараметра("ДокументОснование",Параметры.ДокументОснование);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокРаспоряженийНаОтгрузкуВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.СписокРаспоряженийНаОтгрузку.ТекущиеДанные;
	Если ТекущиеДанные<> Неопределено Тогда
		ПоказатьЗначение(,ТекущиеДанные.РаспоряжениеНаОтгрузку);
	КонецЕсли;
	
КонецПроцедуры
