
&НаСервере
Процедура КАНАТ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//·++·Гурьев·18.08.23·#2.9·Добавление флажка не используется в ГОЗ
	ПолеВвода = Элементы.Добавить(
		"КАНАТ_НеИспользуетсяВГОЗ",
		Тип("ПолеФормы"), 
		Элементы.ГруппаПараметрыПоставки);	
	ПолеВвода.Заголовок = "Не используется в ГОЗ";
	ПолеВвода.Вид = ВидПоляФормы.ПолеФлажка;
	ПолеВвода.ПутьКДанным = "Объект.КАНАТ_НеИспользуетсяВГОЗ";
	ПолеВвода.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	//·--·Гурьев·18.08.23
КонецПроцедуры

&НаСервере
Процедура КАНАТ_ИнформацияДляПокупателяФорматированныйДокументПриИзмененииПослеНаСервере()
	
	 Объект.КАНАТ_ИнформацияДляПокупателя = ИнформацияДляПокупателяФорматированныйДокумент.ПолучитьТекст();
	
КонецПроцедуры

&НаКлиенте
Процедура КАНАТ_ИнформацияДляПокупателяФорматированныйДокументПриИзмененииПосле(Элемент)
	КАНАТ_ИнформацияДляПокупателяФорматированныйДокументПриИзмененииПослеНаСервере();
КонецПроцедуры
