
&НаСервере
Процедура КАНАТ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//БИТ_Байков ++ 23.08.23  ЧТЗ 2_5
		НовыйЭлемент = Элементы.Добавить("КАНАТ_ДанныеДоверенности",Тип("ПолеФормы"), Элементы.ГруппаОсновныеСведения);
	    НовыйЭлемент.ПутьКДанным = "объект.КАНАТ_ДанныеДоверенности";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Данные доверенности";
		НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	//БИТ_Байков -
	
	//БИТ_Гурьев__22.03.24++
	ЭлементПодписант = Элементы.Добавить("КАНАТ_Подписант", Тип("ПолеФормы"), Элементы.ГруппаОсновныеСведения);
	ЭлементПодписант.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементПодписант.ПутьКДанным = "Объект.КАНАТ_Подписант";
	ЭлементПодписант.Заголовок = "Подписант";
	//БИТ_Гурьев__22.03.24--
КонецПроцедуры

//БИТ_Гурьев__22.03.24++
&НаСервере
Процедура КАНАТ_УдалитьДругихПодписантов()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтактныеЛицаПартнеров.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
	               |ГДЕ
	               |	КонтактныеЛицаПартнеров.Владелец = &Владелец
	               |	И КонтактныеЛицаПартнеров.КАНАТ_Подписант = ИСТИНА
	               |	И КонтактныеЛицаПартнеров.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Владелец", Объект.Владелец);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		КонтактноеЛицоОбъект = Выборка.Ссылка.ПолучитьОбъект();
		КонтактноеЛицоОбъект.КАНАТ_Подписант = Ложь;
		КонтактноеЛицоОбъект.Записать();
		
	КонецЦикла;

КонецПроцедуры //БИТ_Гурьев__22.03.24--

&НаСервере
Процедура КАНАТ_ПослеЗаписиНаСервереПосле(ТекущийОбъект, ПараметрыЗаписи)
	Если Объект.КАНАТ_Подписант Тогда
		
		КАНАТ_УдалитьДругихПодписантов();
		
	КонецЕсли;
КонецПроцедуры
